OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** AIPS - Register Layout Typedef */
typedef struct
{
    __IO uint32_t MPRA; /**< Master Privilege Register A, offset: 0x0 */
    uint8_t       RESERVED_0[28];
    __IO uint32_t PACR[AIPS_PACR_COUNT]; /**< Peripheral Access Control Register, array offset: 0x20, array step: 0x4 */
    uint8_t       RESERVED_1[16];
    __IO uint32_t OPACR[AIPS_OPACR_COUNT]; /**< Off-Platform Peripheral Access Control Register, array offset: 0x40,
                                              array step: 0x4 */
} AIPS_Type, *AIPS_MemMapPtr;

/** Number of instances of the AIPS module. */
#    define AIPS_INSTANCE_COUNT (1u)

/* AIPS - Peripheral instance base addresses */
/** Peripheral AIPS base address */
#    define AIPS_BASE (0x40000000u)
/** Peripheral AIPS base pointer */
#    define AIPS ((AIPS_Type*) AIPS_BASE)
/** Array initializer of AIPS peripheral base addresses */
#    define AIPS_BASE_ADDRS \
        {                   \
            AIPS_BASE       \
        }
/** Array initializer of AIPS peripheral base pointers */
#    define AIPS_BASE_PTRS \
        {                  \
            AIPS           \
        }

/* ----------------------------------------------------------------------------
   -- AIPS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AIPS_Register_Masks AIPS Register Masks
 * @{
 */

/* MPRA Bit Fields */
#    define AIPS_MPRA_MPL2_MASK 0x100000u
#    define AIPS_MPRA_MPL2_SHIFT 20u
#    define AIPS_MPRA_MPL2_WIDTH 1u
#    define AIPS_MPRA_MPL2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MPL2_SHIFT)) & AIPS_MPRA_MPL2_MASK)
#    define AIPS_MPRA_MTW2_MASK 0x200000u
#    define AIPS_MPRA_MTW2_SHIFT 21u
#    define AIPS_MPRA_MTW2_WIDTH 1u
#    define AIPS_MPRA_MTW2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTW2_SHIFT)) & AIPS_MPRA_MTW2_MASK)
#    define AIPS_MPRA_MTR2_MASK 0x400000u
#    define AIPS_MPRA_MTR2_SHIFT 22u
#    define AIPS_MPRA_MTR2_WIDTH 1u
#    define AIPS_MPRA_MTR2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTR2_SHIFT)) & AIPS_MPRA_MTR2_MASK)
#    define AIPS_MPRA_MPL1_MASK 0x1000000u
#    define AIPS_MPRA_MPL1_SHIFT 24u
#    define AIPS_MPRA_MPL1_WIDTH 1u
#    define AIPS_MPRA_MPL1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MPL1_SHIFT)) & AIPS_MPRA_MPL1_MASK)
#    define AIPS_MPRA_MTW1_MASK 0x2000000u
#    define AIPS_MPRA_MTW1_SHIFT 25u
#    define AIPS_MPRA_MTW1_WIDTH 1u
#    define AIPS_MPRA_MTW1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTW1_SHIFT)) & AIPS_MPRA_MTW1_MASK)
#    define AIPS_MPRA_MTR1_MASK 0x4000000u
#    define AIPS_MPRA_MTR1_SHIFT 26u
#    define AIPS_MPRA_MTR1_WIDTH 1u
#    define AIPS_MPRA_MTR1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTR1_SHIFT)) & AIPS_MPRA_MTR1_MASK)
#    define AIPS_MPRA_MPL0_MASK 0x10000000u
#    define AIPS_MPRA_MPL0_SHIFT 28u
#    define AIPS_MPRA_MPL0_WIDTH 1u
#    define AIPS_MPRA_MPL0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MPL0_SHIFT)) & AIPS_MPRA_MPL0_MASK)
#    define AIPS_MPRA_MTW0_MASK 0x20000000u
#    define AIPS_MPRA_MTW0_SHIFT 29u
#    define AIPS_MPRA_MTW0_WIDTH 1u
#    define AIPS_MPRA_MTW0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTW0_SHIFT)) & AIPS_MPRA_MTW0_MASK)
#    define AIPS_MPRA_MTR0_MASK 0x40000000u
#    define AIPS_MPRA_MTR0_SHIFT 30u
#    define AIPS_MPRA_MTR0_WIDTH 1u
#    define AIPS_MPRA_MTR0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_MPRA_MTR0_SHIFT)) & AIPS_MPRA_MTR0_MASK)
/* PACR Bit Fields */
#    define AIPS_PACR_TP5_MASK 0x100u
#    define AIPS_PACR_TP5_SHIFT 8u
#    define AIPS_PACR_TP5_WIDTH 1u
#    define AIPS_PACR_TP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_TP5_SHIFT)) & AIPS_PACR_TP5_MASK)
#    define AIPS_PACR_WP5_MASK 0x200u
#    define AIPS_PACR_WP5_SHIFT 9u
#    define AIPS_PACR_WP5_WIDTH 1u
#    define AIPS_PACR_WP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_WP5_SHIFT)) & AIPS_PACR_WP5_MASK)
#    define AIPS_PACR_SP5_MASK 0x400u
#    define AIPS_PACR_SP5_SHIFT 10u
#    define AIPS_PACR_SP5_WIDTH 1u
#    define AIPS_PACR_SP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_SP5_SHIFT)) & AIPS_PACR_SP5_MASK)
#    define AIPS_PACR_TP1_MASK 0x1000000u
#    define AIPS_PACR_TP1_SHIFT 24u
#    define AIPS_PACR_TP1_WIDTH 1u
#    define AIPS_PACR_TP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_TP1_SHIFT)) & AIPS_PACR_TP1_MASK)
#    define AIPS_PACR_WP1_MASK 0x2000000u
#    define AIPS_PACR_WP1_SHIFT 25u
#    define AIPS_PACR_WP1_WIDTH 1u
#    define AIPS_PACR_WP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_WP1_SHIFT)) & AIPS_PACR_WP1_MASK)
#    define AIPS_PACR_SP1_MASK 0x4000000u
#    define AIPS_PACR_SP1_SHIFT 26u
#    define AIPS_PACR_SP1_WIDTH 1u
#    define AIPS_PACR_SP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_SP1_SHIFT)) & AIPS_PACR_SP1_MASK)
#    define AIPS_PACR_TP0_MASK 0x10000000u
#    define AIPS_PACR_TP0_SHIFT 28u
#    define AIPS_PACR_TP0_WIDTH 1u
#    define AIPS_PACR_TP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_TP0_SHIFT)) & AIPS_PACR_TP0_MASK)
#    define AIPS_PACR_WP0_MASK 0x20000000u
#    define AIPS_PACR_WP0_SHIFT 29u
#    define AIPS_PACR_WP0_WIDTH 1u
#    define AIPS_PACR_WP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_WP0_SHIFT)) & AIPS_PACR_WP0_MASK)
#    define AIPS_PACR_SP0_MASK 0x40000000u
#    define AIPS_PACR_SP0_SHIFT 30u
#    define AIPS_PACR_SP0_WIDTH 1u
#    define AIPS_PACR_SP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_PACR_SP0_SHIFT)) & AIPS_PACR_SP0_MASK)
/* OPACR Bit Fields */
#    define AIPS_OPACR_TP7_MASK 0x1u
#    define AIPS_OPACR_TP7_SHIFT 0u
#    define AIPS_OPACR_TP7_WIDTH 1u
#    define AIPS_OPACR_TP7(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP7_SHIFT)) & AIPS_OPACR_TP7_MASK)
#    define AIPS_OPACR_WP7_MASK 0x2u
#    define AIPS_OPACR_WP7_SHIFT 1u
#    define AIPS_OPACR_WP7_WIDTH 1u
#    define AIPS_OPACR_WP7(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP7_SHIFT)) & AIPS_OPACR_WP7_MASK)
#    define AIPS_OPACR_SP7_MASK 0x4u
#    define AIPS_OPACR_SP7_SHIFT 2u
#    define AIPS_OPACR_SP7_WIDTH 1u
#    define AIPS_OPACR_SP7(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP7_SHIFT)) & AIPS_OPACR_SP7_MASK)
#    define AIPS_OPACR_TP6_MASK 0x10u
#    define AIPS_OPACR_TP6_SHIFT 4u
#    define AIPS_OPACR_TP6_WIDTH 1u
#    define AIPS_OPACR_TP6(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP6_SHIFT)) & AIPS_OPACR_TP6_MASK)
#    define AIPS_OPACR_WP6_MASK 0x20u
#    define AIPS_OPACR_WP6_SHIFT 5u
#    define AIPS_OPACR_WP6_WIDTH 1u
#    define AIPS_OPACR_WP6(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP6_SHIFT)) & AIPS_OPACR_WP6_MASK)
#    define AIPS_OPACR_SP6_MASK 0x40u
#    define AIPS_OPACR_SP6_SHIFT 6u
#    define AIPS_OPACR_SP6_WIDTH 1u
#    define AIPS_OPACR_SP6(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP6_SHIFT)) & AIPS_OPACR_SP6_MASK)
#    define AIPS_OPACR_TP5_MASK 0x100u
#    define AIPS_OPACR_TP5_SHIFT 8u
#    define AIPS_OPACR_TP5_WIDTH 1u
#    define AIPS_OPACR_TP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP5_SHIFT)) & AIPS_OPACR_TP5_MASK)
#    define AIPS_OPACR_WP5_MASK 0x200u
#    define AIPS_OPACR_WP5_SHIFT 9u
#    define AIPS_OPACR_WP5_WIDTH 1u
#    define AIPS_OPACR_WP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP5_SHIFT)) & AIPS_OPACR_WP5_MASK)
#    define AIPS_OPACR_SP5_MASK 0x400u
#    define AIPS_OPACR_SP5_SHIFT 10u
#    define AIPS_OPACR_SP5_WIDTH 1u
#    define AIPS_OPACR_SP5(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP5_SHIFT)) & AIPS_OPACR_SP5_MASK)
#    define AIPS_OPACR_TP4_MASK 0x1000u
#    define AIPS_OPACR_TP4_SHIFT 12u
#    define AIPS_OPACR_TP4_WIDTH 1u
#    define AIPS_OPACR_TP4(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP4_SHIFT)) & AIPS_OPACR_TP4_MASK)
#    define AIPS_OPACR_WP4_MASK 0x2000u
#    define AIPS_OPACR_WP4_SHIFT 13u
#    define AIPS_OPACR_WP4_WIDTH 1u
#    define AIPS_OPACR_WP4(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP4_SHIFT)) & AIPS_OPACR_WP4_MASK)
#    define AIPS_OPACR_SP4_MASK 0x4000u
#    define AIPS_OPACR_SP4_SHIFT 14u
#    define AIPS_OPACR_SP4_WIDTH 1u
#    define AIPS_OPACR_SP4(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP4_SHIFT)) & AIPS_OPACR_SP4_MASK)
#    define AIPS_OPACR_TP3_MASK 0x10000u
#    define AIPS_OPACR_TP3_SHIFT 16u
#    define AIPS_OPACR_TP3_WIDTH 1u
#    define AIPS_OPACR_TP3(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP3_SHIFT)) & AIPS_OPACR_TP3_MASK)
#    define AIPS_OPACR_WP3_MASK 0x20000u
#    define AIPS_OPACR_WP3_SHIFT 17u
#    define AIPS_OPACR_WP3_WIDTH 1u
#    define AIPS_OPACR_WP3(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP3_SHIFT)) & AIPS_OPACR_WP3_MASK)
#    define AIPS_OPACR_SP3_MASK 0x40000u
#    define AIPS_OPACR_SP3_SHIFT 18u
#    define AIPS_OPACR_SP3_WIDTH 1u
#    define AIPS_OPACR_SP3(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP3_SHIFT)) & AIPS_OPACR_SP3_MASK)
#    define AIPS_OPACR_TP2_MASK 0x100000u
#    define AIPS_OPACR_TP2_SHIFT 20u
#    define AIPS_OPACR_TP2_WIDTH 1u
#    define AIPS_OPACR_TP2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP2_SHIFT)) & AIPS_OPACR_TP2_MASK)
#    define AIPS_OPACR_WP2_MASK 0x200000u
#    define AIPS_OPACR_WP2_SHIFT 21u
#    define AIPS_OPACR_WP2_WIDTH 1u
#    define AIPS_OPACR_WP2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP2_SHIFT)) & AIPS_OPACR_WP2_MASK)
#    define AIPS_OPACR_SP2_MASK 0x400000u
#    define AIPS_OPACR_SP2_SHIFT 22u
#    define AIPS_OPACR_SP2_WIDTH 1u
#    define AIPS_OPACR_SP2(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP2_SHIFT)) & AIPS_OPACR_SP2_MASK)
#    define AIPS_OPACR_TP1_MASK 0x1000000u
#    define AIPS_OPACR_TP1_SHIFT 24u
#    define AIPS_OPACR_TP1_WIDTH 1u
#    define AIPS_OPACR_TP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP1_SHIFT)) & AIPS_OPACR_TP1_MASK)
#    define AIPS_OPACR_WP1_MASK 0x2000000u
#    define AIPS_OPACR_WP1_SHIFT 25u
#    define AIPS_OPACR_WP1_WIDTH 1u
#    define AIPS_OPACR_WP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP1_SHIFT)) & AIPS_OPACR_WP1_MASK)
#    define AIPS_OPACR_SP1_MASK 0x4000000u
#    define AIPS_OPACR_SP1_SHIFT 26u
#    define AIPS_OPACR_SP1_WIDTH 1u
#    define AIPS_OPACR_SP1(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP1_SHIFT)) & AIPS_OPACR_SP1_MASK)
#    define AIPS_OPACR_TP0_MASK 0x10000000u
#    define AIPS_OPACR_TP0_SHIFT 28u
#    define AIPS_OPACR_TP0_WIDTH 1u
#    define AIPS_OPACR_TP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_TP0_SHIFT)) & AIPS_OPACR_TP0_MASK)
#    define AIPS_OPACR_WP0_MASK 0x20000000u
#    define AIPS_OPACR_WP0_SHIFT 29u
#    define AIPS_OPACR_WP0_WIDTH 1u
#    define AIPS_OPACR_WP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_WP0_SHIFT)) & AIPS_OPACR_WP0_MASK)
#    define AIPS_OPACR_SP0_MASK 0x40000000u
#    define AIPS_OPACR_SP0_SHIFT 30u
#    define AIPS_OPACR_SP0_WIDTH 1u
#    define AIPS_OPACR_SP0(x) (((uint32_t)(((uint32_t)(x)) << AIPS_OPACR_SP0_SHIFT)) & AIPS_OPACR_SP0_MASK)

/*!
 * @}
 */ /* end of group AIPS_Register_Masks */

/*!
 * @}
 */ /* end of group AIPS_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- CAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Peripheral_Access_Layer CAN Peripheral Access Layer
 * @{
 */

