OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
        (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_1_SHIFT)) & CAN_RAMn_DATA_BYTE_1_MASK)
#    define CAN_RAMn_DATA_BYTE_0_MASK 0xFF000000u
#    define CAN_RAMn_DATA_BYTE_0_SHIFT 24u
#    define CAN_RAMn_DATA_BYTE_0_WIDTH 8u
#    define CAN_RAMn_DATA_BYTE_0(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_0_SHIFT)) & CAN_RAMn_DATA_BYTE_0_MASK)
/* RXIMR Bit Fields */
#    define CAN_RXIMR_MI_MASK 0xFFFFFFFFu
#    define CAN_RXIMR_MI_SHIFT 0u
#    define CAN_RXIMR_MI_WIDTH 32u
#    define CAN_RXIMR_MI(x) (((uint32_t)(((uint32_t)(x)) << CAN_RXIMR_MI_SHIFT)) & CAN_RXIMR_MI_MASK)
/* CTRL1_PN Bit Fields */
#    define CAN_CTRL1_PN_FCS_MASK 0x3u
#    define CAN_CTRL1_PN_FCS_SHIFT 0u
#    define CAN_CTRL1_PN_FCS_WIDTH 2u
#    define CAN_CTRL1_PN_FCS(x) (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_FCS_SHIFT)) & CAN_CTRL1_PN_FCS_MASK)
#    define CAN_CTRL1_PN_IDFS_MASK 0xCu
#    define CAN_CTRL1_PN_IDFS_SHIFT 2u
#    define CAN_CTRL1_PN_IDFS_WIDTH 2u
#    define CAN_CTRL1_PN_IDFS(x) (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_IDFS_SHIFT)) & CAN_CTRL1_PN_IDFS_MASK)
#    define CAN_CTRL1_PN_PLFS_MASK 0x30u
#    define CAN_CTRL1_PN_PLFS_SHIFT 4u
#    define CAN_CTRL1_PN_PLFS_WIDTH 2u
#    define CAN_CTRL1_PN_PLFS(x) (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_PLFS_SHIFT)) & CAN_CTRL1_PN_PLFS_MASK)
#    define CAN_CTRL1_PN_NMATCH_MASK 0xFF00u
#    define CAN_CTRL1_PN_NMATCH_SHIFT 8u
#    define CAN_CTRL1_PN_NMATCH_WIDTH 8u
#    define CAN_CTRL1_PN_NMATCH(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_NMATCH_SHIFT)) & CAN_CTRL1_PN_NMATCH_MASK)
#    define CAN_CTRL1_PN_WUMF_MSK_MASK 0x10000u
#    define CAN_CTRL1_PN_WUMF_MSK_SHIFT 16u
#    define CAN_CTRL1_PN_WUMF_MSK_WIDTH 1u
#    define CAN_CTRL1_PN_WUMF_MSK(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_WUMF_MSK_SHIFT)) & CAN_CTRL1_PN_WUMF_MSK_MASK)
#    define CAN_CTRL1_PN_WTOF_MSK_MASK 0x20000u
#    define CAN_CTRL1_PN_WTOF_MSK_SHIFT 17u
#    define CAN_CTRL1_PN_WTOF_MSK_WIDTH 1u
#    define CAN_CTRL1_PN_WTOF_MSK(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_WTOF_MSK_SHIFT)) & CAN_CTRL1_PN_WTOF_MSK_MASK)
/* CTRL2_PN Bit Fields */
#    define CAN_CTRL2_PN_MATCHTO_MASK 0xFFFFu
#    define CAN_CTRL2_PN_MATCHTO_SHIFT 0u
#    define CAN_CTRL2_PN_MATCHTO_WIDTH 16u
#    define CAN_CTRL2_PN_MATCHTO(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_PN_MATCHTO_SHIFT)) & CAN_CTRL2_PN_MATCHTO_MASK)
/* WU_MTC Bit Fields */
#    define CAN_WU_MTC_MCOUNTER_MASK 0xFF00u
#    define CAN_WU_MTC_MCOUNTER_SHIFT 8u
#    define CAN_WU_MTC_MCOUNTER_WIDTH 8u
#    define CAN_WU_MTC_MCOUNTER(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_MCOUNTER_SHIFT)) & CAN_WU_MTC_MCOUNTER_MASK)
#    define CAN_WU_MTC_WUMF_MASK 0x10000u
#    define CAN_WU_MTC_WUMF_SHIFT 16u
#    define CAN_WU_MTC_WUMF_WIDTH 1u
#    define CAN_WU_MTC_WUMF(x) (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_WUMF_SHIFT)) & CAN_WU_MTC_WUMF_MASK)
#    define CAN_WU_MTC_WTOF_MASK 0x20000u
#    define CAN_WU_MTC_WTOF_SHIFT 17u
#    define CAN_WU_MTC_WTOF_WIDTH 1u
#    define CAN_WU_MTC_WTOF(x) (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_WTOF_SHIFT)) & CAN_WU_MTC_WTOF_MASK)
/* FLT_ID1 Bit Fields */
#    define CAN_FLT_ID1_FLT_ID1_MASK 0x1FFFFFFFu
#    define CAN_FLT_ID1_FLT_ID1_SHIFT 0u
#    define CAN_FLT_ID1_FLT_ID1_WIDTH 29u
#    define CAN_FLT_ID1_FLT_ID1(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_ID1_SHIFT)) & CAN_FLT_ID1_FLT_ID1_MASK)
#    define CAN_FLT_ID1_FLT_RTR_MASK 0x20000000u
#    define CAN_FLT_ID1_FLT_RTR_SHIFT 29u
#    define CAN_FLT_ID1_FLT_RTR_WIDTH 1u
#    define CAN_FLT_ID1_FLT_RTR(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_RTR_SHIFT)) & CAN_FLT_ID1_FLT_RTR_MASK)
#    define CAN_FLT_ID1_FLT_IDE_MASK 0x40000000u
#    define CAN_FLT_ID1_FLT_IDE_SHIFT 30u
#    define CAN_FLT_ID1_FLT_IDE_WIDTH 1u
#    define CAN_FLT_ID1_FLT_IDE(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_IDE_SHIFT)) & CAN_FLT_ID1_FLT_IDE_MASK)
/* FLT_DLC Bit Fields */
#    define CAN_FLT_DLC_FLT_DLC_HI_MASK 0xFu
#    define CAN_FLT_DLC_FLT_DLC_HI_SHIFT 0u
#    define CAN_FLT_DLC_FLT_DLC_HI_WIDTH 4u
#    define CAN_FLT_DLC_FLT_DLC_HI(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_DLC_FLT_DLC_HI_SHIFT)) & CAN_FLT_DLC_FLT_DLC_HI_MASK)
#    define CAN_FLT_DLC_FLT_DLC_LO_MASK 0xF0000u
#    define CAN_FLT_DLC_FLT_DLC_LO_SHIFT 16u
#    define CAN_FLT_DLC_FLT_DLC_LO_WIDTH 4u
#    define CAN_FLT_DLC_FLT_DLC_LO(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_DLC_FLT_DLC_LO_SHIFT)) & CAN_FLT_DLC_FLT_DLC_LO_MASK)
/* PL1_LO Bit Fields */
#    define CAN_PL1_LO_Data_byte_3_MASK 0xFFu
#    define CAN_PL1_LO_Data_byte_3_SHIFT 0u
#    define CAN_PL1_LO_Data_byte_3_WIDTH 8u
#    define CAN_PL1_LO_Data_byte_3(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_3_SHIFT)) & CAN_PL1_LO_Data_byte_3_MASK)
#    define CAN_PL1_LO_Data_byte_2_MASK 0xFF00u
#    define CAN_PL1_LO_Data_byte_2_SHIFT 8u
#    define CAN_PL1_LO_Data_byte_2_WIDTH 8u
#    define CAN_PL1_LO_Data_byte_2(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_2_SHIFT)) & CAN_PL1_LO_Data_byte_2_MASK)
#    define CAN_PL1_LO_Data_byte_1_MASK 0xFF0000u
#    define CAN_PL1_LO_Data_byte_1_SHIFT 16u
#    define CAN_PL1_LO_Data_byte_1_WIDTH 8u
#    define CAN_PL1_LO_Data_byte_1(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_1_SHIFT)) & CAN_PL1_LO_Data_byte_1_MASK)
#    define CAN_PL1_LO_Data_byte_0_MASK 0xFF000000u
#    define CAN_PL1_LO_Data_byte_0_SHIFT 24u
#    define CAN_PL1_LO_Data_byte_0_WIDTH 8u
#    define CAN_PL1_LO_Data_byte_0(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_0_SHIFT)) & CAN_PL1_LO_Data_byte_0_MASK)
/* PL1_HI Bit Fields */
#    define CAN_PL1_HI_Data_byte_7_MASK 0xFFu
#    define CAN_PL1_HI_Data_byte_7_SHIFT 0u
#    define CAN_PL1_HI_Data_byte_7_WIDTH 8u
#    define CAN_PL1_HI_Data_byte_7(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_7_SHIFT)) & CAN_PL1_HI_Data_byte_7_MASK)
#    define CAN_PL1_HI_Data_byte_6_MASK 0xFF00u
#    define CAN_PL1_HI_Data_byte_6_SHIFT 8u
#    define CAN_PL1_HI_Data_byte_6_WIDTH 8u
#    define CAN_PL1_HI_Data_byte_6(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_6_SHIFT)) & CAN_PL1_HI_Data_byte_6_MASK)
#    define CAN_PL1_HI_Data_byte_5_MASK 0xFF0000u
#    define CAN_PL1_HI_Data_byte_5_SHIFT 16u
#    define CAN_PL1_HI_Data_byte_5_WIDTH 8u
#    define CAN_PL1_HI_Data_byte_5(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_5_SHIFT)) & CAN_PL1_HI_Data_byte_5_MASK)
#    define CAN_PL1_HI_Data_byte_4_MASK 0xFF000000u
#    define CAN_PL1_HI_Data_byte_4_SHIFT 24u
#    define CAN_PL1_HI_Data_byte_4_WIDTH 8u
#    define CAN_PL1_HI_Data_byte_4(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_4_SHIFT)) & CAN_PL1_HI_Data_byte_4_MASK)
/* FLT_ID2_IDMASK Bit Fields */
#    define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK 0x1FFFFFFFu
#    define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT 0u
#    define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_WIDTH 29u
#    define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK(x)                                    \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT)) & \
         CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK)
#    define CAN_FLT_ID2_IDMASK_RTR_MSK_MASK 0x20000000u
#    define CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT 29u
#    define CAN_FLT_ID2_IDMASK_RTR_MSK_WIDTH 1u
#    define CAN_FLT_ID2_IDMASK_RTR_MSK(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT)) & CAN_FLT_ID2_IDMASK_RTR_MSK_MASK)
#    define CAN_FLT_ID2_IDMASK_IDE_MSK_MASK 0x40000000u
#    define CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT 30u
#    define CAN_FLT_ID2_IDMASK_IDE_MSK_WIDTH 1u
#    define CAN_FLT_ID2_IDMASK_IDE_MSK(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT)) & CAN_FLT_ID2_IDMASK_IDE_MSK_MASK)
/* PL2_PLMASK_LO Bit Fields */
#    define CAN_PL2_PLMASK_LO_Data_byte_3_MASK 0xFFu
#    define CAN_PL2_PLMASK_LO_Data_byte_3_SHIFT 0u
#    define CAN_PL2_PLMASK_LO_Data_byte_3_WIDTH 8u
#    define CAN_PL2_PLMASK_LO_Data_byte_3(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_3_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_3_MASK)
#    define CAN_PL2_PLMASK_LO_Data_byte_2_MASK 0xFF00u
#    define CAN_PL2_PLMASK_LO_Data_byte_2_SHIFT 8u
#    define CAN_PL2_PLMASK_LO_Data_byte_2_WIDTH 8u
#    define CAN_PL2_PLMASK_LO_Data_byte_2(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_2_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_2_MASK)
#    define CAN_PL2_PLMASK_LO_Data_byte_1_MASK 0xFF0000u
#    define CAN_PL2_PLMASK_LO_Data_byte_1_SHIFT 16u
#    define CAN_PL2_PLMASK_LO_Data_byte_1_WIDTH 8u
#    define CAN_PL2_PLMASK_LO_Data_byte_1(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_1_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_1_MASK)
#    define CAN_PL2_PLMASK_LO_Data_byte_0_MASK 0xFF000000u
#    define CAN_PL2_PLMASK_LO_Data_byte_0_SHIFT 24u
#    define CAN_PL2_PLMASK_LO_Data_byte_0_WIDTH 8u
#    define CAN_PL2_PLMASK_LO_Data_byte_0(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_0_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_0_MASK)
/* PL2_PLMASK_HI Bit Fields */
#    define CAN_PL2_PLMASK_HI_Data_byte_7_MASK 0xFFu
#    define CAN_PL2_PLMASK_HI_Data_byte_7_SHIFT 0u
#    define CAN_PL2_PLMASK_HI_Data_byte_7_WIDTH 8u
#    define CAN_PL2_PLMASK_HI_Data_byte_7(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_7_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_7_MASK)
#    define CAN_PL2_PLMASK_HI_Data_byte_6_MASK 0xFF00u
#    define CAN_PL2_PLMASK_HI_Data_byte_6_SHIFT 8u
#    define CAN_PL2_PLMASK_HI_Data_byte_6_WIDTH 8u
#    define CAN_PL2_PLMASK_HI_Data_byte_6(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_6_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_6_MASK)
#    define CAN_PL2_PLMASK_HI_Data_byte_5_MASK 0xFF0000u
#    define CAN_PL2_PLMASK_HI_Data_byte_5_SHIFT 16u
#    define CAN_PL2_PLMASK_HI_Data_byte_5_WIDTH 8u
#    define CAN_PL2_PLMASK_HI_Data_byte_5(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_5_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_5_MASK)
#    define CAN_PL2_PLMASK_HI_Data_byte_4_MASK 0xFF000000u
#    define CAN_PL2_PLMASK_HI_Data_byte_4_SHIFT 24u
#    define CAN_PL2_PLMASK_HI_Data_byte_4_WIDTH 8u
#    define CAN_PL2_PLMASK_HI_Data_byte_4(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_4_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_4_MASK)
/* WMBn_CS Bit Fields */
#    define CAN_WMBn_CS_DLC_MASK 0xF0000u
#    define CAN_WMBn_CS_DLC_SHIFT 16u
#    define CAN_WMBn_CS_DLC_WIDTH 4u
#    define CAN_WMBn_CS_DLC(x) (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_DLC_SHIFT)) & CAN_WMBn_CS_DLC_MASK)
#    define CAN_WMBn_CS_RTR_MASK 0x100000u
#    define CAN_WMBn_CS_RTR_SHIFT 20u
#    define CAN_WMBn_CS_RTR_WIDTH 1u
#    define CAN_WMBn_CS_RTR(x) (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_RTR_SHIFT)) & CAN_WMBn_CS_RTR_MASK)
#    define CAN_WMBn_CS_IDE_MASK 0x200000u
#    define CAN_WMBn_CS_IDE_SHIFT 21u
#    define CAN_WMBn_CS_IDE_WIDTH 1u
#    define CAN_WMBn_CS_IDE(x) (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_IDE_SHIFT)) & CAN_WMBn_CS_IDE_MASK)
#    define CAN_WMBn_CS_SRR_MASK 0x400000u
#    define CAN_WMBn_CS_SRR_SHIFT 22u
#    define CAN_WMBn_CS_SRR_WIDTH 1u
#    define CAN_WMBn_CS_SRR(x) (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_SRR_SHIFT)) & CAN_WMBn_CS_SRR_MASK)
/* WMBn_ID Bit Fields */
#    define CAN_WMBn_ID_ID_MASK 0x1FFFFFFFu
#    define CAN_WMBn_ID_ID_SHIFT 0u
#    define CAN_WMBn_ID_ID_WIDTH 29u
#    define CAN_WMBn_ID_ID(x) (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_ID_ID_SHIFT)) & CAN_WMBn_ID_ID_MASK)
/* WMBn_D03 Bit Fields */
#    define CAN_WMBn_D03_Data_byte_3_MASK 0xFFu
#    define CAN_WMBn_D03_Data_byte_3_SHIFT 0u
#    define CAN_WMBn_D03_Data_byte_3_WIDTH 8u
#    define CAN_WMBn_D03_Data_byte_3(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_3_SHIFT)) & CAN_WMBn_D03_Data_byte_3_MASK)
#    define CAN_WMBn_D03_Data_byte_2_MASK 0xFF00u
#    define CAN_WMBn_D03_Data_byte_2_SHIFT 8u
#    define CAN_WMBn_D03_Data_byte_2_WIDTH 8u
#    define CAN_WMBn_D03_Data_byte_2(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_2_SHIFT)) & CAN_WMBn_D03_Data_byte_2_MASK)
#    define CAN_WMBn_D03_Data_byte_1_MASK 0xFF0000u
#    define CAN_WMBn_D03_Data_byte_1_SHIFT 16u
#    define CAN_WMBn_D03_Data_byte_1_WIDTH 8u
#    define CAN_WMBn_D03_Data_byte_1(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_1_SHIFT)) & CAN_WMBn_D03_Data_byte_1_MASK)
#    define CAN_WMBn_D03_Data_byte_0_MASK 0xFF000000u
#    define CAN_WMBn_D03_Data_byte_0_SHIFT 24u
#    define CAN_WMBn_D03_Data_byte_0_WIDTH 8u
#    define CAN_WMBn_D03_Data_byte_0(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_0_SHIFT)) & CAN_WMBn_D03_Data_byte_0_MASK)
/* WMBn_D47 Bit Fields */
#    define CAN_WMBn_D47_Data_byte_7_MASK 0xFFu
#    define CAN_WMBn_D47_Data_byte_7_SHIFT 0u
#    define CAN_WMBn_D47_Data_byte_7_WIDTH 8u
#    define CAN_WMBn_D47_Data_byte_7(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_7_SHIFT)) & CAN_WMBn_D47_Data_byte_7_MASK)
#    define CAN_WMBn_D47_Data_byte_6_MASK 0xFF00u
#    define CAN_WMBn_D47_Data_byte_6_SHIFT 8u
#    define CAN_WMBn_D47_Data_byte_6_WIDTH 8u
#    define CAN_WMBn_D47_Data_byte_6(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_6_SHIFT)) & CAN_WMBn_D47_Data_byte_6_MASK)
#    define CAN_WMBn_D47_Data_byte_5_MASK 0xFF0000u
#    define CAN_WMBn_D47_Data_byte_5_SHIFT 16u
#    define CAN_WMBn_D47_Data_byte_5_WIDTH 8u
#    define CAN_WMBn_D47_Data_byte_5(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_5_SHIFT)) & CAN_WMBn_D47_Data_byte_5_MASK)
#    define CAN_WMBn_D47_Data_byte_4_MASK 0xFF000000u
#    define CAN_WMBn_D47_Data_byte_4_SHIFT 24u
#    define CAN_WMBn_D47_Data_byte_4_WIDTH 8u
#    define CAN_WMBn_D47_Data_byte_4(x) \
        (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_4_SHIFT)) & CAN_WMBn_D47_Data_byte_4_MASK)
/* FDCTRL Bit Fields */
#    define CAN_FDCTRL_TDCVAL_MASK 0x3Fu
#    define CAN_FDCTRL_TDCVAL_SHIFT 0u
#    define CAN_FDCTRL_TDCVAL_WIDTH 6u
#    define CAN_FDCTRL_TDCVAL(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCVAL_SHIFT)) & CAN_FDCTRL_TDCVAL_MASK)
#    define CAN_FDCTRL_TDCOFF_MASK 0x1F00u
#    define CAN_FDCTRL_TDCOFF_SHIFT 8u
#    define CAN_FDCTRL_TDCOFF_WIDTH 5u
#    define CAN_FDCTRL_TDCOFF(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCOFF_SHIFT)) & CAN_FDCTRL_TDCOFF_MASK)
#    define CAN_FDCTRL_TDCFAIL_MASK 0x4000u
#    define CAN_FDCTRL_TDCFAIL_SHIFT 14u
#    define CAN_FDCTRL_TDCFAIL_WIDTH 1u
#    define CAN_FDCTRL_TDCFAIL(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCFAIL_SHIFT)) & CAN_FDCTRL_TDCFAIL_MASK)
#    define CAN_FDCTRL_TDCEN_MASK 0x8000u
#    define CAN_FDCTRL_TDCEN_SHIFT 15u
#    define CAN_FDCTRL_TDCEN_WIDTH 1u
#    define CAN_FDCTRL_TDCEN(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCEN_SHIFT)) & CAN_FDCTRL_TDCEN_MASK)
#    define CAN_FDCTRL_MBDSR0_MASK 0x30000u
#    define CAN_FDCTRL_MBDSR0_SHIFT 16u
#    define CAN_FDCTRL_MBDSR0_WIDTH 2u
#    define CAN_FDCTRL_MBDSR0(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_MBDSR0_SHIFT)) & CAN_FDCTRL_MBDSR0_MASK)
#    define CAN_FDCTRL_FDRATE_MASK 0x80000000u
#    define CAN_FDCTRL_FDRATE_SHIFT 31u
#    define CAN_FDCTRL_FDRATE_WIDTH 1u
#    define CAN_FDCTRL_FDRATE(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_FDRATE_SHIFT)) & CAN_FDCTRL_FDRATE_MASK)
/* FDCBT Bit Fields */
#    define CAN_FDCBT_FPSEG2_MASK 0x7u
#    define CAN_FDCBT_FPSEG2_SHIFT 0u
#    define CAN_FDCBT_FPSEG2_WIDTH 3u
#    define CAN_FDCBT_FPSEG2(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPSEG2_SHIFT)) & CAN_FDCBT_FPSEG2_MASK)
#    define CAN_FDCBT_FPSEG1_MASK 0xE0u
#    define CAN_FDCBT_FPSEG1_SHIFT 5u
#    define CAN_FDCBT_FPSEG1_WIDTH 3u
#    define CAN_FDCBT_FPSEG1(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPSEG1_SHIFT)) & CAN_FDCBT_FPSEG1_MASK)
#    define CAN_FDCBT_FPROPSEG_MASK 0x7C00u
#    define CAN_FDCBT_FPROPSEG_SHIFT 10u
#    define CAN_FDCBT_FPROPSEG_WIDTH 5u
#    define CAN_FDCBT_FPROPSEG(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPROPSEG_SHIFT)) & CAN_FDCBT_FPROPSEG_MASK)
#    define CAN_FDCBT_FRJW_MASK 0x70000u
#    define CAN_FDCBT_FRJW_SHIFT 16u
#    define CAN_FDCBT_FRJW_WIDTH 3u
#    define CAN_FDCBT_FRJW(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FRJW_SHIFT)) & CAN_FDCBT_FRJW_MASK)
#    define CAN_FDCBT_FPRESDIV_MASK 0x3FF00000u
#    define CAN_FDCBT_FPRESDIV_SHIFT 20u
#    define CAN_FDCBT_FPRESDIV_WIDTH 10u
#    define CAN_FDCBT_FPRESDIV(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPRESDIV_SHIFT)) & CAN_FDCBT_FPRESDIV_MASK)
/* FDCRC Bit Fields */
#    define CAN_FDCRC_FD_TXCRC_MASK 0x1FFFFFu
#    define CAN_FDCRC_FD_TXCRC_SHIFT 0u
#    define CAN_FDCRC_FD_TXCRC_WIDTH 21u
#    define CAN_FDCRC_FD_TXCRC(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCRC_FD_TXCRC_SHIFT)) & CAN_FDCRC_FD_TXCRC_MASK)
#    define CAN_FDCRC_FD_MBCRC_MASK 0x7F000000u
#    define CAN_FDCRC_FD_MBCRC_SHIFT 24u
#    define CAN_FDCRC_FD_MBCRC_WIDTH 7u
#    define CAN_FDCRC_FD_MBCRC(x) (((uint32_t)(((uint32_t)(x)) << CAN_FDCRC_FD_MBCRC_SHIFT)) & CAN_FDCRC_FD_MBCRC_MASK)

/*!
 * @}
 */ /* end of group CAN_Register_Masks */

/*!
 * @}
 */ /* end of group CAN_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- CMP Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Peripheral_Access_Layer CMP Peripheral Access Layer
 * @{
 */

