OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** CMP - Size of Registers Arrays */

/** CMP - Register Layout Typedef */
typedef struct
{
    __IO uint32_t C0; /**< CMP Control Register 0, offset: 0x0 */
    __IO uint32_t C1; /**< CMP Control Register 1, offset: 0x4 */
    __IO uint32_t C2; /**< CMP Control Register 2, offset: 0x8 */
} CMP_Type, *CMP_MemMapPtr;

/** Number of instances of the CMP module. */
#    define CMP_INSTANCE_COUNT (1u)

/* CMP - Peripheral instance base addresses */
/** Peripheral CMP0 base address */
#    define CMP0_BASE (0x40073000u)
/** Peripheral CMP0 base pointer */
#    define CMP0 ((CMP_Type*) CMP0_BASE)
/** Array initializer of CMP peripheral base addresses */
#    define CMP_BASE_ADDRS \
        {                  \
            CMP0_BASE      \
        }
/** Array initializer of CMP peripheral base pointers */
#    define CMP_BASE_PTRS \
        {                 \
            CMP0          \
        }
/** Number of interrupt vector arrays for the CMP module. */
#    define CMP_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the CMP module. */
#    define CMP_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the CMP peripheral type */
#    define CMP_IRQS  \
        {             \
            CMP0_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- CMP Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMP_Register_Masks CMP Register Masks
 * @{
 */

/* C0 Bit Fields */
#    define CMP_C0_HYSTCTR_MASK 0x3u
#    define CMP_C0_HYSTCTR_SHIFT 0u
#    define CMP_C0_HYSTCTR_WIDTH 2u
#    define CMP_C0_HYSTCTR(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_HYSTCTR_SHIFT)) & CMP_C0_HYSTCTR_MASK)
#    define CMP_C0_OFFSET_MASK 0x4u
#    define CMP_C0_OFFSET_SHIFT 2u
#    define CMP_C0_OFFSET_WIDTH 1u
#    define CMP_C0_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_OFFSET_SHIFT)) & CMP_C0_OFFSET_MASK)
#    define CMP_C0_FILTER_CNT_MASK 0x70u
#    define CMP_C0_FILTER_CNT_SHIFT 4u
#    define CMP_C0_FILTER_CNT_WIDTH 3u
#    define CMP_C0_FILTER_CNT(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_FILTER_CNT_SHIFT)) & CMP_C0_FILTER_CNT_MASK)
#    define CMP_C0_EN_MASK 0x100u
#    define CMP_C0_EN_SHIFT 8u
#    define CMP_C0_EN_WIDTH 1u
#    define CMP_C0_EN(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_EN_SHIFT)) & CMP_C0_EN_MASK)
#    define CMP_C0_OPE_MASK 0x200u
#    define CMP_C0_OPE_SHIFT 9u
#    define CMP_C0_OPE_WIDTH 1u
#    define CMP_C0_OPE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_OPE_SHIFT)) & CMP_C0_OPE_MASK)
#    define CMP_C0_COS_MASK 0x400u
#    define CMP_C0_COS_SHIFT 10u
#    define CMP_C0_COS_WIDTH 1u
#    define CMP_C0_COS(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_COS_SHIFT)) & CMP_C0_COS_MASK)
#    define CMP_C0_INVT_MASK 0x800u
#    define CMP_C0_INVT_SHIFT 11u
#    define CMP_C0_INVT_WIDTH 1u
#    define CMP_C0_INVT(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_INVT_SHIFT)) & CMP_C0_INVT_MASK)
#    define CMP_C0_PMODE_MASK 0x1000u
#    define CMP_C0_PMODE_SHIFT 12u
#    define CMP_C0_PMODE_WIDTH 1u
#    define CMP_C0_PMODE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_PMODE_SHIFT)) & CMP_C0_PMODE_MASK)
#    define CMP_C0_WE_MASK 0x4000u
#    define CMP_C0_WE_SHIFT 14u
#    define CMP_C0_WE_WIDTH 1u
#    define CMP_C0_WE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_WE_SHIFT)) & CMP_C0_WE_MASK)
#    define CMP_C0_SE_MASK 0x8000u
#    define CMP_C0_SE_SHIFT 15u
#    define CMP_C0_SE_WIDTH 1u
#    define CMP_C0_SE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_SE_SHIFT)) & CMP_C0_SE_MASK)
#    define CMP_C0_FPR_MASK 0xFF0000u
#    define CMP_C0_FPR_SHIFT 16u
#    define CMP_C0_FPR_WIDTH 8u
#    define CMP_C0_FPR(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_FPR_SHIFT)) & CMP_C0_FPR_MASK)
#    define CMP_C0_COUT_MASK 0x1000000u
#    define CMP_C0_COUT_SHIFT 24u
#    define CMP_C0_COUT_WIDTH 1u
#    define CMP_C0_COUT(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_COUT_SHIFT)) & CMP_C0_COUT_MASK)
#    define CMP_C0_CFF_MASK 0x2000000u
#    define CMP_C0_CFF_SHIFT 25u
#    define CMP_C0_CFF_WIDTH 1u
#    define CMP_C0_CFF(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_CFF_SHIFT)) & CMP_C0_CFF_MASK)
#    define CMP_C0_CFR_MASK 0x4000000u
#    define CMP_C0_CFR_SHIFT 26u
#    define CMP_C0_CFR_WIDTH 1u
#    define CMP_C0_CFR(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_CFR_SHIFT)) & CMP_C0_CFR_MASK)
#    define CMP_C0_IEF_MASK 0x8000000u
#    define CMP_C0_IEF_SHIFT 27u
#    define CMP_C0_IEF_WIDTH 1u
#    define CMP_C0_IEF(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_IEF_SHIFT)) & CMP_C0_IEF_MASK)
#    define CMP_C0_IER_MASK 0x10000000u
#    define CMP_C0_IER_SHIFT 28u
#    define CMP_C0_IER_WIDTH 1u
#    define CMP_C0_IER(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_IER_SHIFT)) & CMP_C0_IER_MASK)
#    define CMP_C0_DMAEN_MASK 0x40000000u
#    define CMP_C0_DMAEN_SHIFT 30u
#    define CMP_C0_DMAEN_WIDTH 1u
#    define CMP_C0_DMAEN(x) (((uint32_t)(((uint32_t)(x)) << CMP_C0_DMAEN_SHIFT)) & CMP_C0_DMAEN_MASK)
/* C1 Bit Fields */
#    define CMP_C1_VOSEL_MASK 0xFFu
#    define CMP_C1_VOSEL_SHIFT 0u
#    define CMP_C1_VOSEL_WIDTH 8u
#    define CMP_C1_VOSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_VOSEL_SHIFT)) & CMP_C1_VOSEL_MASK)
#    define CMP_C1_MSEL_MASK 0x700u
#    define CMP_C1_MSEL_SHIFT 8u
#    define CMP_C1_MSEL_WIDTH 3u
#    define CMP_C1_MSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_MSEL_SHIFT)) & CMP_C1_MSEL_MASK)
#    define CMP_C1_PSEL_MASK 0x3800u
#    define CMP_C1_PSEL_SHIFT 11u
#    define CMP_C1_PSEL_WIDTH 3u
#    define CMP_C1_PSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_PSEL_SHIFT)) & CMP_C1_PSEL_MASK)
#    define CMP_C1_VRSEL_MASK 0x4000u
#    define CMP_C1_VRSEL_SHIFT 14u
#    define CMP_C1_VRSEL_WIDTH 1u
#    define CMP_C1_VRSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_VRSEL_SHIFT)) & CMP_C1_VRSEL_MASK)
#    define CMP_C1_DACEN_MASK 0x8000u
#    define CMP_C1_DACEN_SHIFT 15u
#    define CMP_C1_DACEN_WIDTH 1u
#    define CMP_C1_DACEN(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_DACEN_SHIFT)) & CMP_C1_DACEN_MASK)
#    define CMP_C1_CHN0_MASK 0x10000u
#    define CMP_C1_CHN0_SHIFT 16u
#    define CMP_C1_CHN0_WIDTH 1u
#    define CMP_C1_CHN0(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN0_SHIFT)) & CMP_C1_CHN0_MASK)
#    define CMP_C1_CHN1_MASK 0x20000u
#    define CMP_C1_CHN1_SHIFT 17u
#    define CMP_C1_CHN1_WIDTH 1u
#    define CMP_C1_CHN1(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN1_SHIFT)) & CMP_C1_CHN1_MASK)
#    define CMP_C1_CHN2_MASK 0x40000u
#    define CMP_C1_CHN2_SHIFT 18u
#    define CMP_C1_CHN2_WIDTH 1u
#    define CMP_C1_CHN2(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN2_SHIFT)) & CMP_C1_CHN2_MASK)
#    define CMP_C1_CHN3_MASK 0x80000u
#    define CMP_C1_CHN3_SHIFT 19u
#    define CMP_C1_CHN3_WIDTH 1u
#    define CMP_C1_CHN3(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN3_SHIFT)) & CMP_C1_CHN3_MASK)
#    define CMP_C1_CHN4_MASK 0x100000u
#    define CMP_C1_CHN4_SHIFT 20u
#    define CMP_C1_CHN4_WIDTH 1u
#    define CMP_C1_CHN4(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN4_SHIFT)) & CMP_C1_CHN4_MASK)
#    define CMP_C1_CHN5_MASK 0x200000u
#    define CMP_C1_CHN5_SHIFT 21u
#    define CMP_C1_CHN5_WIDTH 1u
#    define CMP_C1_CHN5(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN5_SHIFT)) & CMP_C1_CHN5_MASK)
#    define CMP_C1_CHN6_MASK 0x400000u
#    define CMP_C1_CHN6_SHIFT 22u
#    define CMP_C1_CHN6_WIDTH 1u
#    define CMP_C1_CHN6(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN6_SHIFT)) & CMP_C1_CHN6_MASK)
#    define CMP_C1_CHN7_MASK 0x800000u
#    define CMP_C1_CHN7_SHIFT 23u
#    define CMP_C1_CHN7_WIDTH 1u
#    define CMP_C1_CHN7(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_CHN7_SHIFT)) & CMP_C1_CHN7_MASK)
#    define CMP_C1_INNSEL_MASK 0x3000000u
#    define CMP_C1_INNSEL_SHIFT 24u
#    define CMP_C1_INNSEL_WIDTH 2u
#    define CMP_C1_INNSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_INNSEL_SHIFT)) & CMP_C1_INNSEL_MASK)
#    define CMP_C1_INPSEL_MASK 0x18000000u
#    define CMP_C1_INPSEL_SHIFT 27u
#    define CMP_C1_INPSEL_WIDTH 2u
#    define CMP_C1_INPSEL(x) (((uint32_t)(((uint32_t)(x)) << CMP_C1_INPSEL_SHIFT)) & CMP_C1_INPSEL_MASK)
/* C2 Bit Fields */
#    define CMP_C2_ACOn_MASK 0xFFu
#    define CMP_C2_ACOn_SHIFT 0u
#    define CMP_C2_ACOn_WIDTH 8u
#    define CMP_C2_ACOn(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_ACOn_SHIFT)) & CMP_C2_ACOn_MASK)
#    define CMP_C2_INITMOD_MASK 0x3F00u
#    define CMP_C2_INITMOD_SHIFT 8u
#    define CMP_C2_INITMOD_WIDTH 6u
#    define CMP_C2_INITMOD(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_INITMOD_SHIFT)) & CMP_C2_INITMOD_MASK)
#    define CMP_C2_NSAM_MASK 0xC000u
#    define CMP_C2_NSAM_SHIFT 14u
#    define CMP_C2_NSAM_WIDTH 2u
#    define CMP_C2_NSAM(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_NSAM_SHIFT)) & CMP_C2_NSAM_MASK)
#    define CMP_C2_CH0F_MASK 0x10000u
#    define CMP_C2_CH0F_SHIFT 16u
#    define CMP_C2_CH0F_WIDTH 1u
#    define CMP_C2_CH0F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH0F_SHIFT)) & CMP_C2_CH0F_MASK)
#    define CMP_C2_CH1F_MASK 0x20000u
#    define CMP_C2_CH1F_SHIFT 17u
#    define CMP_C2_CH1F_WIDTH 1u
#    define CMP_C2_CH1F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH1F_SHIFT)) & CMP_C2_CH1F_MASK)
#    define CMP_C2_CH2F_MASK 0x40000u
#    define CMP_C2_CH2F_SHIFT 18u
#    define CMP_C2_CH2F_WIDTH 1u
#    define CMP_C2_CH2F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH2F_SHIFT)) & CMP_C2_CH2F_MASK)
#    define CMP_C2_CH3F_MASK 0x80000u
#    define CMP_C2_CH3F_SHIFT 19u
#    define CMP_C2_CH3F_WIDTH 1u
#    define CMP_C2_CH3F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH3F_SHIFT)) & CMP_C2_CH3F_MASK)
#    define CMP_C2_CH4F_MASK 0x100000u
#    define CMP_C2_CH4F_SHIFT 20u
#    define CMP_C2_CH4F_WIDTH 1u
#    define CMP_C2_CH4F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH4F_SHIFT)) & CMP_C2_CH4F_MASK)
#    define CMP_C2_CH5F_MASK 0x200000u
#    define CMP_C2_CH5F_SHIFT 21u
#    define CMP_C2_CH5F_WIDTH 1u
#    define CMP_C2_CH5F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH5F_SHIFT)) & CMP_C2_CH5F_MASK)
#    define CMP_C2_CH6F_MASK 0x400000u
#    define CMP_C2_CH6F_SHIFT 22u
#    define CMP_C2_CH6F_WIDTH 1u
#    define CMP_C2_CH6F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH6F_SHIFT)) & CMP_C2_CH6F_MASK)
#    define CMP_C2_CH7F_MASK 0x800000u
#    define CMP_C2_CH7F_SHIFT 23u
#    define CMP_C2_CH7F_WIDTH 1u
#    define CMP_C2_CH7F(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_CH7F_SHIFT)) & CMP_C2_CH7F_MASK)
#    define CMP_C2_FXMXCH_MASK 0xE000000u
#    define CMP_C2_FXMXCH_SHIFT 25u
#    define CMP_C2_FXMXCH_WIDTH 3u
#    define CMP_C2_FXMXCH(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_FXMXCH_SHIFT)) & CMP_C2_FXMXCH_MASK)
#    define CMP_C2_FXMP_MASK 0x20000000u
#    define CMP_C2_FXMP_SHIFT 29u
#    define CMP_C2_FXMP_WIDTH 1u
#    define CMP_C2_FXMP(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_FXMP_SHIFT)) & CMP_C2_FXMP_MASK)
#    define CMP_C2_RRIE_MASK 0x40000000u
#    define CMP_C2_RRIE_SHIFT 30u
#    define CMP_C2_RRIE_WIDTH 1u
#    define CMP_C2_RRIE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_RRIE_SHIFT)) & CMP_C2_RRIE_MASK)
#    define CMP_C2_RRE_MASK 0x80000000u
#    define CMP_C2_RRE_SHIFT 31u
#    define CMP_C2_RRE_WIDTH 1u
#    define CMP_C2_RRE(x) (((uint32_t)(((uint32_t)(x)) << CMP_C2_RRE_SHIFT)) & CMP_C2_RRE_MASK)

/*!
 * @}
 */ /* end of group CMP_Register_Masks */

/*!
 * @}
 */ /* end of group CMP_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- CRC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 * @{
 */

/** CRC - Size of Registers Arrays */

