OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** CSE_PRAM - Size of Registers Arrays */
#    define CSE_PRAM_RAMn_COUNT 32u

/** CSE_PRAM - Register Layout Typedef */
typedef struct
{
    union
    {                          /* offset: 0x0, array step: 0x4 */
        __IO uint32_t DATA_32; /**< CSE PRAM 0 Register..CSE PRAM 31 Register, array offset: 0x0, array step: 0x4 */
        struct
        { /* offset: 0x0, array step: 0x4 */
            __IO uint8_t
                 DATA_8LL; /**< CSE PRAM0LL register...CSE PRAM31LL register., array offset: 0x0, array step: 0x4 */
            __IO uint8_t
                 DATA_8LU; /**< CSE PRAM0LU register...CSE PRAM31LU register., array offset: 0x1, array step: 0x4 */
            __IO uint8_t
                 DATA_8HL; /**< CSE PRAM0HL register...CSE PRAM31HL register., array offset: 0x2, array step: 0x4 */
            __IO uint8_t
                 DATA_8HU; /**< CSE PRAM0HU register...CSE PRAM31HU register., array offset: 0x3, array step: 0x4 */
        } ACCESS8BIT;
    } RAMn[CSE_PRAM_RAMn_COUNT];
} CSE_PRAM_Type, *CSE_PRAM_MemMapPtr;

/** Number of instances of the CSE_PRAM module. */
#    define CSE_PRAM_INSTANCE_COUNT (1u)

/* CSE_PRAM - Peripheral instance base addresses */
/** Peripheral CSE_PRAM base address */
#    define CSE_PRAM_BASE (0x14001000u)
/** Peripheral CSE_PRAM base pointer */
#    define CSE_PRAM ((CSE_PRAM_Type*) CSE_PRAM_BASE)
/** Array initializer of CSE_PRAM peripheral base addresses */
#    define CSE_PRAM_BASE_ADDRS \
        {                       \
            CSE_PRAM_BASE       \
        }
/** Array initializer of CSE_PRAM peripheral base pointers */
#    define CSE_PRAM_BASE_PTRS \
        {                      \
            CSE_PRAM           \
        }

/* ----------------------------------------------------------------------------
   -- CSE_PRAM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSE_PRAM_Register_Masks CSE_PRAM Register Masks
 * @{
 */

/* RAMn_DATA_32 Bit Fields */
#    define CSE_PRAM_RAMn_DATA_32_BYTE_3_MASK 0xFFu
#    define CSE_PRAM_RAMn_DATA_32_BYTE_3_SHIFT 0u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_3_WIDTH 8u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_3(x) \
        (((uint32_t)(((uint32_t)(x)) << CSE_PRAM_RAMn_DATA_32_BYTE_3_SHIFT)) & CSE_PRAM_RAMn_DATA_32_BYTE_3_MASK)
#    define CSE_PRAM_RAMn_DATA_32_BYTE_2_MASK 0xFF00u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_2_SHIFT 8u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_2_WIDTH 8u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_2(x) \
        (((uint32_t)(((uint32_t)(x)) << CSE_PRAM_RAMn_DATA_32_BYTE_2_SHIFT)) & CSE_PRAM_RAMn_DATA_32_BYTE_2_MASK)
#    define CSE_PRAM_RAMn_DATA_32_BYTE_1_MASK 0xFF0000u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_1_SHIFT 16u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_1_WIDTH 8u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_1(x) \
        (((uint32_t)(((uint32_t)(x)) << CSE_PRAM_RAMn_DATA_32_BYTE_1_SHIFT)) & CSE_PRAM_RAMn_DATA_32_BYTE_1_MASK)
#    define CSE_PRAM_RAMn_DATA_32_BYTE_0_MASK 0xFF000000u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_0_SHIFT 24u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_0_WIDTH 8u
#    define CSE_PRAM_RAMn_DATA_32_BYTE_0(x) \
        (((uint32_t)(((uint32_t)(x)) << CSE_PRAM_RAMn_DATA_32_BYTE_0_SHIFT)) & CSE_PRAM_RAMn_DATA_32_BYTE_0_MASK)
/* RAMn_ACCESS8BIT_DATA_8LL Bit Fields */
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL_MASK 0xFFu
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL_SHIFT 0u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL_WIDTH 8u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL(x)                                  \
        (((uint8_t)(((uint8_t)(x)) << CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL_SHIFT)) & \
         CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LL_RAM_LL_MASK)
/* RAMn_ACCESS8BIT_DATA_8LU Bit Fields */
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU_MASK 0xFFu
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU_SHIFT 0u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU_WIDTH 8u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU(x)                                  \
        (((uint8_t)(((uint8_t)(x)) << CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU_SHIFT)) & \
         CSE_PRAM_RAMn_ACCESS8BIT_DATA_8LU_RAM_LU_MASK)
/* RAMn_ACCESS8BIT_DATA_8HL Bit Fields */
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL_MASK 0xFFu
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL_SHIFT 0u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL_WIDTH 8u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL(x)                                  \
        (((uint8_t)(((uint8_t)(x)) << CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL_SHIFT)) & \
         CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HL_RAM_HL_MASK)
/* RAMn_ACCESS8BIT_DATA_8HU Bit Fields */
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU_MASK 0xFFu
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU_SHIFT 0u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU_WIDTH 8u
#    define CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU(x)                                  \
        (((uint8_t)(((uint8_t)(x)) << CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU_SHIFT)) & \
         CSE_PRAM_RAMn_ACCESS8BIT_DATA_8HU_RAM_HU_MASK)

/*!
 * @}
 */ /* end of group CSE_PRAM_Register_Masks */

/*!
 * @}
 */ /* end of group CSE_PRAM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */

/** DMA - Size of Registers Arrays */
#    define DMA_DCHPRI_COUNT 16u
#    define DMA_TCD_COUNT 16u

/** DMA - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CR; /**< Control Register, offset: 0x0 */
    __I uint32_t ES;  /**< Error Status Register, offset: 0x4 */
    uint8_t      RESERVED_0[4];
    __IO uint32_t ERQ; /**< Enable Request Register, offset: 0xC */
    uint8_t       RESERVED_1[4];
    __IO uint32_t EEI; /**< Enable Error Interrupt Register, offset: 0x14 */
    __O uint8_t CEEI;  /**< Clear Enable Error Interrupt Register, offset: 0x18 */
    __O uint8_t SEEI;  /**< Set Enable Error Interrupt Register, offset: 0x19 */
    __O uint8_t CERQ;  /**< Clear Enable Request Register, offset: 0x1A */
    __O uint8_t SERQ;  /**< Set Enable Request Register, offset: 0x1B */
    __O uint8_t CDNE;  /**< Clear DONE Status Bit Register, offset: 0x1C */
    __O uint8_t SSRT;  /**< Set START Bit Register, offset: 0x1D */
    __O uint8_t CERR;  /**< Clear Error Register, offset: 0x1E */
    __O uint8_t CINT;  /**< Clear Interrupt Request Register, offset: 0x1F */
    uint8_t     RESERVED_2[4];
    __IO uint32_t INT; /**< Interrupt Request Register, offset: 0x24 */
    uint8_t       RESERVED_3[4];
    __IO uint32_t ERR; /**< Error Register, offset: 0x2C */
    uint8_t       RESERVED_4[4];
    __I uint32_t HRS; /**< Hardware Request Status Register, offset: 0x34 */
    uint8_t      RESERVED_5[12];
    __IO uint32_t EARS; /**< Enable Asynchronous Request in Stop Register, offset: 0x44 */
    uint8_t       RESERVED_6[184];
    __IO uint8_t DCHPRI[DMA_DCHPRI_COUNT]; /**< Channel n Priority Register, array offset: 0x100, array step: 0x1 */
    uint8_t      RESERVED_7[3824];
    struct
    {                        /* offset: 0x1000, array step: 0x20 */
        __IO uint32_t SADDR; /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
        __IO uint16_t SOFF;  /**< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
        __IO uint16_t ATTR;  /**< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
        union
        { /* offset: 0x1008, array step: 0x20 */
            __IO uint32_t
                 MLNO; /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array offset: 0x1008, array step: 0x20 */
            __IO uint32_t MLOFFNO;  /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled),
                                       array offset: 0x1008, array step: 0x20 */
            __IO uint32_t MLOFFYES; /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled), array
                                       offset: 0x1008, array step: 0x20 */
        } NBYTES;
        __IO uint32_t SLAST; /**< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
        __IO uint32_t DADDR; /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
        __IO uint16_t DOFF;  /**< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20 */
        union
        {                           /* offset: 0x1016, array step: 0x20 */
            __IO uint16_t ELINKNO;  /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array
                                       offset: 0x1016, array step: 0x20 */
            __IO uint16_t ELINKYES; /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array
                                       offset: 0x1016, array step: 0x20 */
        } CITER;
        __IO uint32_t DLASTSGA; /**< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset:
                                   0x1018, array step: 0x20 */
        __IO uint16_t CSR;      /**< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
        union
        {                           /* offset: 0x101E, array step: 0x20 */
            __IO uint16_t ELINKNO;  /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled),
                                       array offset: 0x101E, array step: 0x20 */
            __IO uint16_t ELINKYES; /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled),
                                       array offset: 0x101E, array step: 0x20 */
        } BITER;
    } TCD[DMA_TCD_COUNT];
} DMA_Type, *DMA_MemMapPtr;

/** Number of instances of the DMA module. */
#    define DMA_INSTANCE_COUNT (1u)

/* DMA - Peripheral instance base addresses */
/** Peripheral DMA base address */
#    define DMA_BASE (0x40008000u)
/** Peripheral DMA base pointer */
#    define DMA ((DMA_Type*) DMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#    define DMA_BASE_ADDRS \
        {                  \
            DMA_BASE       \
        }
/** Array initializer of DMA peripheral base pointers */
#    define DMA_BASE_PTRS \
        {                 \
            DMA           \
        }
/** Number of interrupt vector arrays for the DMA module. */
#    define DMA_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the CHN type of DMA module. */
#    define DMA_CHN_IRQS_CH_COUNT (16u)
/** Number of interrupt channels for the ERROR type of DMA module. */
#    define DMA_ERROR_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the DMA peripheral type */
#    define DMA_CHN_IRQS                                                                                       \
        {                                                                                                      \
            DMA0_IRQn, DMA1_IRQn, DMA2_IRQn, DMA3_IRQn, DMA4_IRQn, DMA5_IRQn, DMA6_IRQn, DMA7_IRQn, DMA8_IRQn, \
                DMA9_IRQn, DMA10_IRQn, DMA11_IRQn, DMA12_IRQn, DMA13_IRQn, DMA14_IRQn, DMA15_IRQn              \
        }
#    define DMA_ERROR_IRQS \
        {                  \
            DMA_Error_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

