OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* CR Bit Fields */
#    define DMA_CR_EDBG_MASK 0x2u
#    define DMA_CR_EDBG_SHIFT 1u
#    define DMA_CR_EDBG_WIDTH 1u
#    define DMA_CR_EDBG(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_EDBG_SHIFT)) & DMA_CR_EDBG_MASK)
#    define DMA_CR_ERCA_MASK 0x4u
#    define DMA_CR_ERCA_SHIFT 2u
#    define DMA_CR_ERCA_WIDTH 1u
#    define DMA_CR_ERCA(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_ERCA_SHIFT)) & DMA_CR_ERCA_MASK)
#    define DMA_CR_HOE_MASK 0x10u
#    define DMA_CR_HOE_SHIFT 4u
#    define DMA_CR_HOE_WIDTH 1u
#    define DMA_CR_HOE(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_HOE_SHIFT)) & DMA_CR_HOE_MASK)
#    define DMA_CR_HALT_MASK 0x20u
#    define DMA_CR_HALT_SHIFT 5u
#    define DMA_CR_HALT_WIDTH 1u
#    define DMA_CR_HALT(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_HALT_SHIFT)) & DMA_CR_HALT_MASK)
#    define DMA_CR_CLM_MASK 0x40u
#    define DMA_CR_CLM_SHIFT 6u
#    define DMA_CR_CLM_WIDTH 1u
#    define DMA_CR_CLM(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_CLM_SHIFT)) & DMA_CR_CLM_MASK)
#    define DMA_CR_EMLM_MASK 0x80u
#    define DMA_CR_EMLM_SHIFT 7u
#    define DMA_CR_EMLM_WIDTH 1u
#    define DMA_CR_EMLM(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_EMLM_SHIFT)) & DMA_CR_EMLM_MASK)
#    define DMA_CR_ECX_MASK 0x10000u
#    define DMA_CR_ECX_SHIFT 16u
#    define DMA_CR_ECX_WIDTH 1u
#    define DMA_CR_ECX(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_ECX_SHIFT)) & DMA_CR_ECX_MASK)
#    define DMA_CR_CX_MASK 0x20000u
#    define DMA_CR_CX_SHIFT 17u
#    define DMA_CR_CX_WIDTH 1u
#    define DMA_CR_CX(x) (((uint32_t)(((uint32_t)(x)) << DMA_CR_CX_SHIFT)) & DMA_CR_CX_MASK)
/* ES Bit Fields */
#    define DMA_ES_DBE_MASK 0x1u
#    define DMA_ES_DBE_SHIFT 0u
#    define DMA_ES_DBE_WIDTH 1u
#    define DMA_ES_DBE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_DBE_SHIFT)) & DMA_ES_DBE_MASK)
#    define DMA_ES_SBE_MASK 0x2u
#    define DMA_ES_SBE_SHIFT 1u
#    define DMA_ES_SBE_WIDTH 1u
#    define DMA_ES_SBE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_SBE_SHIFT)) & DMA_ES_SBE_MASK)
#    define DMA_ES_SGE_MASK 0x4u
#    define DMA_ES_SGE_SHIFT 2u
#    define DMA_ES_SGE_WIDTH 1u
#    define DMA_ES_SGE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_SGE_SHIFT)) & DMA_ES_SGE_MASK)
#    define DMA_ES_NCE_MASK 0x8u
#    define DMA_ES_NCE_SHIFT 3u
#    define DMA_ES_NCE_WIDTH 1u
#    define DMA_ES_NCE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_NCE_SHIFT)) & DMA_ES_NCE_MASK)
#    define DMA_ES_DOE_MASK 0x10u
#    define DMA_ES_DOE_SHIFT 4u
#    define DMA_ES_DOE_WIDTH 1u
#    define DMA_ES_DOE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_DOE_SHIFT)) & DMA_ES_DOE_MASK)
#    define DMA_ES_DAE_MASK 0x20u
#    define DMA_ES_DAE_SHIFT 5u
#    define DMA_ES_DAE_WIDTH 1u
#    define DMA_ES_DAE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_DAE_SHIFT)) & DMA_ES_DAE_MASK)
#    define DMA_ES_SOE_MASK 0x40u
#    define DMA_ES_SOE_SHIFT 6u
#    define DMA_ES_SOE_WIDTH 1u
#    define DMA_ES_SOE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_SOE_SHIFT)) & DMA_ES_SOE_MASK)
#    define DMA_ES_SAE_MASK 0x80u
#    define DMA_ES_SAE_SHIFT 7u
#    define DMA_ES_SAE_WIDTH 1u
#    define DMA_ES_SAE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_SAE_SHIFT)) & DMA_ES_SAE_MASK)
#    define DMA_ES_ERRCHN_MASK 0xF00u
#    define DMA_ES_ERRCHN_SHIFT 8u
#    define DMA_ES_ERRCHN_WIDTH 4u
#    define DMA_ES_ERRCHN(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_ERRCHN_SHIFT)) & DMA_ES_ERRCHN_MASK)
#    define DMA_ES_CPE_MASK 0x4000u
#    define DMA_ES_CPE_SHIFT 14u
#    define DMA_ES_CPE_WIDTH 1u
#    define DMA_ES_CPE(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_CPE_SHIFT)) & DMA_ES_CPE_MASK)
#    define DMA_ES_ECX_MASK 0x10000u
#    define DMA_ES_ECX_SHIFT 16u
#    define DMA_ES_ECX_WIDTH 1u
#    define DMA_ES_ECX(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_ECX_SHIFT)) & DMA_ES_ECX_MASK)
#    define DMA_ES_VLD_MASK 0x80000000u
#    define DMA_ES_VLD_SHIFT 31u
#    define DMA_ES_VLD_WIDTH 1u
#    define DMA_ES_VLD(x) (((uint32_t)(((uint32_t)(x)) << DMA_ES_VLD_SHIFT)) & DMA_ES_VLD_MASK)
/* ERQ Bit Fields */
#    define DMA_ERQ_ERQ0_MASK 0x1u
#    define DMA_ERQ_ERQ0_SHIFT 0u
#    define DMA_ERQ_ERQ0_WIDTH 1u
#    define DMA_ERQ_ERQ0(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ0_SHIFT)) & DMA_ERQ_ERQ0_MASK)
#    define DMA_ERQ_ERQ1_MASK 0x2u
#    define DMA_ERQ_ERQ1_SHIFT 1u
#    define DMA_ERQ_ERQ1_WIDTH 1u
#    define DMA_ERQ_ERQ1(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ1_SHIFT)) & DMA_ERQ_ERQ1_MASK)
#    define DMA_ERQ_ERQ2_MASK 0x4u
#    define DMA_ERQ_ERQ2_SHIFT 2u
#    define DMA_ERQ_ERQ2_WIDTH 1u
#    define DMA_ERQ_ERQ2(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ2_SHIFT)) & DMA_ERQ_ERQ2_MASK)
#    define DMA_ERQ_ERQ3_MASK 0x8u
#    define DMA_ERQ_ERQ3_SHIFT 3u
#    define DMA_ERQ_ERQ3_WIDTH 1u
#    define DMA_ERQ_ERQ3(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ3_SHIFT)) & DMA_ERQ_ERQ3_MASK)
#    define DMA_ERQ_ERQ4_MASK 0x10u
#    define DMA_ERQ_ERQ4_SHIFT 4u
#    define DMA_ERQ_ERQ4_WIDTH 1u
#    define DMA_ERQ_ERQ4(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ4_SHIFT)) & DMA_ERQ_ERQ4_MASK)
#    define DMA_ERQ_ERQ5_MASK 0x20u
#    define DMA_ERQ_ERQ5_SHIFT 5u
#    define DMA_ERQ_ERQ5_WIDTH 1u
#    define DMA_ERQ_ERQ5(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ5_SHIFT)) & DMA_ERQ_ERQ5_MASK)
#    define DMA_ERQ_ERQ6_MASK 0x40u
#    define DMA_ERQ_ERQ6_SHIFT 6u
#    define DMA_ERQ_ERQ6_WIDTH 1u
#    define DMA_ERQ_ERQ6(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ6_SHIFT)) & DMA_ERQ_ERQ6_MASK)
#    define DMA_ERQ_ERQ7_MASK 0x80u
#    define DMA_ERQ_ERQ7_SHIFT 7u
#    define DMA_ERQ_ERQ7_WIDTH 1u
#    define DMA_ERQ_ERQ7(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ7_SHIFT)) & DMA_ERQ_ERQ7_MASK)
#    define DMA_ERQ_ERQ8_MASK 0x100u
#    define DMA_ERQ_ERQ8_SHIFT 8u
#    define DMA_ERQ_ERQ8_WIDTH 1u
#    define DMA_ERQ_ERQ8(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ8_SHIFT)) & DMA_ERQ_ERQ8_MASK)
#    define DMA_ERQ_ERQ9_MASK 0x200u
#    define DMA_ERQ_ERQ9_SHIFT 9u
#    define DMA_ERQ_ERQ9_WIDTH 1u
#    define DMA_ERQ_ERQ9(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ9_SHIFT)) & DMA_ERQ_ERQ9_MASK)
#    define DMA_ERQ_ERQ10_MASK 0x400u
#    define DMA_ERQ_ERQ10_SHIFT 10u
#    define DMA_ERQ_ERQ10_WIDTH 1u
#    define DMA_ERQ_ERQ10(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ10_SHIFT)) & DMA_ERQ_ERQ10_MASK)
#    define DMA_ERQ_ERQ11_MASK 0x800u
#    define DMA_ERQ_ERQ11_SHIFT 11u
#    define DMA_ERQ_ERQ11_WIDTH 1u
#    define DMA_ERQ_ERQ11(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ11_SHIFT)) & DMA_ERQ_ERQ11_MASK)
#    define DMA_ERQ_ERQ12_MASK 0x1000u
#    define DMA_ERQ_ERQ12_SHIFT 12u
#    define DMA_ERQ_ERQ12_WIDTH 1u
#    define DMA_ERQ_ERQ12(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ12_SHIFT)) & DMA_ERQ_ERQ12_MASK)
#    define DMA_ERQ_ERQ13_MASK 0x2000u
#    define DMA_ERQ_ERQ13_SHIFT 13u
#    define DMA_ERQ_ERQ13_WIDTH 1u
#    define DMA_ERQ_ERQ13(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ13_SHIFT)) & DMA_ERQ_ERQ13_MASK)
#    define DMA_ERQ_ERQ14_MASK 0x4000u
#    define DMA_ERQ_ERQ14_SHIFT 14u
#    define DMA_ERQ_ERQ14_WIDTH 1u
#    define DMA_ERQ_ERQ14(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ14_SHIFT)) & DMA_ERQ_ERQ14_MASK)
#    define DMA_ERQ_ERQ15_MASK 0x8000u
#    define DMA_ERQ_ERQ15_SHIFT 15u
#    define DMA_ERQ_ERQ15_WIDTH 1u
#    define DMA_ERQ_ERQ15(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERQ_ERQ15_SHIFT)) & DMA_ERQ_ERQ15_MASK)
/* EEI Bit Fields */
#    define DMA_EEI_EEI0_MASK 0x1u
#    define DMA_EEI_EEI0_SHIFT 0u
#    define DMA_EEI_EEI0_WIDTH 1u
#    define DMA_EEI_EEI0(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI0_SHIFT)) & DMA_EEI_EEI0_MASK)
#    define DMA_EEI_EEI1_MASK 0x2u
#    define DMA_EEI_EEI1_SHIFT 1u
#    define DMA_EEI_EEI1_WIDTH 1u
#    define DMA_EEI_EEI1(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI1_SHIFT)) & DMA_EEI_EEI1_MASK)
#    define DMA_EEI_EEI2_MASK 0x4u
#    define DMA_EEI_EEI2_SHIFT 2u
#    define DMA_EEI_EEI2_WIDTH 1u
#    define DMA_EEI_EEI2(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI2_SHIFT)) & DMA_EEI_EEI2_MASK)
#    define DMA_EEI_EEI3_MASK 0x8u
#    define DMA_EEI_EEI3_SHIFT 3u
#    define DMA_EEI_EEI3_WIDTH 1u
#    define DMA_EEI_EEI3(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI3_SHIFT)) & DMA_EEI_EEI3_MASK)
#    define DMA_EEI_EEI4_MASK 0x10u
#    define DMA_EEI_EEI4_SHIFT 4u
#    define DMA_EEI_EEI4_WIDTH 1u
#    define DMA_EEI_EEI4(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI4_SHIFT)) & DMA_EEI_EEI4_MASK)
#    define DMA_EEI_EEI5_MASK 0x20u
#    define DMA_EEI_EEI5_SHIFT 5u
#    define DMA_EEI_EEI5_WIDTH 1u
#    define DMA_EEI_EEI5(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI5_SHIFT)) & DMA_EEI_EEI5_MASK)
#    define DMA_EEI_EEI6_MASK 0x40u
#    define DMA_EEI_EEI6_SHIFT 6u
#    define DMA_EEI_EEI6_WIDTH 1u
#    define DMA_EEI_EEI6(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI6_SHIFT)) & DMA_EEI_EEI6_MASK)
#    define DMA_EEI_EEI7_MASK 0x80u
#    define DMA_EEI_EEI7_SHIFT 7u
#    define DMA_EEI_EEI7_WIDTH 1u
#    define DMA_EEI_EEI7(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI7_SHIFT)) & DMA_EEI_EEI7_MASK)
#    define DMA_EEI_EEI8_MASK 0x100u
#    define DMA_EEI_EEI8_SHIFT 8u
#    define DMA_EEI_EEI8_WIDTH 1u
#    define DMA_EEI_EEI8(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI8_SHIFT)) & DMA_EEI_EEI8_MASK)
#    define DMA_EEI_EEI9_MASK 0x200u
#    define DMA_EEI_EEI9_SHIFT 9u
#    define DMA_EEI_EEI9_WIDTH 1u
#    define DMA_EEI_EEI9(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI9_SHIFT)) & DMA_EEI_EEI9_MASK)
#    define DMA_EEI_EEI10_MASK 0x400u
#    define DMA_EEI_EEI10_SHIFT 10u
#    define DMA_EEI_EEI10_WIDTH 1u
#    define DMA_EEI_EEI10(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI10_SHIFT)) & DMA_EEI_EEI10_MASK)
#    define DMA_EEI_EEI11_MASK 0x800u
#    define DMA_EEI_EEI11_SHIFT 11u
#    define DMA_EEI_EEI11_WIDTH 1u
#    define DMA_EEI_EEI11(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI11_SHIFT)) & DMA_EEI_EEI11_MASK)
#    define DMA_EEI_EEI12_MASK 0x1000u
#    define DMA_EEI_EEI12_SHIFT 12u
#    define DMA_EEI_EEI12_WIDTH 1u
#    define DMA_EEI_EEI12(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI12_SHIFT)) & DMA_EEI_EEI12_MASK)
#    define DMA_EEI_EEI13_MASK 0x2000u
#    define DMA_EEI_EEI13_SHIFT 13u
#    define DMA_EEI_EEI13_WIDTH 1u
#    define DMA_EEI_EEI13(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI13_SHIFT)) & DMA_EEI_EEI13_MASK)
#    define DMA_EEI_EEI14_MASK 0x4000u
#    define DMA_EEI_EEI14_SHIFT 14u
#    define DMA_EEI_EEI14_WIDTH 1u
#    define DMA_EEI_EEI14(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI14_SHIFT)) & DMA_EEI_EEI14_MASK)
#    define DMA_EEI_EEI15_MASK 0x8000u
#    define DMA_EEI_EEI15_SHIFT 15u
#    define DMA_EEI_EEI15_WIDTH 1u
#    define DMA_EEI_EEI15(x) (((uint32_t)(((uint32_t)(x)) << DMA_EEI_EEI15_SHIFT)) & DMA_EEI_EEI15_MASK)
/* CEEI Bit Fields */
#    define DMA_CEEI_CEEI_MASK 0xFu
#    define DMA_CEEI_CEEI_SHIFT 0u
#    define DMA_CEEI_CEEI_WIDTH 4u
#    define DMA_CEEI_CEEI(x) (((uint8_t)(((uint8_t)(x)) << DMA_CEEI_CEEI_SHIFT)) & DMA_CEEI_CEEI_MASK)
#    define DMA_CEEI_CAEE_MASK 0x40u
#    define DMA_CEEI_CAEE_SHIFT 6u
#    define DMA_CEEI_CAEE_WIDTH 1u
#    define DMA_CEEI_CAEE(x) (((uint8_t)(((uint8_t)(x)) << DMA_CEEI_CAEE_SHIFT)) & DMA_CEEI_CAEE_MASK)
#    define DMA_CEEI_NOP_MASK 0x80u
#    define DMA_CEEI_NOP_SHIFT 7u
#    define DMA_CEEI_NOP_WIDTH 1u
#    define DMA_CEEI_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_CEEI_NOP_SHIFT)) & DMA_CEEI_NOP_MASK)
/* SEEI Bit Fields */
#    define DMA_SEEI_SEEI_MASK 0xFu
#    define DMA_SEEI_SEEI_SHIFT 0u
#    define DMA_SEEI_SEEI_WIDTH 4u
#    define DMA_SEEI_SEEI(x) (((uint8_t)(((uint8_t)(x)) << DMA_SEEI_SEEI_SHIFT)) & DMA_SEEI_SEEI_MASK)
#    define DMA_SEEI_SAEE_MASK 0x40u
#    define DMA_SEEI_SAEE_SHIFT 6u
#    define DMA_SEEI_SAEE_WIDTH 1u
#    define DMA_SEEI_SAEE(x) (((uint8_t)(((uint8_t)(x)) << DMA_SEEI_SAEE_SHIFT)) & DMA_SEEI_SAEE_MASK)
#    define DMA_SEEI_NOP_MASK 0x80u
#    define DMA_SEEI_NOP_SHIFT 7u
#    define DMA_SEEI_NOP_WIDTH 1u
#    define DMA_SEEI_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_SEEI_NOP_SHIFT)) & DMA_SEEI_NOP_MASK)
/* CERQ Bit Fields */
#    define DMA_CERQ_CERQ_MASK 0xFu
#    define DMA_CERQ_CERQ_SHIFT 0u
#    define DMA_CERQ_CERQ_WIDTH 4u
#    define DMA_CERQ_CERQ(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERQ_CERQ_SHIFT)) & DMA_CERQ_CERQ_MASK)
#    define DMA_CERQ_CAER_MASK 0x40u
#    define DMA_CERQ_CAER_SHIFT 6u
#    define DMA_CERQ_CAER_WIDTH 1u
#    define DMA_CERQ_CAER(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERQ_CAER_SHIFT)) & DMA_CERQ_CAER_MASK)
#    define DMA_CERQ_NOP_MASK 0x80u
#    define DMA_CERQ_NOP_SHIFT 7u
#    define DMA_CERQ_NOP_WIDTH 1u
#    define DMA_CERQ_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERQ_NOP_SHIFT)) & DMA_CERQ_NOP_MASK)
/* SERQ Bit Fields */
#    define DMA_SERQ_SERQ_MASK 0xFu
#    define DMA_SERQ_SERQ_SHIFT 0u
#    define DMA_SERQ_SERQ_WIDTH 4u
#    define DMA_SERQ_SERQ(x) (((uint8_t)(((uint8_t)(x)) << DMA_SERQ_SERQ_SHIFT)) & DMA_SERQ_SERQ_MASK)
#    define DMA_SERQ_SAER_MASK 0x40u
#    define DMA_SERQ_SAER_SHIFT 6u
#    define DMA_SERQ_SAER_WIDTH 1u
#    define DMA_SERQ_SAER(x) (((uint8_t)(((uint8_t)(x)) << DMA_SERQ_SAER_SHIFT)) & DMA_SERQ_SAER_MASK)
#    define DMA_SERQ_NOP_MASK 0x80u
#    define DMA_SERQ_NOP_SHIFT 7u
#    define DMA_SERQ_NOP_WIDTH 1u
#    define DMA_SERQ_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_SERQ_NOP_SHIFT)) & DMA_SERQ_NOP_MASK)
/* CDNE Bit Fields */
#    define DMA_CDNE_CDNE_MASK 0xFu
#    define DMA_CDNE_CDNE_SHIFT 0u
#    define DMA_CDNE_CDNE_WIDTH 4u
#    define DMA_CDNE_CDNE(x) (((uint8_t)(((uint8_t)(x)) << DMA_CDNE_CDNE_SHIFT)) & DMA_CDNE_CDNE_MASK)
#    define DMA_CDNE_CADN_MASK 0x40u
#    define DMA_CDNE_CADN_SHIFT 6u
#    define DMA_CDNE_CADN_WIDTH 1u
#    define DMA_CDNE_CADN(x) (((uint8_t)(((uint8_t)(x)) << DMA_CDNE_CADN_SHIFT)) & DMA_CDNE_CADN_MASK)
#    define DMA_CDNE_NOP_MASK 0x80u
#    define DMA_CDNE_NOP_SHIFT 7u
#    define DMA_CDNE_NOP_WIDTH 1u
#    define DMA_CDNE_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_CDNE_NOP_SHIFT)) & DMA_CDNE_NOP_MASK)
/* SSRT Bit Fields */
#    define DMA_SSRT_SSRT_MASK 0xFu
#    define DMA_SSRT_SSRT_SHIFT 0u
#    define DMA_SSRT_SSRT_WIDTH 4u
#    define DMA_SSRT_SSRT(x) (((uint8_t)(((uint8_t)(x)) << DMA_SSRT_SSRT_SHIFT)) & DMA_SSRT_SSRT_MASK)
#    define DMA_SSRT_SAST_MASK 0x40u
#    define DMA_SSRT_SAST_SHIFT 6u
#    define DMA_SSRT_SAST_WIDTH 1u
#    define DMA_SSRT_SAST(x) (((uint8_t)(((uint8_t)(x)) << DMA_SSRT_SAST_SHIFT)) & DMA_SSRT_SAST_MASK)
#    define DMA_SSRT_NOP_MASK 0x80u
#    define DMA_SSRT_NOP_SHIFT 7u
#    define DMA_SSRT_NOP_WIDTH 1u
#    define DMA_SSRT_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_SSRT_NOP_SHIFT)) & DMA_SSRT_NOP_MASK)
/* CERR Bit Fields */
#    define DMA_CERR_CERR_MASK 0xFu
#    define DMA_CERR_CERR_SHIFT 0u
#    define DMA_CERR_CERR_WIDTH 4u
#    define DMA_CERR_CERR(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERR_CERR_SHIFT)) & DMA_CERR_CERR_MASK)
#    define DMA_CERR_CAEI_MASK 0x40u
#    define DMA_CERR_CAEI_SHIFT 6u
#    define DMA_CERR_CAEI_WIDTH 1u
#    define DMA_CERR_CAEI(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERR_CAEI_SHIFT)) & DMA_CERR_CAEI_MASK)
#    define DMA_CERR_NOP_MASK 0x80u
#    define DMA_CERR_NOP_SHIFT 7u
#    define DMA_CERR_NOP_WIDTH 1u
#    define DMA_CERR_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_CERR_NOP_SHIFT)) & DMA_CERR_NOP_MASK)
/* CINT Bit Fields */
#    define DMA_CINT_CINT_MASK 0xFu
#    define DMA_CINT_CINT_SHIFT 0u
#    define DMA_CINT_CINT_WIDTH 4u
#    define DMA_CINT_CINT(x) (((uint8_t)(((uint8_t)(x)) << DMA_CINT_CINT_SHIFT)) & DMA_CINT_CINT_MASK)
#    define DMA_CINT_CAIR_MASK 0x40u
#    define DMA_CINT_CAIR_SHIFT 6u
#    define DMA_CINT_CAIR_WIDTH 1u
#    define DMA_CINT_CAIR(x) (((uint8_t)(((uint8_t)(x)) << DMA_CINT_CAIR_SHIFT)) & DMA_CINT_CAIR_MASK)
#    define DMA_CINT_NOP_MASK 0x80u
#    define DMA_CINT_NOP_SHIFT 7u
#    define DMA_CINT_NOP_WIDTH 1u
#    define DMA_CINT_NOP(x) (((uint8_t)(((uint8_t)(x)) << DMA_CINT_NOP_SHIFT)) & DMA_CINT_NOP_MASK)
/* INT Bit Fields */
#    define DMA_INT_INT0_MASK 0x1u
#    define DMA_INT_INT0_SHIFT 0u
#    define DMA_INT_INT0_WIDTH 1u
#    define DMA_INT_INT0(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT0_SHIFT)) & DMA_INT_INT0_MASK)
#    define DMA_INT_INT1_MASK 0x2u
#    define DMA_INT_INT1_SHIFT 1u
#    define DMA_INT_INT1_WIDTH 1u
#    define DMA_INT_INT1(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT1_SHIFT)) & DMA_INT_INT1_MASK)
#    define DMA_INT_INT2_MASK 0x4u
#    define DMA_INT_INT2_SHIFT 2u
#    define DMA_INT_INT2_WIDTH 1u
#    define DMA_INT_INT2(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT2_SHIFT)) & DMA_INT_INT2_MASK)
#    define DMA_INT_INT3_MASK 0x8u
#    define DMA_INT_INT3_SHIFT 3u
#    define DMA_INT_INT3_WIDTH 1u
#    define DMA_INT_INT3(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT3_SHIFT)) & DMA_INT_INT3_MASK)
#    define DMA_INT_INT4_MASK 0x10u
#    define DMA_INT_INT4_SHIFT 4u
#    define DMA_INT_INT4_WIDTH 1u
#    define DMA_INT_INT4(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT4_SHIFT)) & DMA_INT_INT4_MASK)
#    define DMA_INT_INT5_MASK 0x20u
#    define DMA_INT_INT5_SHIFT 5u
#    define DMA_INT_INT5_WIDTH 1u
#    define DMA_INT_INT5(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT5_SHIFT)) & DMA_INT_INT5_MASK)
#    define DMA_INT_INT6_MASK 0x40u
#    define DMA_INT_INT6_SHIFT 6u
#    define DMA_INT_INT6_WIDTH 1u
#    define DMA_INT_INT6(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT6_SHIFT)) & DMA_INT_INT6_MASK)
#    define DMA_INT_INT7_MASK 0x80u
#    define DMA_INT_INT7_SHIFT 7u
#    define DMA_INT_INT7_WIDTH 1u
#    define DMA_INT_INT7(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT7_SHIFT)) & DMA_INT_INT7_MASK)
#    define DMA_INT_INT8_MASK 0x100u
#    define DMA_INT_INT8_SHIFT 8u
#    define DMA_INT_INT8_WIDTH 1u
#    define DMA_INT_INT8(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT8_SHIFT)) & DMA_INT_INT8_MASK)
#    define DMA_INT_INT9_MASK 0x200u
#    define DMA_INT_INT9_SHIFT 9u
#    define DMA_INT_INT9_WIDTH 1u
#    define DMA_INT_INT9(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT9_SHIFT)) & DMA_INT_INT9_MASK)
#    define DMA_INT_INT10_MASK 0x400u
#    define DMA_INT_INT10_SHIFT 10u
#    define DMA_INT_INT10_WIDTH 1u
#    define DMA_INT_INT10(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT10_SHIFT)) & DMA_INT_INT10_MASK)
#    define DMA_INT_INT11_MASK 0x800u
#    define DMA_INT_INT11_SHIFT 11u
#    define DMA_INT_INT11_WIDTH 1u
#    define DMA_INT_INT11(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT11_SHIFT)) & DMA_INT_INT11_MASK)
#    define DMA_INT_INT12_MASK 0x1000u
#    define DMA_INT_INT12_SHIFT 12u
#    define DMA_INT_INT12_WIDTH 1u
#    define DMA_INT_INT12(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT12_SHIFT)) & DMA_INT_INT12_MASK)
#    define DMA_INT_INT13_MASK 0x2000u
#    define DMA_INT_INT13_SHIFT 13u
#    define DMA_INT_INT13_WIDTH 1u
#    define DMA_INT_INT13(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT13_SHIFT)) & DMA_INT_INT13_MASK)
#    define DMA_INT_INT14_MASK 0x4000u
#    define DMA_INT_INT14_SHIFT 14u
#    define DMA_INT_INT14_WIDTH 1u
#    define DMA_INT_INT14(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT14_SHIFT)) & DMA_INT_INT14_MASK)
#    define DMA_INT_INT15_MASK 0x8000u
#    define DMA_INT_INT15_SHIFT 15u
#    define DMA_INT_INT15_WIDTH 1u
#    define DMA_INT_INT15(x) (((uint32_t)(((uint32_t)(x)) << DMA_INT_INT15_SHIFT)) & DMA_INT_INT15_MASK)
/* ERR Bit Fields */
#    define DMA_ERR_ERR0_MASK 0x1u
#    define DMA_ERR_ERR0_SHIFT 0u
#    define DMA_ERR_ERR0_WIDTH 1u
#    define DMA_ERR_ERR0(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR0_SHIFT)) & DMA_ERR_ERR0_MASK)
#    define DMA_ERR_ERR1_MASK 0x2u
#    define DMA_ERR_ERR1_SHIFT 1u
#    define DMA_ERR_ERR1_WIDTH 1u
#    define DMA_ERR_ERR1(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR1_SHIFT)) & DMA_ERR_ERR1_MASK)
#    define DMA_ERR_ERR2_MASK 0x4u
#    define DMA_ERR_ERR2_SHIFT 2u
#    define DMA_ERR_ERR2_WIDTH 1u
#    define DMA_ERR_ERR2(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR2_SHIFT)) & DMA_ERR_ERR2_MASK)
#    define DMA_ERR_ERR3_MASK 0x8u
#    define DMA_ERR_ERR3_SHIFT 3u
#    define DMA_ERR_ERR3_WIDTH 1u
#    define DMA_ERR_ERR3(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR3_SHIFT)) & DMA_ERR_ERR3_MASK)
#    define DMA_ERR_ERR4_MASK 0x10u
#    define DMA_ERR_ERR4_SHIFT 4u
#    define DMA_ERR_ERR4_WIDTH 1u
#    define DMA_ERR_ERR4(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR4_SHIFT)) & DMA_ERR_ERR4_MASK)
#    define DMA_ERR_ERR5_MASK 0x20u
#    define DMA_ERR_ERR5_SHIFT 5u
#    define DMA_ERR_ERR5_WIDTH 1u
#    define DMA_ERR_ERR5(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR5_SHIFT)) & DMA_ERR_ERR5_MASK)
#    define DMA_ERR_ERR6_MASK 0x40u
#    define DMA_ERR_ERR6_SHIFT 6u
#    define DMA_ERR_ERR6_WIDTH 1u
#    define DMA_ERR_ERR6(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR6_SHIFT)) & DMA_ERR_ERR6_MASK)
#    define DMA_ERR_ERR7_MASK 0x80u
#    define DMA_ERR_ERR7_SHIFT 7u
#    define DMA_ERR_ERR7_WIDTH 1u
#    define DMA_ERR_ERR7(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR7_SHIFT)) & DMA_ERR_ERR7_MASK)
#    define DMA_ERR_ERR8_MASK 0x100u
#    define DMA_ERR_ERR8_SHIFT 8u
#    define DMA_ERR_ERR8_WIDTH 1u
#    define DMA_ERR_ERR8(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR8_SHIFT)) & DMA_ERR_ERR8_MASK)
#    define DMA_ERR_ERR9_MASK 0x200u
#    define DMA_ERR_ERR9_SHIFT 9u
#    define DMA_ERR_ERR9_WIDTH 1u
#    define DMA_ERR_ERR9(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR9_SHIFT)) & DMA_ERR_ERR9_MASK)
#    define DMA_ERR_ERR10_MASK 0x400u
#    define DMA_ERR_ERR10_SHIFT 10u
#    define DMA_ERR_ERR10_WIDTH 1u
#    define DMA_ERR_ERR10(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR10_SHIFT)) & DMA_ERR_ERR10_MASK)
#    define DMA_ERR_ERR11_MASK 0x800u
#    define DMA_ERR_ERR11_SHIFT 11u
#    define DMA_ERR_ERR11_WIDTH 1u
#    define DMA_ERR_ERR11(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR11_SHIFT)) & DMA_ERR_ERR11_MASK)
#    define DMA_ERR_ERR12_MASK 0x1000u
#    define DMA_ERR_ERR12_SHIFT 12u
#    define DMA_ERR_ERR12_WIDTH 1u
#    define DMA_ERR_ERR12(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR12_SHIFT)) & DMA_ERR_ERR12_MASK)
#    define DMA_ERR_ERR13_MASK 0x2000u
#    define DMA_ERR_ERR13_SHIFT 13u
#    define DMA_ERR_ERR13_WIDTH 1u
#    define DMA_ERR_ERR13(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR13_SHIFT)) & DMA_ERR_ERR13_MASK)
#    define DMA_ERR_ERR14_MASK 0x4000u
#    define DMA_ERR_ERR14_SHIFT 14u
#    define DMA_ERR_ERR14_WIDTH 1u
#    define DMA_ERR_ERR14(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR14_SHIFT)) & DMA_ERR_ERR14_MASK)
#    define DMA_ERR_ERR15_MASK 0x8000u
#    define DMA_ERR_ERR15_SHIFT 15u
#    define DMA_ERR_ERR15_WIDTH 1u
#    define DMA_ERR_ERR15(x) (((uint32_t)(((uint32_t)(x)) << DMA_ERR_ERR15_SHIFT)) & DMA_ERR_ERR15_MASK)
/* HRS Bit Fields */
#    define DMA_HRS_HRS0_MASK 0x1u
#    define DMA_HRS_HRS0_SHIFT 0u
#    define DMA_HRS_HRS0_WIDTH 1u
#    define DMA_HRS_HRS0(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS0_SHIFT)) & DMA_HRS_HRS0_MASK)
#    define DMA_HRS_HRS1_MASK 0x2u
#    define DMA_HRS_HRS1_SHIFT 1u
#    define DMA_HRS_HRS1_WIDTH 1u
#    define DMA_HRS_HRS1(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS1_SHIFT)) & DMA_HRS_HRS1_MASK)
#    define DMA_HRS_HRS2_MASK 0x4u
#    define DMA_HRS_HRS2_SHIFT 2u
#    define DMA_HRS_HRS2_WIDTH 1u
#    define DMA_HRS_HRS2(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS2_SHIFT)) & DMA_HRS_HRS2_MASK)
#    define DMA_HRS_HRS3_MASK 0x8u
#    define DMA_HRS_HRS3_SHIFT 3u
#    define DMA_HRS_HRS3_WIDTH 1u
#    define DMA_HRS_HRS3(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS3_SHIFT)) & DMA_HRS_HRS3_MASK)
#    define DMA_HRS_HRS4_MASK 0x10u
#    define DMA_HRS_HRS4_SHIFT 4u
#    define DMA_HRS_HRS4_WIDTH 1u
#    define DMA_HRS_HRS4(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS4_SHIFT)) & DMA_HRS_HRS4_MASK)
#    define DMA_HRS_HRS5_MASK 0x20u
#    define DMA_HRS_HRS5_SHIFT 5u
#    define DMA_HRS_HRS5_WIDTH 1u
#    define DMA_HRS_HRS5(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS5_SHIFT)) & DMA_HRS_HRS5_MASK)
#    define DMA_HRS_HRS6_MASK 0x40u
#    define DMA_HRS_HRS6_SHIFT 6u
#    define DMA_HRS_HRS6_WIDTH 1u
