OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define DMA_HRS_HRS6(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS6_SHIFT)) & DMA_HRS_HRS6_MASK)
#    define DMA_HRS_HRS7_MASK 0x80u
#    define DMA_HRS_HRS7_SHIFT 7u
#    define DMA_HRS_HRS7_WIDTH 1u
#    define DMA_HRS_HRS7(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS7_SHIFT)) & DMA_HRS_HRS7_MASK)
#    define DMA_HRS_HRS8_MASK 0x100u
#    define DMA_HRS_HRS8_SHIFT 8u
#    define DMA_HRS_HRS8_WIDTH 1u
#    define DMA_HRS_HRS8(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS8_SHIFT)) & DMA_HRS_HRS8_MASK)
#    define DMA_HRS_HRS9_MASK 0x200u
#    define DMA_HRS_HRS9_SHIFT 9u
#    define DMA_HRS_HRS9_WIDTH 1u
#    define DMA_HRS_HRS9(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS9_SHIFT)) & DMA_HRS_HRS9_MASK)
#    define DMA_HRS_HRS10_MASK 0x400u
#    define DMA_HRS_HRS10_SHIFT 10u
#    define DMA_HRS_HRS10_WIDTH 1u
#    define DMA_HRS_HRS10(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS10_SHIFT)) & DMA_HRS_HRS10_MASK)
#    define DMA_HRS_HRS11_MASK 0x800u
#    define DMA_HRS_HRS11_SHIFT 11u
#    define DMA_HRS_HRS11_WIDTH 1u
#    define DMA_HRS_HRS11(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS11_SHIFT)) & DMA_HRS_HRS11_MASK)
#    define DMA_HRS_HRS12_MASK 0x1000u
#    define DMA_HRS_HRS12_SHIFT 12u
#    define DMA_HRS_HRS12_WIDTH 1u
#    define DMA_HRS_HRS12(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS12_SHIFT)) & DMA_HRS_HRS12_MASK)
#    define DMA_HRS_HRS13_MASK 0x2000u
#    define DMA_HRS_HRS13_SHIFT 13u
#    define DMA_HRS_HRS13_WIDTH 1u
#    define DMA_HRS_HRS13(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS13_SHIFT)) & DMA_HRS_HRS13_MASK)
#    define DMA_HRS_HRS14_MASK 0x4000u
#    define DMA_HRS_HRS14_SHIFT 14u
#    define DMA_HRS_HRS14_WIDTH 1u
#    define DMA_HRS_HRS14(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS14_SHIFT)) & DMA_HRS_HRS14_MASK)
#    define DMA_HRS_HRS15_MASK 0x8000u
#    define DMA_HRS_HRS15_SHIFT 15u
#    define DMA_HRS_HRS15_WIDTH 1u
#    define DMA_HRS_HRS15(x) (((uint32_t)(((uint32_t)(x)) << DMA_HRS_HRS15_SHIFT)) & DMA_HRS_HRS15_MASK)
/* EARS Bit Fields */
#    define DMA_EARS_EDREQ_0_MASK 0x1u
#    define DMA_EARS_EDREQ_0_SHIFT 0u
#    define DMA_EARS_EDREQ_0_WIDTH 1u
#    define DMA_EARS_EDREQ_0(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_0_SHIFT)) & DMA_EARS_EDREQ_0_MASK)
#    define DMA_EARS_EDREQ_1_MASK 0x2u
#    define DMA_EARS_EDREQ_1_SHIFT 1u
#    define DMA_EARS_EDREQ_1_WIDTH 1u
#    define DMA_EARS_EDREQ_1(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_1_SHIFT)) & DMA_EARS_EDREQ_1_MASK)
#    define DMA_EARS_EDREQ_2_MASK 0x4u
#    define DMA_EARS_EDREQ_2_SHIFT 2u
#    define DMA_EARS_EDREQ_2_WIDTH 1u
#    define DMA_EARS_EDREQ_2(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_2_SHIFT)) & DMA_EARS_EDREQ_2_MASK)
#    define DMA_EARS_EDREQ_3_MASK 0x8u
#    define DMA_EARS_EDREQ_3_SHIFT 3u
#    define DMA_EARS_EDREQ_3_WIDTH 1u
#    define DMA_EARS_EDREQ_3(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_3_SHIFT)) & DMA_EARS_EDREQ_3_MASK)
#    define DMA_EARS_EDREQ_4_MASK 0x10u
#    define DMA_EARS_EDREQ_4_SHIFT 4u
#    define DMA_EARS_EDREQ_4_WIDTH 1u
#    define DMA_EARS_EDREQ_4(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_4_SHIFT)) & DMA_EARS_EDREQ_4_MASK)
#    define DMA_EARS_EDREQ_5_MASK 0x20u
#    define DMA_EARS_EDREQ_5_SHIFT 5u
#    define DMA_EARS_EDREQ_5_WIDTH 1u
#    define DMA_EARS_EDREQ_5(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_5_SHIFT)) & DMA_EARS_EDREQ_5_MASK)
#    define DMA_EARS_EDREQ_6_MASK 0x40u
#    define DMA_EARS_EDREQ_6_SHIFT 6u
#    define DMA_EARS_EDREQ_6_WIDTH 1u
#    define DMA_EARS_EDREQ_6(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_6_SHIFT)) & DMA_EARS_EDREQ_6_MASK)
#    define DMA_EARS_EDREQ_7_MASK 0x80u
#    define DMA_EARS_EDREQ_7_SHIFT 7u
#    define DMA_EARS_EDREQ_7_WIDTH 1u
#    define DMA_EARS_EDREQ_7(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_7_SHIFT)) & DMA_EARS_EDREQ_7_MASK)
#    define DMA_EARS_EDREQ_8_MASK 0x100u
#    define DMA_EARS_EDREQ_8_SHIFT 8u
#    define DMA_EARS_EDREQ_8_WIDTH 1u
#    define DMA_EARS_EDREQ_8(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_8_SHIFT)) & DMA_EARS_EDREQ_8_MASK)
#    define DMA_EARS_EDREQ_9_MASK 0x200u
#    define DMA_EARS_EDREQ_9_SHIFT 9u
#    define DMA_EARS_EDREQ_9_WIDTH 1u
#    define DMA_EARS_EDREQ_9(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_9_SHIFT)) & DMA_EARS_EDREQ_9_MASK)
#    define DMA_EARS_EDREQ_10_MASK 0x400u
#    define DMA_EARS_EDREQ_10_SHIFT 10u
#    define DMA_EARS_EDREQ_10_WIDTH 1u
#    define DMA_EARS_EDREQ_10(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_10_SHIFT)) & DMA_EARS_EDREQ_10_MASK)
#    define DMA_EARS_EDREQ_11_MASK 0x800u
#    define DMA_EARS_EDREQ_11_SHIFT 11u
#    define DMA_EARS_EDREQ_11_WIDTH 1u
#    define DMA_EARS_EDREQ_11(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_11_SHIFT)) & DMA_EARS_EDREQ_11_MASK)
#    define DMA_EARS_EDREQ_12_MASK 0x1000u
#    define DMA_EARS_EDREQ_12_SHIFT 12u
#    define DMA_EARS_EDREQ_12_WIDTH 1u
#    define DMA_EARS_EDREQ_12(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_12_SHIFT)) & DMA_EARS_EDREQ_12_MASK)
#    define DMA_EARS_EDREQ_13_MASK 0x2000u
#    define DMA_EARS_EDREQ_13_SHIFT 13u
#    define DMA_EARS_EDREQ_13_WIDTH 1u
#    define DMA_EARS_EDREQ_13(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_13_SHIFT)) & DMA_EARS_EDREQ_13_MASK)
#    define DMA_EARS_EDREQ_14_MASK 0x4000u
#    define DMA_EARS_EDREQ_14_SHIFT 14u
#    define DMA_EARS_EDREQ_14_WIDTH 1u
#    define DMA_EARS_EDREQ_14(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_14_SHIFT)) & DMA_EARS_EDREQ_14_MASK)
#    define DMA_EARS_EDREQ_15_MASK 0x8000u
#    define DMA_EARS_EDREQ_15_SHIFT 15u
#    define DMA_EARS_EDREQ_15_WIDTH 1u
#    define DMA_EARS_EDREQ_15(x) (((uint32_t)(((uint32_t)(x)) << DMA_EARS_EDREQ_15_SHIFT)) & DMA_EARS_EDREQ_15_MASK)
/* DCHPRI Bit Fields */
#    define DMA_DCHPRI_CHPRI_MASK 0xFu
#    define DMA_DCHPRI_CHPRI_SHIFT 0u
#    define DMA_DCHPRI_CHPRI_WIDTH 4u
#    define DMA_DCHPRI_CHPRI(x) (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_CHPRI_SHIFT)) & DMA_DCHPRI_CHPRI_MASK)
#    define DMA_DCHPRI_DPA_MASK 0x40u
#    define DMA_DCHPRI_DPA_SHIFT 6u
#    define DMA_DCHPRI_DPA_WIDTH 1u
#    define DMA_DCHPRI_DPA(x) (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_DPA_SHIFT)) & DMA_DCHPRI_DPA_MASK)
#    define DMA_DCHPRI_ECP_MASK 0x80u
#    define DMA_DCHPRI_ECP_SHIFT 7u
#    define DMA_DCHPRI_ECP_WIDTH 1u
#    define DMA_DCHPRI_ECP(x) (((uint8_t)(((uint8_t)(x)) << DMA_DCHPRI_ECP_SHIFT)) & DMA_DCHPRI_ECP_MASK)
/* TCD_SADDR Bit Fields */
#    define DMA_TCD_SADDR_SADDR_MASK 0xFFFFFFFFu
#    define DMA_TCD_SADDR_SADDR_SHIFT 0u
#    define DMA_TCD_SADDR_SADDR_WIDTH 32u
#    define DMA_TCD_SADDR_SADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_SADDR_SADDR_SHIFT)) & DMA_TCD_SADDR_SADDR_MASK)
/* TCD_SOFF Bit Fields */
#    define DMA_TCD_SOFF_SOFF_MASK 0xFFFFu
#    define DMA_TCD_SOFF_SOFF_SHIFT 0u
#    define DMA_TCD_SOFF_SOFF_WIDTH 16u
#    define DMA_TCD_SOFF_SOFF(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_SOFF_SOFF_SHIFT)) & DMA_TCD_SOFF_SOFF_MASK)
/* TCD_ATTR Bit Fields */
#    define DMA_TCD_ATTR_DSIZE_MASK 0x7u
#    define DMA_TCD_ATTR_DSIZE_SHIFT 0u
#    define DMA_TCD_ATTR_DSIZE_WIDTH 3u
#    define DMA_TCD_ATTR_DSIZE(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_DSIZE_SHIFT)) & DMA_TCD_ATTR_DSIZE_MASK)
#    define DMA_TCD_ATTR_DMOD_MASK 0xF8u
#    define DMA_TCD_ATTR_DMOD_SHIFT 3u
#    define DMA_TCD_ATTR_DMOD_WIDTH 5u
#    define DMA_TCD_ATTR_DMOD(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_DMOD_SHIFT)) & DMA_TCD_ATTR_DMOD_MASK)
#    define DMA_TCD_ATTR_SSIZE_MASK 0x700u
#    define DMA_TCD_ATTR_SSIZE_SHIFT 8u
#    define DMA_TCD_ATTR_SSIZE_WIDTH 3u
#    define DMA_TCD_ATTR_SSIZE(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_SSIZE_SHIFT)) & DMA_TCD_ATTR_SSIZE_MASK)
#    define DMA_TCD_ATTR_SMOD_MASK 0xF800u
#    define DMA_TCD_ATTR_SMOD_SHIFT 11u
#    define DMA_TCD_ATTR_SMOD_WIDTH 5u
#    define DMA_TCD_ATTR_SMOD(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_ATTR_SMOD_SHIFT)) & DMA_TCD_ATTR_SMOD_MASK)
/* TCD_NBYTES_MLNO Bit Fields */
#    define DMA_TCD_NBYTES_MLNO_NBYTES_MASK 0xFFFFFFFFu
#    define DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT 0u
#    define DMA_TCD_NBYTES_MLNO_NBYTES_WIDTH 32u
#    define DMA_TCD_NBYTES_MLNO_NBYTES(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT)) & DMA_TCD_NBYTES_MLNO_NBYTES_MASK)
/* TCD_NBYTES_MLOFFNO Bit Fields */
#    define DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK 0x3FFFFFFFu
#    define DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT 0u
#    define DMA_TCD_NBYTES_MLOFFNO_NBYTES_WIDTH 30u
#    define DMA_TCD_NBYTES_MLOFFNO_NBYTES(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT)) & DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK)
#    define DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK 0x40000000u
#    define DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT 30u
#    define DMA_TCD_NBYTES_MLOFFNO_DMLOE_WIDTH 1u
#    define DMA_TCD_NBYTES_MLOFFNO_DMLOE(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT)) & DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK)
#    define DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK 0x80000000u
#    define DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT 31u
#    define DMA_TCD_NBYTES_MLOFFNO_SMLOE_WIDTH 1u
#    define DMA_TCD_NBYTES_MLOFFNO_SMLOE(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT)) & DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK)
/* TCD_NBYTES_MLOFFYES Bit Fields */
#    define DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK 0x3FFu
#    define DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT 0u
#    define DMA_TCD_NBYTES_MLOFFYES_NBYTES_WIDTH 10u
#    define DMA_TCD_NBYTES_MLOFFYES_NBYTES(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK)
#    define DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK 0x3FFFFC00u
#    define DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT 10u
#    define DMA_TCD_NBYTES_MLOFFYES_MLOFF_WIDTH 20u
#    define DMA_TCD_NBYTES_MLOFFYES_MLOFF(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT)) & DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK)
#    define DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK 0x40000000u
#    define DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT 30u
#    define DMA_TCD_NBYTES_MLOFFYES_DMLOE_WIDTH 1u
#    define DMA_TCD_NBYTES_MLOFFYES_DMLOE(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT)) & DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK)
#    define DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK 0x80000000u
#    define DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT 31u
#    define DMA_TCD_NBYTES_MLOFFYES_SMLOE_WIDTH 1u
#    define DMA_TCD_NBYTES_MLOFFYES_SMLOE(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT)) & DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK)
/* TCD_SLAST Bit Fields */
#    define DMA_TCD_SLAST_SLAST_MASK 0xFFFFFFFFu
#    define DMA_TCD_SLAST_SLAST_SHIFT 0u
#    define DMA_TCD_SLAST_SLAST_WIDTH 32u
#    define DMA_TCD_SLAST_SLAST(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_SLAST_SLAST_SHIFT)) & DMA_TCD_SLAST_SLAST_MASK)
/* TCD_DADDR Bit Fields */
#    define DMA_TCD_DADDR_DADDR_MASK 0xFFFFFFFFu
#    define DMA_TCD_DADDR_DADDR_SHIFT 0u
#    define DMA_TCD_DADDR_DADDR_WIDTH 32u
#    define DMA_TCD_DADDR_DADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_DADDR_DADDR_SHIFT)) & DMA_TCD_DADDR_DADDR_MASK)
/* TCD_DOFF Bit Fields */
#    define DMA_TCD_DOFF_DOFF_MASK 0xFFFFu
#    define DMA_TCD_DOFF_DOFF_SHIFT 0u
#    define DMA_TCD_DOFF_DOFF_WIDTH 16u
#    define DMA_TCD_DOFF_DOFF(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_DOFF_DOFF_SHIFT)) & DMA_TCD_DOFF_DOFF_MASK)
/* TCD_CITER_ELINKNO Bit Fields */
#    define DMA_TCD_CITER_ELINKNO_CITER_MASK 0x7FFFu
#    define DMA_TCD_CITER_ELINKNO_CITER_SHIFT 0u
#    define DMA_TCD_CITER_ELINKNO_CITER_WIDTH 15u
#    define DMA_TCD_CITER_ELINKNO_CITER(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKNO_CITER_SHIFT)) & DMA_TCD_CITER_ELINKNO_CITER_MASK)
#    define DMA_TCD_CITER_ELINKNO_ELINK_MASK 0x8000u
#    define DMA_TCD_CITER_ELINKNO_ELINK_SHIFT 15u
#    define DMA_TCD_CITER_ELINKNO_ELINK_WIDTH 1u
#    define DMA_TCD_CITER_ELINKNO_ELINK(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD_CITER_ELINKNO_ELINK_MASK)
/* TCD_CITER_ELINKYES Bit Fields */
#    define DMA_TCD_CITER_ELINKYES_CITER_LE_MASK 0x1FFu
#    define DMA_TCD_CITER_ELINKYES_CITER_LE_SHIFT 0u
#    define DMA_TCD_CITER_ELINKYES_CITER_LE_WIDTH 9u
#    define DMA_TCD_CITER_ELINKYES_CITER_LE(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_CITER_LE_SHIFT)) & DMA_TCD_CITER_ELINKYES_CITER_LE_MASK)
#    define DMA_TCD_CITER_ELINKYES_LINKCH_MASK 0x1E00u
#    define DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT 9u
#    define DMA_TCD_CITER_ELINKYES_LINKCH_WIDTH 4u
#    define DMA_TCD_CITER_ELINKYES_LINKCH(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_CITER_ELINKYES_LINKCH_MASK)
#    define DMA_TCD_CITER_ELINKYES_ELINK_MASK 0x8000u
#    define DMA_TCD_CITER_ELINKYES_ELINK_SHIFT 15u
#    define DMA_TCD_CITER_ELINKYES_ELINK_WIDTH 1u
#    define DMA_TCD_CITER_ELINKYES_ELINK(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_CITER_ELINKYES_ELINK_MASK)
/* TCD_DLASTSGA Bit Fields */
#    define DMA_TCD_DLASTSGA_DLASTSGA_MASK 0xFFFFFFFFu
#    define DMA_TCD_DLASTSGA_DLASTSGA_SHIFT 0u
#    define DMA_TCD_DLASTSGA_DLASTSGA_WIDTH 32u
#    define DMA_TCD_DLASTSGA_DLASTSGA(x) \
        (((uint32_t)(((uint32_t)(x)) << DMA_TCD_DLASTSGA_DLASTSGA_SHIFT)) & DMA_TCD_DLASTSGA_DLASTSGA_MASK)
/* TCD_CSR Bit Fields */
#    define DMA_TCD_CSR_START_MASK 0x1u
#    define DMA_TCD_CSR_START_SHIFT 0u
#    define DMA_TCD_CSR_START_WIDTH 1u
#    define DMA_TCD_CSR_START(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_START_SHIFT)) & DMA_TCD_CSR_START_MASK)
#    define DMA_TCD_CSR_INTMAJOR_MASK 0x2u
#    define DMA_TCD_CSR_INTMAJOR_SHIFT 1u
#    define DMA_TCD_CSR_INTMAJOR_WIDTH 1u
#    define DMA_TCD_CSR_INTMAJOR(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_INTMAJOR_SHIFT)) & DMA_TCD_CSR_INTMAJOR_MASK)
#    define DMA_TCD_CSR_INTHALF_MASK 0x4u
#    define DMA_TCD_CSR_INTHALF_SHIFT 2u
#    define DMA_TCD_CSR_INTHALF_WIDTH 1u
#    define DMA_TCD_CSR_INTHALF(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_INTHALF_SHIFT)) & DMA_TCD_CSR_INTHALF_MASK)
#    define DMA_TCD_CSR_DREQ_MASK 0x8u
#    define DMA_TCD_CSR_DREQ_SHIFT 3u
#    define DMA_TCD_CSR_DREQ_WIDTH 1u
#    define DMA_TCD_CSR_DREQ(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_DREQ_SHIFT)) & DMA_TCD_CSR_DREQ_MASK)
#    define DMA_TCD_CSR_ESG_MASK 0x10u
#    define DMA_TCD_CSR_ESG_SHIFT 4u
#    define DMA_TCD_CSR_ESG_WIDTH 1u
#    define DMA_TCD_CSR_ESG(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_ESG_SHIFT)) & DMA_TCD_CSR_ESG_MASK)
#    define DMA_TCD_CSR_MAJORELINK_MASK 0x20u
#    define DMA_TCD_CSR_MAJORELINK_SHIFT 5u
#    define DMA_TCD_CSR_MAJORELINK_WIDTH 1u
#    define DMA_TCD_CSR_MAJORELINK(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_MAJORELINK_SHIFT)) & DMA_TCD_CSR_MAJORELINK_MASK)
#    define DMA_TCD_CSR_ACTIVE_MASK 0x40u
#    define DMA_TCD_CSR_ACTIVE_SHIFT 6u
#    define DMA_TCD_CSR_ACTIVE_WIDTH 1u
#    define DMA_TCD_CSR_ACTIVE(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_ACTIVE_SHIFT)) & DMA_TCD_CSR_ACTIVE_MASK)
#    define DMA_TCD_CSR_DONE_MASK 0x80u
#    define DMA_TCD_CSR_DONE_SHIFT 7u
#    define DMA_TCD_CSR_DONE_WIDTH 1u
#    define DMA_TCD_CSR_DONE(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_DONE_SHIFT)) & DMA_TCD_CSR_DONE_MASK)
#    define DMA_TCD_CSR_MAJORLINKCH_MASK 0xF00u
#    define DMA_TCD_CSR_MAJORLINKCH_SHIFT 8u
#    define DMA_TCD_CSR_MAJORLINKCH_WIDTH 4u
#    define DMA_TCD_CSR_MAJORLINKCH(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_MAJORLINKCH_SHIFT)) & DMA_TCD_CSR_MAJORLINKCH_MASK)
#    define DMA_TCD_CSR_BWC_MASK 0xC000u
#    define DMA_TCD_CSR_BWC_SHIFT 14u
#    define DMA_TCD_CSR_BWC_WIDTH 2u
#    define DMA_TCD_CSR_BWC(x) (((uint16_t)(((uint16_t)(x)) << DMA_TCD_CSR_BWC_SHIFT)) & DMA_TCD_CSR_BWC_MASK)
/* TCD_BITER_ELINKNO Bit Fields */
#    define DMA_TCD_BITER_ELINKNO_BITER_MASK 0x7FFFu
#    define DMA_TCD_BITER_ELINKNO_BITER_SHIFT 0u
#    define DMA_TCD_BITER_ELINKNO_BITER_WIDTH 15u
#    define DMA_TCD_BITER_ELINKNO_BITER(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKNO_BITER_SHIFT)) & DMA_TCD_BITER_ELINKNO_BITER_MASK)
#    define DMA_TCD_BITER_ELINKNO_ELINK_MASK 0x8000u
#    define DMA_TCD_BITER_ELINKNO_ELINK_SHIFT 15u
#    define DMA_TCD_BITER_ELINKNO_ELINK_WIDTH 1u
#    define DMA_TCD_BITER_ELINKNO_ELINK(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKNO_ELINK_SHIFT)) & DMA_TCD_BITER_ELINKNO_ELINK_MASK)
/* TCD_BITER_ELINKYES Bit Fields */
#    define DMA_TCD_BITER_ELINKYES_BITER_MASK 0x1FFu
#    define DMA_TCD_BITER_ELINKYES_BITER_SHIFT 0u
#    define DMA_TCD_BITER_ELINKYES_BITER_WIDTH 9u
#    define DMA_TCD_BITER_ELINKYES_BITER(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_BITER_SHIFT)) & DMA_TCD_BITER_ELINKYES_BITER_MASK)
#    define DMA_TCD_BITER_ELINKYES_LINKCH_MASK 0x1E00u
#    define DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT 9u
#    define DMA_TCD_BITER_ELINKYES_LINKCH_WIDTH 4u
#    define DMA_TCD_BITER_ELINKYES_LINKCH(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT)) & DMA_TCD_BITER_ELINKYES_LINKCH_MASK)
#    define DMA_TCD_BITER_ELINKYES_ELINK_MASK 0x8000u
#    define DMA_TCD_BITER_ELINKYES_ELINK_SHIFT 15u
#    define DMA_TCD_BITER_ELINKYES_ELINK_WIDTH 1u
#    define DMA_TCD_BITER_ELINKYES_ELINK(x) \
        (((uint16_t)(((uint16_t)(x)) << DMA_TCD_BITER_ELINKYES_ELINK_SHIFT)) & DMA_TCD_BITER_ELINKYES_ELINK_MASK)

/*!
 * @}
 */ /* end of group DMA_Register_Masks */

/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- DMAMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Peripheral_Access_Layer DMAMUX Peripheral Access Layer
 * @{
 */

/** DMAMUX - Size of Registers Arrays */
#    define DMAMUX_CHCFG_COUNT 16u

/** DMAMUX - Register Layout Typedef */
typedef struct
{
    __IO uint8_t CHCFG[DMAMUX_CHCFG_COUNT]; /**< Channel Configuration register, array offset: 0x0, array step: 0x1 */
} DMAMUX_Type, *DMAMUX_MemMapPtr;

/** Number of instances of the DMAMUX module. */
#    define DMAMUX_INSTANCE_COUNT (1u)

/* DMAMUX - Peripheral instance base addresses */
/** Peripheral DMAMUX base address */
#    define DMAMUX_BASE (0x40021000u)
/** Peripheral DMAMUX base pointer */
#    define DMAMUX ((DMAMUX_Type*) DMAMUX_BASE)
/** Array initializer of DMAMUX peripheral base addresses */
#    define DMAMUX_BASE_ADDRS \
        {                     \
            DMAMUX_BASE       \
        }
/** Array initializer of DMAMUX peripheral base pointers */
#    define DMAMUX_BASE_PTRS \
        {                    \
            DMAMUX           \
        }

/* ----------------------------------------------------------------------------
   -- DMAMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMAMUX_Register_Masks DMAMUX Register Masks
 * @{
 */

/* CHCFG Bit Fields */
#    define DMAMUX_CHCFG_SOURCE_MASK 0x3Fu
#    define DMAMUX_CHCFG_SOURCE_SHIFT 0u
#    define DMAMUX_CHCFG_SOURCE_WIDTH 6u
#    define DMAMUX_CHCFG_SOURCE(x) (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_SOURCE_SHIFT)) & DMAMUX_CHCFG_SOURCE_MASK)
#    define DMAMUX_CHCFG_TRIG_MASK 0x40u
#    define DMAMUX_CHCFG_TRIG_SHIFT 6u
#    define DMAMUX_CHCFG_TRIG_WIDTH 1u
#    define DMAMUX_CHCFG_TRIG(x) (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_TRIG_SHIFT)) & DMAMUX_CHCFG_TRIG_MASK)
#    define DMAMUX_CHCFG_ENBL_MASK 0x80u
#    define DMAMUX_CHCFG_ENBL_SHIFT 7u
#    define DMAMUX_CHCFG_ENBL_WIDTH 1u
#    define DMAMUX_CHCFG_ENBL(x) (((uint8_t)(((uint8_t)(x)) << DMAMUX_CHCFG_ENBL_SHIFT)) & DMAMUX_CHCFG_ENBL_MASK)

/*!
 * @}
 */ /* end of group DMAMUX_Register_Masks */

/*!
 * @}
 */ /* end of group DMAMUX_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- EIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Peripheral_Access_Layer EIM Peripheral Access Layer
 * @{
 */

/** EIM - Size of Registers Arrays */
#    define EIM_EICHDn_COUNT 2u

/** EIM - Register Layout Typedef */
typedef struct
{
    __IO uint32_t EIMCR;  /**< Error Injection Module Configuration Register, offset: 0x0 */
    __IO uint32_t EICHEN; /**< Error Injection Channel Enable register, offset: 0x4 */
    uint8_t       RESERVED_0[248];
    struct
    {                        /* offset: 0x100, array step: 0x100 */
        __IO uint32_t WORD0; /**< Error Injection Channel Descriptor n, Word0, array offset: 0x100, array step: 0x100 */
        __IO uint32_t WORD1; /**< Error Injection Channel Descriptor n, Word1, array offset: 0x104, array step: 0x100 */
        uint8_t       RESERVED_0[248];
    } EICHDn[EIM_EICHDn_COUNT];
} EIM_Type, *EIM_MemMapPtr;

/** Number of instances of the EIM module. */
#    define EIM_INSTANCE_COUNT (1u)

