OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* EIM - Peripheral instance base addresses */
/** Peripheral EIM base address */
#    define EIM_BASE (0x40019000u)
/** Peripheral EIM base pointer */
#    define EIM ((EIM_Type*) EIM_BASE)
/** Array initializer of EIM peripheral base addresses */
#    define EIM_BASE_ADDRS \
        {                  \
            EIM_BASE       \
        }
/** Array initializer of EIM peripheral base pointers */
#    define EIM_BASE_PTRS \
        {                 \
            EIM           \
        }

/* ----------------------------------------------------------------------------
   -- EIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Register_Masks EIM Register Masks
 * @{
 */

/* EIMCR Bit Fields */
#    define EIM_EIMCR_GEIEN_MASK 0x1u
#    define EIM_EIMCR_GEIEN_SHIFT 0u
#    define EIM_EIMCR_GEIEN_WIDTH 1u
#    define EIM_EIMCR_GEIEN(x) (((uint32_t)(((uint32_t)(x)) << EIM_EIMCR_GEIEN_SHIFT)) & EIM_EIMCR_GEIEN_MASK)
/* EICHEN Bit Fields */
#    define EIM_EICHEN_EICH1EN_MASK 0x40000000u
#    define EIM_EICHEN_EICH1EN_SHIFT 30u
#    define EIM_EICHEN_EICH1EN_WIDTH 1u
#    define EIM_EICHEN_EICH1EN(x) (((uint32_t)(((uint32_t)(x)) << EIM_EICHEN_EICH1EN_SHIFT)) & EIM_EICHEN_EICH1EN_MASK)
#    define EIM_EICHEN_EICH0EN_MASK 0x80000000u
#    define EIM_EICHEN_EICH0EN_SHIFT 31u
#    define EIM_EICHEN_EICH0EN_WIDTH 1u
#    define EIM_EICHEN_EICH0EN(x) (((uint32_t)(((uint32_t)(x)) << EIM_EICHEN_EICH0EN_SHIFT)) & EIM_EICHEN_EICH0EN_MASK)
/* EICHDn_WORD0 Bit Fields */
#    define EIM_EICHDn_WORD0_CHKBIT_MASK_MASK 0xFE000000u
#    define EIM_EICHDn_WORD0_CHKBIT_MASK_SHIFT 25u
#    define EIM_EICHDn_WORD0_CHKBIT_MASK_WIDTH 7u
#    define EIM_EICHDn_WORD0_CHKBIT_MASK(x) \
        (((uint32_t)(((uint32_t)(x)) << EIM_EICHDn_WORD0_CHKBIT_MASK_SHIFT)) & EIM_EICHDn_WORD0_CHKBIT_MASK_MASK)
/* EICHDn_WORD1 Bit Fields */
#    define EIM_EICHDn_WORD1_B0_3DATA_MASK_MASK 0xFFFFFFFFu
#    define EIM_EICHDn_WORD1_B0_3DATA_MASK_SHIFT 0u
#    define EIM_EICHDn_WORD1_B0_3DATA_MASK_WIDTH 32u
#    define EIM_EICHDn_WORD1_B0_3DATA_MASK(x) \
        (((uint32_t)(((uint32_t)(x)) << EIM_EICHDn_WORD1_B0_3DATA_MASK_SHIFT)) & EIM_EICHDn_WORD1_B0_3DATA_MASK_MASK)

/*!
 * @}
 */ /* end of group EIM_Register_Masks */

/*!
 * @}
 */ /* end of group EIM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- ENET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENET_Peripheral_Access_Layer ENET Peripheral Access Layer
 * @{
 */

/** ENET - Size of Registers Arrays */
#    define ENET_CHANNEL_COUNT 4u

/** ENET - Register Layout Typedef */
typedef struct
{
    uint8_t RESERVED_0[4];
    __IO uint32_t EIR;  /**< Interrupt Event Register, offset: 0x4 */
    __IO uint32_t EIMR; /**< Interrupt Mask Register, offset: 0x8 */
    uint8_t       RESERVED_1[4];
    __IO uint32_t RDAR; /**< Receive Descriptor Active Register, offset: 0x10 */
    __IO uint32_t TDAR; /**< Transmit Descriptor Active Register, offset: 0x14 */
    uint8_t       RESERVED_2[12];
    __IO uint32_t ECR; /**< Ethernet Control Register, offset: 0x24 */
    uint8_t       RESERVED_3[24];
    __IO uint32_t MMFR; /**< MII Management Frame Register, offset: 0x40 */
    __IO uint32_t MSCR; /**< MII Speed Control Register, offset: 0x44 */
    uint8_t       RESERVED_4[28];
    __IO uint32_t MIBC; /**< MIB Control Register, offset: 0x64 */
    uint8_t       RESERVED_5[28];
    __IO uint32_t RCR; /**< Receive Control Register, offset: 0x84 */
    uint8_t       RESERVED_6[60];
    __IO uint32_t TCR; /**< Transmit Control Register, offset: 0xC4 */
    uint8_t       RESERVED_7[28];
    __IO uint32_t PALR; /**< Physical Address Lower Register, offset: 0xE4 */
    __IO uint32_t PAUR; /**< Physical Address Upper Register, offset: 0xE8 */
    __IO uint32_t OPD;  /**< Opcode/Pause Duration Register, offset: 0xEC */
    uint8_t       RESERVED_8[40];
    __IO uint32_t IAUR; /**< Descriptor Individual Upper Address Register, offset: 0x118 */
    __IO uint32_t IALR; /**< Descriptor Individual Lower Address Register, offset: 0x11C */
    __IO uint32_t GAUR; /**< Descriptor Group Upper Address Register, offset: 0x120 */
    __IO uint32_t GALR; /**< Descriptor Group Lower Address Register, offset: 0x124 */
    uint8_t       RESERVED_9[28];
    __IO uint32_t TFWR; /**< Transmit FIFO Watermark Register, offset: 0x144 */
    uint8_t       RESERVED_10[56];
    __IO uint32_t RDSR; /**< Receive Descriptor Ring Start Register, offset: 0x180 */
    __IO uint32_t TDSR; /**< Transmit Buffer Descriptor Ring Start Register, offset: 0x184 */
    __IO uint32_t MRBR; /**< Maximum Receive Buffer Size Register, offset: 0x188 */
    uint8_t       RESERVED_11[4];
    __IO uint32_t RSFL; /**< Receive FIFO Section Full Threshold, offset: 0x190 */
    __IO uint32_t RSEM; /**< Receive FIFO Section Empty Threshold, offset: 0x194 */
    __IO uint32_t RAEM; /**< Receive FIFO Almost Empty Threshold, offset: 0x198 */
    __IO uint32_t RAFL; /**< Receive FIFO Almost Full Threshold, offset: 0x19C */
    __IO uint32_t TSEM; /**< Transmit FIFO Section Empty Threshold, offset: 0x1A0 */
    __IO uint32_t TAEM; /**< Transmit FIFO Almost Empty Threshold, offset: 0x1A4 */
    __IO uint32_t TAFL; /**< Transmit FIFO Almost Full Threshold, offset: 0x1A8 */
    __IO uint32_t TIPG; /**< Transmit Inter-Packet Gap, offset: 0x1AC */
    __IO uint32_t FTRL; /**< Frame Truncation Length, offset: 0x1B0 */
    uint8_t       RESERVED_12[12];
    __IO uint32_t TACC; /**< Transmit Accelerator Function Configuration, offset: 0x1C0 */
    __IO uint32_t RACC; /**< Receive Accelerator Function Configuration, offset: 0x1C4 */
    uint8_t       RESERVED_13[56];
    __I uint32_t RMON_T_DROP;      /**< Reserved Statistic Register, offset: 0x200 */
    __I uint32_t RMON_T_PACKETS;   /**< Tx Packet Count Statistic Register, offset: 0x204 */
    __I uint32_t RMON_T_BC_PKT;    /**< Tx Broadcast Packets Statistic Register, offset: 0x208 */
    __I uint32_t RMON_T_MC_PKT;    /**< Tx Multicast Packets Statistic Register, offset: 0x20C */
    __I uint32_t RMON_T_CRC_ALIGN; /**< Tx Packets with CRC/Align Error Statistic Register, offset: 0x210 */
    __I uint32_t RMON_T_UNDERSIZE; /**< Tx Packets Less Than Bytes and Good CRC Statistic Register, offset: 0x214 */
    __I uint32_t RMON_T_OVERSIZE;  /**< Tx Packets GT MAX_FL bytes and Good CRC Statistic Register, offset: 0x218 */
    __I uint32_t RMON_T_FRAG;      /**< Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register, offset: 0x21C */
    __I uint32_t RMON_T_JAB; /**< Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register, offset: 0x220 */
    __I uint32_t RMON_T_COL; /**< Tx Collision Count Statistic Register, offset: 0x224 */
    __I uint32_t RMON_T_P64; /**< Tx 64-Byte Packets Statistic Register, offset: 0x228 */
    __I uint32_t RMON_T_P65TO127;    /**< Tx 65- to 127-byte Packets Statistic Register, offset: 0x22C */
    __I uint32_t RMON_T_P128TO255;   /**< Tx 128- to 255-byte Packets Statistic Register, offset: 0x230 */
    __I uint32_t RMON_T_P256TO511;   /**< Tx 256- to 511-byte Packets Statistic Register, offset: 0x234 */
    __I uint32_t RMON_T_P512TO1023;  /**< Tx 512- to 1023-byte Packets Statistic Register, offset: 0x238 */
    __I uint32_t RMON_T_P1024TO2047; /**< Tx 1024- to 2047-byte Packets Statistic Register, offset: 0x23C */
    __I uint32_t RMON_T_P_GTE2048;   /**< Tx Packets Greater Than 2048 Bytes Statistic Register, offset: 0x240 */
    __I uint32_t RMON_T_OCTETS;      /**< Tx Octets Statistic Register, offset: 0x244 */
    __I uint32_t IEEE_T_DROP;        /**< Reserved Statistic Register, offset: 0x248 */
    __I uint32_t IEEE_T_FRAME_OK;    /**< Frames Transmitted OK Statistic Register, offset: 0x24C */
    __I uint32_t IEEE_T_1COL;        /**< Frames Transmitted with Single Collision Statistic Register, offset: 0x250 */
    __I uint32_t IEEE_T_MCOL;   /**< Frames Transmitted with Multiple Collisions Statistic Register, offset: 0x254 */
    __I uint32_t IEEE_T_DEF;    /**< Frames Transmitted after Deferral Delay Statistic Register, offset: 0x258 */
    __I uint32_t IEEE_T_LCOL;   /**< Frames Transmitted with Late Collision Statistic Register, offset: 0x25C */
    __I uint32_t IEEE_T_EXCOL;  /**< Frames Transmitted with Excessive Collisions Statistic Register, offset: 0x260 */
    __I uint32_t IEEE_T_MACERR; /**< Frames Transmitted with Tx FIFO Underrun Statistic Register, offset: 0x264 */
    __I uint32_t IEEE_T_CSERR;  /**< Frames Transmitted with Carrier Sense Error Statistic Register, offset: 0x268 */
    __I uint32_t IEEE_T_SQE;    /**< Reserved Statistic Register, offset: 0x26C */
    __I uint32_t IEEE_T_FDXFC;  /**< Flow Control Pause Frames Transmitted Statistic Register, offset: 0x270 */
    __I          uint32_t
                 IEEE_T_OCTETS_OK; /**< Octet Count for Frames Transmitted w/o Error Statistic Register, offset: 0x274 */
    uint8_t      RESERVED_14[12];
    __I uint32_t RMON_R_PACKETS;   /**< Rx Packet Count Statistic Register, offset: 0x284 */
    __I uint32_t RMON_R_BC_PKT;    /**< Rx Broadcast Packets Statistic Register, offset: 0x288 */
    __I uint32_t RMON_R_MC_PKT;    /**< Rx Multicast Packets Statistic Register, offset: 0x28C */
    __I uint32_t RMON_R_CRC_ALIGN; /**< Rx Packets with CRC/Align Error Statistic Register, offset: 0x290 */
    __I          uint32_t
                 RMON_R_UNDERSIZE; /**< Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register, offset: 0x294 */
    __I uint32_t RMON_R_OVERSIZE; /**< Rx Packets Greater Than MAX_FL and Good CRC Statistic Register, offset: 0x298 */
    __I uint32_t RMON_R_FRAG;     /**< Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register, offset: 0x29C */
    __I uint32_t RMON_R_JAB; /**< Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register, offset: 0x2A0 */
    __I uint32_t RMON_R_RESVD_0;     /**< Reserved Statistic Register, offset: 0x2A4 */
    __I uint32_t RMON_R_P64;         /**< Rx 64-Byte Packets Statistic Register, offset: 0x2A8 */
    __I uint32_t RMON_R_P65TO127;    /**< Rx 65- to 127-Byte Packets Statistic Register, offset: 0x2AC */
    __I uint32_t RMON_R_P128TO255;   /**< Rx 128- to 255-Byte Packets Statistic Register, offset: 0x2B0 */
    __I uint32_t RMON_R_P256TO511;   /**< Rx 256- to 511-Byte Packets Statistic Register, offset: 0x2B4 */
    __I uint32_t RMON_R_P512TO1023;  /**< Rx 512- to 1023-Byte Packets Statistic Register, offset: 0x2B8 */
    __I uint32_t RMON_R_P1024TO2047; /**< Rx 1024- to 2047-Byte Packets Statistic Register, offset: 0x2BC */
    __I uint32_t RMON_R_P_GTE2048;   /**< Rx Packets Greater than 2048 Bytes Statistic Register, offset: 0x2C0 */
    __I uint32_t RMON_R_OCTETS;      /**< Rx Octets Statistic Register, offset: 0x2C4 */
    __I uint32_t IEEE_R_DROP;        /**< Frames not Counted Correctly Statistic Register, offset: 0x2C8 */
    __I uint32_t IEEE_R_FRAME_OK;    /**< Frames Received OK Statistic Register, offset: 0x2CC */
    __I uint32_t IEEE_R_CRC;         /**< Frames Received with CRC Error Statistic Register, offset: 0x2D0 */
    __I uint32_t IEEE_R_ALIGN;       /**< Frames Received with Alignment Error Statistic Register, offset: 0x2D4 */
    __I uint32_t IEEE_R_MACERR;      /**< Receive FIFO Overflow Count Statistic Register, offset: 0x2D8 */
    __I uint32_t IEEE_R_FDXFC;       /**< Flow Control Pause Frames Received Statistic Register, offset: 0x2DC */
    __I          uint32_t
                 IEEE_R_OCTETS_OK; /**< Octet Count for Frames Received without Error Statistic Register, offset: 0x2E0 */
    uint8_t      RESERVED_15[284];
    __IO uint32_t ATCR;  /**< Adjustable Timer Control Register, offset: 0x400 */
    __IO uint32_t ATVR;  /**< Timer Value Register, offset: 0x404 */
    __IO uint32_t ATOFF; /**< Timer Offset Register, offset: 0x408 */
    __IO uint32_t ATPER; /**< Timer Period Register, offset: 0x40C */
    __IO uint32_t ATCOR; /**< Timer Correction Register, offset: 0x410 */
    __IO uint32_t ATINC; /**< Time-Stamping Clock Period Register, offset: 0x414 */
    __I uint32_t ATSTMP; /**< Timestamp of Last Transmitted Frame, offset: 0x418 */
    uint8_t      RESERVED_16[488];
    __IO uint32_t TGSR; /**< Timer Global Status Register, offset: 0x604 */
    struct
    {                       /* offset: 0x608, array step: 0x8 */
        __IO uint32_t TCSR; /**< Timer Control Status Register, array offset: 0x608, array step: 0x8 */
        __IO uint32_t TCCR; /**< Timer Compare Capture Register, array offset: 0x60C, array step: 0x8 */
    } CHANNEL[ENET_CHANNEL_COUNT];
} ENET_Type, *ENET_MemMapPtr;

/** Number of instances of the ENET module. */
#    define ENET_INSTANCE_COUNT (1u)

