OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* ENET - Peripheral instance base addresses */
/** Peripheral ENET base address */
#    define ENET_BASE (0x40079000u)
/** Peripheral ENET base pointer */
#    define ENET ((ENET_Type*) ENET_BASE)
/** Array initializer of ENET peripheral base addresses */
#    define ENET_BASE_ADDRS \
        {                   \
            ENET_BASE       \
        }
/** Array initializer of ENET peripheral base pointers */
#    define ENET_BASE_PTRS \
        {                  \
            ENET           \
        }
/** Number of interrupt vector arrays for the ENET module. */
#    define ENET_IRQS_ARR_COUNT (6u)
/** Number of interrupt channels for the TIMER type of ENET module. */
#    define ENET_TIMER_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the TX type of ENET module. */
#    define ENET_TX_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the RX type of ENET module. */
#    define ENET_RX_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the ERR type of ENET module. */
#    define ENET_ERR_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the STOP type of ENET module. */
#    define ENET_STOP_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the WAKE type of ENET module. */
#    define ENET_WAKE_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the ENET peripheral type */
#    define ENET_TIMER_IRQS \
        {                   \
            ENET_TIMER_IRQn \
        }
#    define ENET_TX_IRQS \
        {                \
            ENET_TX_IRQn \
        }
#    define ENET_RX_IRQS \
        {                \
            ENET_RX_IRQn \
        }
#    define ENET_ERR_IRQS \
        {                 \
            ENET_ERR_IRQn \
        }
#    define ENET_STOP_IRQS \
        {                  \
            ENET_STOP_IRQn \
        }
#    define ENET_WAKE_IRQS \
        {                  \
            ENET_WAKE_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- ENET Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENET_Register_Masks ENET Register Masks
 * @{
 */

/* EIR Bit Fields */
#    define ENET_EIR_TS_TIMER_MASK 0x8000u
#    define ENET_EIR_TS_TIMER_SHIFT 15u
#    define ENET_EIR_TS_TIMER_WIDTH 1u
#    define ENET_EIR_TS_TIMER(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_TS_TIMER_SHIFT)) & ENET_EIR_TS_TIMER_MASK)
#    define ENET_EIR_TS_AVAIL_MASK 0x10000u
#    define ENET_EIR_TS_AVAIL_SHIFT 16u
#    define ENET_EIR_TS_AVAIL_WIDTH 1u
#    define ENET_EIR_TS_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_TS_AVAIL_SHIFT)) & ENET_EIR_TS_AVAIL_MASK)
#    define ENET_EIR_WAKEUP_MASK 0x20000u
#    define ENET_EIR_WAKEUP_SHIFT 17u
#    define ENET_EIR_WAKEUP_WIDTH 1u
#    define ENET_EIR_WAKEUP(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_WAKEUP_SHIFT)) & ENET_EIR_WAKEUP_MASK)
#    define ENET_EIR_PLR_MASK 0x40000u
#    define ENET_EIR_PLR_SHIFT 18u
#    define ENET_EIR_PLR_WIDTH 1u
#    define ENET_EIR_PLR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_PLR_SHIFT)) & ENET_EIR_PLR_MASK)
#    define ENET_EIR_UN_MASK 0x80000u
#    define ENET_EIR_UN_SHIFT 19u
#    define ENET_EIR_UN_WIDTH 1u
#    define ENET_EIR_UN(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_UN_SHIFT)) & ENET_EIR_UN_MASK)
#    define ENET_EIR_RL_MASK 0x100000u
#    define ENET_EIR_RL_SHIFT 20u
#    define ENET_EIR_RL_WIDTH 1u
#    define ENET_EIR_RL(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_RL_SHIFT)) & ENET_EIR_RL_MASK)
#    define ENET_EIR_LC_MASK 0x200000u
#    define ENET_EIR_LC_SHIFT 21u
#    define ENET_EIR_LC_WIDTH 1u
#    define ENET_EIR_LC(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_LC_SHIFT)) & ENET_EIR_LC_MASK)
#    define ENET_EIR_EBERR_MASK 0x400000u
#    define ENET_EIR_EBERR_SHIFT 22u
#    define ENET_EIR_EBERR_WIDTH 1u
#    define ENET_EIR_EBERR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_EBERR_SHIFT)) & ENET_EIR_EBERR_MASK)
#    define ENET_EIR_MII_MASK 0x800000u
#    define ENET_EIR_MII_SHIFT 23u
#    define ENET_EIR_MII_WIDTH 1u
#    define ENET_EIR_MII(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_MII_SHIFT)) & ENET_EIR_MII_MASK)
#    define ENET_EIR_RXB_MASK 0x1000000u
#    define ENET_EIR_RXB_SHIFT 24u
#    define ENET_EIR_RXB_WIDTH 1u
#    define ENET_EIR_RXB(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_RXB_SHIFT)) & ENET_EIR_RXB_MASK)
#    define ENET_EIR_RXF_MASK 0x2000000u
#    define ENET_EIR_RXF_SHIFT 25u
#    define ENET_EIR_RXF_WIDTH 1u
#    define ENET_EIR_RXF(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_RXF_SHIFT)) & ENET_EIR_RXF_MASK)
#    define ENET_EIR_TXB_MASK 0x4000000u
#    define ENET_EIR_TXB_SHIFT 26u
#    define ENET_EIR_TXB_WIDTH 1u
#    define ENET_EIR_TXB(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_TXB_SHIFT)) & ENET_EIR_TXB_MASK)
#    define ENET_EIR_TXF_MASK 0x8000000u
#    define ENET_EIR_TXF_SHIFT 27u
#    define ENET_EIR_TXF_WIDTH 1u
#    define ENET_EIR_TXF(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_TXF_SHIFT)) & ENET_EIR_TXF_MASK)
#    define ENET_EIR_GRA_MASK 0x10000000u
#    define ENET_EIR_GRA_SHIFT 28u
#    define ENET_EIR_GRA_WIDTH 1u
#    define ENET_EIR_GRA(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_GRA_SHIFT)) & ENET_EIR_GRA_MASK)
#    define ENET_EIR_BABT_MASK 0x20000000u
#    define ENET_EIR_BABT_SHIFT 29u
#    define ENET_EIR_BABT_WIDTH 1u
#    define ENET_EIR_BABT(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_BABT_SHIFT)) & ENET_EIR_BABT_MASK)
#    define ENET_EIR_BABR_MASK 0x40000000u
#    define ENET_EIR_BABR_SHIFT 30u
#    define ENET_EIR_BABR_WIDTH 1u
#    define ENET_EIR_BABR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIR_BABR_SHIFT)) & ENET_EIR_BABR_MASK)
/* EIMR Bit Fields */
#    define ENET_EIMR_TS_TIMER_MASK 0x8000u
#    define ENET_EIMR_TS_TIMER_SHIFT 15u
#    define ENET_EIMR_TS_TIMER_WIDTH 1u
#    define ENET_EIMR_TS_TIMER(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_TS_TIMER_SHIFT)) & ENET_EIMR_TS_TIMER_MASK)
#    define ENET_EIMR_TS_AVAIL_MASK 0x10000u
#    define ENET_EIMR_TS_AVAIL_SHIFT 16u
#    define ENET_EIMR_TS_AVAIL_WIDTH 1u
#    define ENET_EIMR_TS_AVAIL(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_TS_AVAIL_SHIFT)) & ENET_EIMR_TS_AVAIL_MASK)
#    define ENET_EIMR_WAKEUP_MASK 0x20000u
#    define ENET_EIMR_WAKEUP_SHIFT 17u
#    define ENET_EIMR_WAKEUP_WIDTH 1u
#    define ENET_EIMR_WAKEUP(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_WAKEUP_SHIFT)) & ENET_EIMR_WAKEUP_MASK)
#    define ENET_EIMR_PLR_MASK 0x40000u
#    define ENET_EIMR_PLR_SHIFT 18u
#    define ENET_EIMR_PLR_WIDTH 1u
#    define ENET_EIMR_PLR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_PLR_SHIFT)) & ENET_EIMR_PLR_MASK)
#    define ENET_EIMR_UN_MASK 0x80000u
#    define ENET_EIMR_UN_SHIFT 19u
#    define ENET_EIMR_UN_WIDTH 1u
#    define ENET_EIMR_UN(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_UN_SHIFT)) & ENET_EIMR_UN_MASK)
#    define ENET_EIMR_RL_MASK 0x100000u
#    define ENET_EIMR_RL_SHIFT 20u
#    define ENET_EIMR_RL_WIDTH 1u
#    define ENET_EIMR_RL(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_RL_SHIFT)) & ENET_EIMR_RL_MASK)
#    define ENET_EIMR_LC_MASK 0x200000u
#    define ENET_EIMR_LC_SHIFT 21u
#    define ENET_EIMR_LC_WIDTH 1u
#    define ENET_EIMR_LC(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_LC_SHIFT)) & ENET_EIMR_LC_MASK)
#    define ENET_EIMR_EBERR_MASK 0x400000u
#    define ENET_EIMR_EBERR_SHIFT 22u
#    define ENET_EIMR_EBERR_WIDTH 1u
#    define ENET_EIMR_EBERR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_EBERR_SHIFT)) & ENET_EIMR_EBERR_MASK)
#    define ENET_EIMR_MII_MASK 0x800000u
#    define ENET_EIMR_MII_SHIFT 23u
#    define ENET_EIMR_MII_WIDTH 1u
#    define ENET_EIMR_MII(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_MII_SHIFT)) & ENET_EIMR_MII_MASK)
#    define ENET_EIMR_RXB_MASK 0x1000000u
#    define ENET_EIMR_RXB_SHIFT 24u
#    define ENET_EIMR_RXB_WIDTH 1u
#    define ENET_EIMR_RXB(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_RXB_SHIFT)) & ENET_EIMR_RXB_MASK)
#    define ENET_EIMR_RXF_MASK 0x2000000u
#    define ENET_EIMR_RXF_SHIFT 25u
#    define ENET_EIMR_RXF_WIDTH 1u
#    define ENET_EIMR_RXF(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_RXF_SHIFT)) & ENET_EIMR_RXF_MASK)
#    define ENET_EIMR_TXB_MASK 0x4000000u
#    define ENET_EIMR_TXB_SHIFT 26u
#    define ENET_EIMR_TXB_WIDTH 1u
#    define ENET_EIMR_TXB(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_TXB_SHIFT)) & ENET_EIMR_TXB_MASK)
#    define ENET_EIMR_TXF_MASK 0x8000000u
#    define ENET_EIMR_TXF_SHIFT 27u
#    define ENET_EIMR_TXF_WIDTH 1u
#    define ENET_EIMR_TXF(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_TXF_SHIFT)) & ENET_EIMR_TXF_MASK)
#    define ENET_EIMR_GRA_MASK 0x10000000u
#    define ENET_EIMR_GRA_SHIFT 28u
#    define ENET_EIMR_GRA_WIDTH 1u
#    define ENET_EIMR_GRA(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_GRA_SHIFT)) & ENET_EIMR_GRA_MASK)
#    define ENET_EIMR_BABT_MASK 0x20000000u
#    define ENET_EIMR_BABT_SHIFT 29u
#    define ENET_EIMR_BABT_WIDTH 1u
#    define ENET_EIMR_BABT(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_BABT_SHIFT)) & ENET_EIMR_BABT_MASK)
#    define ENET_EIMR_BABR_MASK 0x40000000u
#    define ENET_EIMR_BABR_SHIFT 30u
#    define ENET_EIMR_BABR_WIDTH 1u
#    define ENET_EIMR_BABR(x) (((uint32_t)(((uint32_t)(x)) << ENET_EIMR_BABR_SHIFT)) & ENET_EIMR_BABR_MASK)
/* RDAR Bit Fields */
#    define ENET_RDAR_RDAR_MASK 0x1000000u
#    define ENET_RDAR_RDAR_SHIFT 24u
#    define ENET_RDAR_RDAR_WIDTH 1u
#    define ENET_RDAR_RDAR(x) (((uint32_t)(((uint32_t)(x)) << ENET_RDAR_RDAR_SHIFT)) & ENET_RDAR_RDAR_MASK)
/* TDAR Bit Fields */
#    define ENET_TDAR_TDAR_MASK 0x1000000u
#    define ENET_TDAR_TDAR_SHIFT 24u
#    define ENET_TDAR_TDAR_WIDTH 1u
#    define ENET_TDAR_TDAR(x) (((uint32_t)(((uint32_t)(x)) << ENET_TDAR_TDAR_SHIFT)) & ENET_TDAR_TDAR_MASK)
/* ECR Bit Fields */
#    define ENET_ECR_RESET_MASK 0x1u
#    define ENET_ECR_RESET_SHIFT 0u
#    define ENET_ECR_RESET_WIDTH 1u
#    define ENET_ECR_RESET(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_RESET_SHIFT)) & ENET_ECR_RESET_MASK)
#    define ENET_ECR_ETHEREN_MASK 0x2u
#    define ENET_ECR_ETHEREN_SHIFT 1u
#    define ENET_ECR_ETHEREN_WIDTH 1u
#    define ENET_ECR_ETHEREN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_ETHEREN_SHIFT)) & ENET_ECR_ETHEREN_MASK)
#    define ENET_ECR_MAGICEN_MASK 0x4u
#    define ENET_ECR_MAGICEN_SHIFT 2u
#    define ENET_ECR_MAGICEN_WIDTH 1u
#    define ENET_ECR_MAGICEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_MAGICEN_SHIFT)) & ENET_ECR_MAGICEN_MASK)
#    define ENET_ECR_SLEEP_MASK 0x8u
#    define ENET_ECR_SLEEP_SHIFT 3u
#    define ENET_ECR_SLEEP_WIDTH 1u
#    define ENET_ECR_SLEEP(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_SLEEP_SHIFT)) & ENET_ECR_SLEEP_MASK)
#    define ENET_ECR_EN1588_MASK 0x10u
#    define ENET_ECR_EN1588_SHIFT 4u
#    define ENET_ECR_EN1588_WIDTH 1u
#    define ENET_ECR_EN1588(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_EN1588_SHIFT)) & ENET_ECR_EN1588_MASK)
#    define ENET_ECR_DBGEN_MASK 0x40u
#    define ENET_ECR_DBGEN_SHIFT 6u
#    define ENET_ECR_DBGEN_WIDTH 1u
#    define ENET_ECR_DBGEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_DBGEN_SHIFT)) & ENET_ECR_DBGEN_MASK)
#    define ENET_ECR_DBSWP_MASK 0x100u
#    define ENET_ECR_DBSWP_SHIFT 8u
#    define ENET_ECR_DBSWP_WIDTH 1u
#    define ENET_ECR_DBSWP(x) (((uint32_t)(((uint32_t)(x)) << ENET_ECR_DBSWP_SHIFT)) & ENET_ECR_DBSWP_MASK)
/* MMFR Bit Fields */
#    define ENET_MMFR_DATA_MASK 0xFFFFu
#    define ENET_MMFR_DATA_SHIFT 0u
#    define ENET_MMFR_DATA_WIDTH 16u
#    define ENET_MMFR_DATA(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_DATA_SHIFT)) & ENET_MMFR_DATA_MASK)
#    define ENET_MMFR_TA_MASK 0x30000u
#    define ENET_MMFR_TA_SHIFT 16u
#    define ENET_MMFR_TA_WIDTH 2u
#    define ENET_MMFR_TA(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_TA_SHIFT)) & ENET_MMFR_TA_MASK)
#    define ENET_MMFR_RA_MASK 0x7C0000u
#    define ENET_MMFR_RA_SHIFT 18u
#    define ENET_MMFR_RA_WIDTH 5u
#    define ENET_MMFR_RA(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_RA_SHIFT)) & ENET_MMFR_RA_MASK)
#    define ENET_MMFR_PA_MASK 0xF800000u
#    define ENET_MMFR_PA_SHIFT 23u
#    define ENET_MMFR_PA_WIDTH 5u
#    define ENET_MMFR_PA(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_PA_SHIFT)) & ENET_MMFR_PA_MASK)
#    define ENET_MMFR_OP_MASK 0x30000000u
#    define ENET_MMFR_OP_SHIFT 28u
#    define ENET_MMFR_OP_WIDTH 2u
#    define ENET_MMFR_OP(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_OP_SHIFT)) & ENET_MMFR_OP_MASK)
#    define ENET_MMFR_ST_MASK 0xC0000000u
#    define ENET_MMFR_ST_SHIFT 30u
#    define ENET_MMFR_ST_WIDTH 2u
#    define ENET_MMFR_ST(x) (((uint32_t)(((uint32_t)(x)) << ENET_MMFR_ST_SHIFT)) & ENET_MMFR_ST_MASK)
/* MSCR Bit Fields */
#    define ENET_MSCR_MII_SPEED_MASK 0x7Eu
#    define ENET_MSCR_MII_SPEED_SHIFT 1u
#    define ENET_MSCR_MII_SPEED_WIDTH 6u
#    define ENET_MSCR_MII_SPEED(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_MSCR_MII_SPEED_SHIFT)) & ENET_MSCR_MII_SPEED_MASK)
#    define ENET_MSCR_DIS_PRE_MASK 0x80u
#    define ENET_MSCR_DIS_PRE_SHIFT 7u
#    define ENET_MSCR_DIS_PRE_WIDTH 1u
#    define ENET_MSCR_DIS_PRE(x) (((uint32_t)(((uint32_t)(x)) << ENET_MSCR_DIS_PRE_SHIFT)) & ENET_MSCR_DIS_PRE_MASK)
#    define ENET_MSCR_HOLDTIME_MASK 0x700u
#    define ENET_MSCR_HOLDTIME_SHIFT 8u
#    define ENET_MSCR_HOLDTIME_WIDTH 3u
#    define ENET_MSCR_HOLDTIME(x) (((uint32_t)(((uint32_t)(x)) << ENET_MSCR_HOLDTIME_SHIFT)) & ENET_MSCR_HOLDTIME_MASK)
/* MIBC Bit Fields */
#    define ENET_MIBC_MIB_CLEAR_MASK 0x20000000u
#    define ENET_MIBC_MIB_CLEAR_SHIFT 29u
#    define ENET_MIBC_MIB_CLEAR_WIDTH 1u
#    define ENET_MIBC_MIB_CLEAR(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_MIBC_MIB_CLEAR_SHIFT)) & ENET_MIBC_MIB_CLEAR_MASK)
#    define ENET_MIBC_MIB_IDLE_MASK 0x40000000u
#    define ENET_MIBC_MIB_IDLE_SHIFT 30u
#    define ENET_MIBC_MIB_IDLE_WIDTH 1u
#    define ENET_MIBC_MIB_IDLE(x) (((uint32_t)(((uint32_t)(x)) << ENET_MIBC_MIB_IDLE_SHIFT)) & ENET_MIBC_MIB_IDLE_MASK)
#    define ENET_MIBC_MIB_DIS_MASK 0x80000000u
#    define ENET_MIBC_MIB_DIS_SHIFT 31u
#    define ENET_MIBC_MIB_DIS_WIDTH 1u
#    define ENET_MIBC_MIB_DIS(x) (((uint32_t)(((uint32_t)(x)) << ENET_MIBC_MIB_DIS_SHIFT)) & ENET_MIBC_MIB_DIS_MASK)
/* RCR Bit Fields */
#    define ENET_RCR_LOOP_MASK 0x1u
#    define ENET_RCR_LOOP_SHIFT 0u
#    define ENET_RCR_LOOP_WIDTH 1u
#    define ENET_RCR_LOOP(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_LOOP_SHIFT)) & ENET_RCR_LOOP_MASK)
#    define ENET_RCR_DRT_MASK 0x2u
#    define ENET_RCR_DRT_SHIFT 1u
#    define ENET_RCR_DRT_WIDTH 1u
#    define ENET_RCR_DRT(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_DRT_SHIFT)) & ENET_RCR_DRT_MASK)
#    define ENET_RCR_MII_MODE_MASK 0x4u
#    define ENET_RCR_MII_MODE_SHIFT 2u
#    define ENET_RCR_MII_MODE_WIDTH 1u
#    define ENET_RCR_MII_MODE(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_MII_MODE_SHIFT)) & ENET_RCR_MII_MODE_MASK)
#    define ENET_RCR_PROM_MASK 0x8u
#    define ENET_RCR_PROM_SHIFT 3u
#    define ENET_RCR_PROM_WIDTH 1u
#    define ENET_RCR_PROM(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_PROM_SHIFT)) & ENET_RCR_PROM_MASK)
#    define ENET_RCR_BC_REJ_MASK 0x10u
#    define ENET_RCR_BC_REJ_SHIFT 4u
#    define ENET_RCR_BC_REJ_WIDTH 1u
#    define ENET_RCR_BC_REJ(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_BC_REJ_SHIFT)) & ENET_RCR_BC_REJ_MASK)
#    define ENET_RCR_FCE_MASK 0x20u
#    define ENET_RCR_FCE_SHIFT 5u
#    define ENET_RCR_FCE_WIDTH 1u
#    define ENET_RCR_FCE(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_FCE_SHIFT)) & ENET_RCR_FCE_MASK)
#    define ENET_RCR_RMII_MODE_MASK 0x100u
#    define ENET_RCR_RMII_MODE_SHIFT 8u
#    define ENET_RCR_RMII_MODE_WIDTH 1u
#    define ENET_RCR_RMII_MODE(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_RMII_MODE_SHIFT)) & ENET_RCR_RMII_MODE_MASK)
#    define ENET_RCR_RMII_10T_MASK 0x200u
#    define ENET_RCR_RMII_10T_SHIFT 9u
#    define ENET_RCR_RMII_10T_WIDTH 1u
#    define ENET_RCR_RMII_10T(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_RMII_10T_SHIFT)) & ENET_RCR_RMII_10T_MASK)
#    define ENET_RCR_PADEN_MASK 0x1000u
#    define ENET_RCR_PADEN_SHIFT 12u
#    define ENET_RCR_PADEN_WIDTH 1u
#    define ENET_RCR_PADEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_PADEN_SHIFT)) & ENET_RCR_PADEN_MASK)
#    define ENET_RCR_PAUFWD_MASK 0x2000u
#    define ENET_RCR_PAUFWD_SHIFT 13u
#    define ENET_RCR_PAUFWD_WIDTH 1u
#    define ENET_RCR_PAUFWD(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_PAUFWD_SHIFT)) & ENET_RCR_PAUFWD_MASK)
#    define ENET_RCR_CRCFWD_MASK 0x4000u
#    define ENET_RCR_CRCFWD_SHIFT 14u
#    define ENET_RCR_CRCFWD_WIDTH 1u
#    define ENET_RCR_CRCFWD(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_CRCFWD_SHIFT)) & ENET_RCR_CRCFWD_MASK)
#    define ENET_RCR_CFEN_MASK 0x8000u
#    define ENET_RCR_CFEN_SHIFT 15u
#    define ENET_RCR_CFEN_WIDTH 1u
#    define ENET_RCR_CFEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_CFEN_SHIFT)) & ENET_RCR_CFEN_MASK)
#    define ENET_RCR_MAX_FL_MASK 0x3FFF0000u
#    define ENET_RCR_MAX_FL_SHIFT 16u
#    define ENET_RCR_MAX_FL_WIDTH 14u
#    define ENET_RCR_MAX_FL(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_MAX_FL_SHIFT)) & ENET_RCR_MAX_FL_MASK)
#    define ENET_RCR_NLC_MASK 0x40000000u
#    define ENET_RCR_NLC_SHIFT 30u
#    define ENET_RCR_NLC_WIDTH 1u
#    define ENET_RCR_NLC(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_NLC_SHIFT)) & ENET_RCR_NLC_MASK)
#    define ENET_RCR_GRS_MASK 0x80000000u
#    define ENET_RCR_GRS_SHIFT 31u
#    define ENET_RCR_GRS_WIDTH 1u
#    define ENET_RCR_GRS(x) (((uint32_t)(((uint32_t)(x)) << ENET_RCR_GRS_SHIFT)) & ENET_RCR_GRS_MASK)
/* TCR Bit Fields */
#    define ENET_TCR_GTS_MASK 0x1u
#    define ENET_TCR_GTS_SHIFT 0u
#    define ENET_TCR_GTS_WIDTH 1u
#    define ENET_TCR_GTS(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_GTS_SHIFT)) & ENET_TCR_GTS_MASK)
#    define ENET_TCR_FDEN_MASK 0x4u
#    define ENET_TCR_FDEN_SHIFT 2u
#    define ENET_TCR_FDEN_WIDTH 1u
#    define ENET_TCR_FDEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_FDEN_SHIFT)) & ENET_TCR_FDEN_MASK)
#    define ENET_TCR_TFC_PAUSE_MASK 0x8u
#    define ENET_TCR_TFC_PAUSE_SHIFT 3u
#    define ENET_TCR_TFC_PAUSE_WIDTH 1u
#    define ENET_TCR_TFC_PAUSE(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_TFC_PAUSE_SHIFT)) & ENET_TCR_TFC_PAUSE_MASK)
#    define ENET_TCR_RFC_PAUSE_MASK 0x10u
#    define ENET_TCR_RFC_PAUSE_SHIFT 4u
#    define ENET_TCR_RFC_PAUSE_WIDTH 1u
#    define ENET_TCR_RFC_PAUSE(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_RFC_PAUSE_SHIFT)) & ENET_TCR_RFC_PAUSE_MASK)
#    define ENET_TCR_ADDSEL_MASK 0xE0u
#    define ENET_TCR_ADDSEL_SHIFT 5u
#    define ENET_TCR_ADDSEL_WIDTH 3u
#    define ENET_TCR_ADDSEL(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_ADDSEL_SHIFT)) & ENET_TCR_ADDSEL_MASK)
#    define ENET_TCR_ADDINS_MASK 0x100u
#    define ENET_TCR_ADDINS_SHIFT 8u
#    define ENET_TCR_ADDINS_WIDTH 1u
#    define ENET_TCR_ADDINS(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_ADDINS_SHIFT)) & ENET_TCR_ADDINS_MASK)
#    define ENET_TCR_CRCFWD_MASK 0x200u
#    define ENET_TCR_CRCFWD_SHIFT 9u
#    define ENET_TCR_CRCFWD_WIDTH 1u
#    define ENET_TCR_CRCFWD(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCR_CRCFWD_SHIFT)) & ENET_TCR_CRCFWD_MASK)
/* PALR Bit Fields */
#    define ENET_PALR_PADDR1_MASK 0xFFFFFFFFu
#    define ENET_PALR_PADDR1_SHIFT 0u
#    define ENET_PALR_PADDR1_WIDTH 32u
#    define ENET_PALR_PADDR1(x) (((uint32_t)(((uint32_t)(x)) << ENET_PALR_PADDR1_SHIFT)) & ENET_PALR_PADDR1_MASK)
/* PAUR Bit Fields */
#    define ENET_PAUR_TYPE_MASK 0xFFFFu
#    define ENET_PAUR_TYPE_SHIFT 0u
#    define ENET_PAUR_TYPE_WIDTH 16u
#    define ENET_PAUR_TYPE(x) (((uint32_t)(((uint32_t)(x)) << ENET_PAUR_TYPE_SHIFT)) & ENET_PAUR_TYPE_MASK)
#    define ENET_PAUR_PADDR2_MASK 0xFFFF0000u
#    define ENET_PAUR_PADDR2_SHIFT 16u
#    define ENET_PAUR_PADDR2_WIDTH 16u
#    define ENET_PAUR_PADDR2(x) (((uint32_t)(((uint32_t)(x)) << ENET_PAUR_PADDR2_SHIFT)) & ENET_PAUR_PADDR2_MASK)
/* OPD Bit Fields */
#    define ENET_OPD_PAUSE_DUR_MASK 0xFFFFu
#    define ENET_OPD_PAUSE_DUR_SHIFT 0u
#    define ENET_OPD_PAUSE_DUR_WIDTH 16u
#    define ENET_OPD_PAUSE_DUR(x) (((uint32_t)(((uint32_t)(x)) << ENET_OPD_PAUSE_DUR_SHIFT)) & ENET_OPD_PAUSE_DUR_MASK)
#    define ENET_OPD_OPCODE_MASK 0xFFFF0000u
#    define ENET_OPD_OPCODE_SHIFT 16u
#    define ENET_OPD_OPCODE_WIDTH 16u
#    define ENET_OPD_OPCODE(x) (((uint32_t)(((uint32_t)(x)) << ENET_OPD_OPCODE_SHIFT)) & ENET_OPD_OPCODE_MASK)
/* IAUR Bit Fields */
#    define ENET_IAUR_IADDR1_MASK 0xFFFFFFFFu
#    define ENET_IAUR_IADDR1_SHIFT 0u
#    define ENET_IAUR_IADDR1_WIDTH 32u
#    define ENET_IAUR_IADDR1(x) (((uint32_t)(((uint32_t)(x)) << ENET_IAUR_IADDR1_SHIFT)) & ENET_IAUR_IADDR1_MASK)
/* IALR Bit Fields */
#    define ENET_IALR_IADDR2_MASK 0xFFFFFFFFu
#    define ENET_IALR_IADDR2_SHIFT 0u
#    define ENET_IALR_IADDR2_WIDTH 32u
#    define ENET_IALR_IADDR2(x) (((uint32_t)(((uint32_t)(x)) << ENET_IALR_IADDR2_SHIFT)) & ENET_IALR_IADDR2_MASK)
/* GAUR Bit Fields */
#    define ENET_GAUR_GADDR1_MASK 0xFFFFFFFFu
#    define ENET_GAUR_GADDR1_SHIFT 0u
#    define ENET_GAUR_GADDR1_WIDTH 32u
#    define ENET_GAUR_GADDR1(x) (((uint32_t)(((uint32_t)(x)) << ENET_GAUR_GADDR1_SHIFT)) & ENET_GAUR_GADDR1_MASK)
/* GALR Bit Fields */
#    define ENET_GALR_GADDR2_MASK 0xFFFFFFFFu
#    define ENET_GALR_GADDR2_SHIFT 0u
#    define ENET_GALR_GADDR2_WIDTH 32u
#    define ENET_GALR_GADDR2(x) (((uint32_t)(((uint32_t)(x)) << ENET_GALR_GADDR2_SHIFT)) & ENET_GALR_GADDR2_MASK)
/* TFWR Bit Fields */
#    define ENET_TFWR_TFWR_MASK 0x3Fu
#    define ENET_TFWR_TFWR_SHIFT 0u
#    define ENET_TFWR_TFWR_WIDTH 6u
#    define ENET_TFWR_TFWR(x) (((uint32_t)(((uint32_t)(x)) << ENET_TFWR_TFWR_SHIFT)) & ENET_TFWR_TFWR_MASK)
#    define ENET_TFWR_STRFWD_MASK 0x100u
#    define ENET_TFWR_STRFWD_SHIFT 8u
#    define ENET_TFWR_STRFWD_WIDTH 1u
#    define ENET_TFWR_STRFWD(x) (((uint32_t)(((uint32_t)(x)) << ENET_TFWR_STRFWD_SHIFT)) & ENET_TFWR_STRFWD_MASK)
/* RDSR Bit Fields */
#    define ENET_RDSR_R_DES_START_MASK 0xFFFFFFF8u
#    define ENET_RDSR_R_DES_START_SHIFT 3u
#    define ENET_RDSR_R_DES_START_WIDTH 29u
#    define ENET_RDSR_R_DES_START(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RDSR_R_DES_START_SHIFT)) & ENET_RDSR_R_DES_START_MASK)
/* TDSR Bit Fields */
#    define ENET_TDSR_X_DES_START_MASK 0xFFFFFFF8u
#    define ENET_TDSR_X_DES_START_SHIFT 3u
#    define ENET_TDSR_X_DES_START_WIDTH 29u
#    define ENET_TDSR_X_DES_START(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_TDSR_X_DES_START_SHIFT)) & ENET_TDSR_X_DES_START_MASK)
/* MRBR Bit Fields */
#    define ENET_MRBR_R_BUF_SIZE_MASK 0x3FF0u
#    define ENET_MRBR_R_BUF_SIZE_SHIFT 4u
#    define ENET_MRBR_R_BUF_SIZE_WIDTH 10u
#    define ENET_MRBR_R_BUF_SIZE(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_MRBR_R_BUF_SIZE_SHIFT)) & ENET_MRBR_R_BUF_SIZE_MASK)
/* RSFL Bit Fields */
#    define ENET_RSFL_RX_SECTION_FULL_MASK 0xFFu
#    define ENET_RSFL_RX_SECTION_FULL_SHIFT 0u
#    define ENET_RSFL_RX_SECTION_FULL_WIDTH 8u
#    define ENET_RSFL_RX_SECTION_FULL(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RSFL_RX_SECTION_FULL_SHIFT)) & ENET_RSFL_RX_SECTION_FULL_MASK)
/* RSEM Bit Fields */
#    define ENET_RSEM_RX_SECTION_EMPTY_MASK 0xFFu
#    define ENET_RSEM_RX_SECTION_EMPTY_SHIFT 0u
#    define ENET_RSEM_RX_SECTION_EMPTY_WIDTH 8u
#    define ENET_RSEM_RX_SECTION_EMPTY(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RSEM_RX_SECTION_EMPTY_SHIFT)) & ENET_RSEM_RX_SECTION_EMPTY_MASK)
#    define ENET_RSEM_STAT_SECTION_EMPTY_MASK 0x1F0000u
#    define ENET_RSEM_STAT_SECTION_EMPTY_SHIFT 16u
#    define ENET_RSEM_STAT_SECTION_EMPTY_WIDTH 5u
#    define ENET_RSEM_STAT_SECTION_EMPTY(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RSEM_STAT_SECTION_EMPTY_SHIFT)) & ENET_RSEM_STAT_SECTION_EMPTY_MASK)
/* RAEM Bit Fields */
#    define ENET_RAEM_RX_ALMOST_EMPTY_MASK 0xFFu
#    define ENET_RAEM_RX_ALMOST_EMPTY_SHIFT 0u
#    define ENET_RAEM_RX_ALMOST_EMPTY_WIDTH 8u
#    define ENET_RAEM_RX_ALMOST_EMPTY(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RAEM_RX_ALMOST_EMPTY_SHIFT)) & ENET_RAEM_RX_ALMOST_EMPTY_MASK)
/* RAFL Bit Fields */
