OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define ENET_RAFL_RX_ALMOST_FULL_MASK 0xFFu
#    define ENET_RAFL_RX_ALMOST_FULL_SHIFT 0u
#    define ENET_RAFL_RX_ALMOST_FULL_WIDTH 8u
#    define ENET_RAFL_RX_ALMOST_FULL(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RAFL_RX_ALMOST_FULL_SHIFT)) & ENET_RAFL_RX_ALMOST_FULL_MASK)
/* TSEM Bit Fields */
#    define ENET_TSEM_TX_SECTION_EMPTY_MASK 0xFFu
#    define ENET_TSEM_TX_SECTION_EMPTY_SHIFT 0u
#    define ENET_TSEM_TX_SECTION_EMPTY_WIDTH 8u
#    define ENET_TSEM_TX_SECTION_EMPTY(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_TSEM_TX_SECTION_EMPTY_SHIFT)) & ENET_TSEM_TX_SECTION_EMPTY_MASK)
/* TAEM Bit Fields */
#    define ENET_TAEM_TX_ALMOST_EMPTY_MASK 0xFFu
#    define ENET_TAEM_TX_ALMOST_EMPTY_SHIFT 0u
#    define ENET_TAEM_TX_ALMOST_EMPTY_WIDTH 8u
#    define ENET_TAEM_TX_ALMOST_EMPTY(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_TAEM_TX_ALMOST_EMPTY_SHIFT)) & ENET_TAEM_TX_ALMOST_EMPTY_MASK)
/* TAFL Bit Fields */
#    define ENET_TAFL_TX_ALMOST_FULL_MASK 0xFFu
#    define ENET_TAFL_TX_ALMOST_FULL_SHIFT 0u
#    define ENET_TAFL_TX_ALMOST_FULL_WIDTH 8u
#    define ENET_TAFL_TX_ALMOST_FULL(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_TAFL_TX_ALMOST_FULL_SHIFT)) & ENET_TAFL_TX_ALMOST_FULL_MASK)
/* TIPG Bit Fields */
#    define ENET_TIPG_IPG_MASK 0x1Fu
#    define ENET_TIPG_IPG_SHIFT 0u
#    define ENET_TIPG_IPG_WIDTH 5u
#    define ENET_TIPG_IPG(x) (((uint32_t)(((uint32_t)(x)) << ENET_TIPG_IPG_SHIFT)) & ENET_TIPG_IPG_MASK)
/* FTRL Bit Fields */
#    define ENET_FTRL_TRUNC_FL_MASK 0x3FFFu
#    define ENET_FTRL_TRUNC_FL_SHIFT 0u
#    define ENET_FTRL_TRUNC_FL_WIDTH 14u
#    define ENET_FTRL_TRUNC_FL(x) (((uint32_t)(((uint32_t)(x)) << ENET_FTRL_TRUNC_FL_SHIFT)) & ENET_FTRL_TRUNC_FL_MASK)
/* TACC Bit Fields */
#    define ENET_TACC_SHIFT16_MASK 0x1u
#    define ENET_TACC_SHIFT16_SHIFT 0u
#    define ENET_TACC_SHIFT16_WIDTH 1u
#    define ENET_TACC_SHIFT16(x) (((uint32_t)(((uint32_t)(x)) << ENET_TACC_SHIFT16_SHIFT)) & ENET_TACC_SHIFT16_MASK)
#    define ENET_TACC_IPCHK_MASK 0x8u
#    define ENET_TACC_IPCHK_SHIFT 3u
#    define ENET_TACC_IPCHK_WIDTH 1u
#    define ENET_TACC_IPCHK(x) (((uint32_t)(((uint32_t)(x)) << ENET_TACC_IPCHK_SHIFT)) & ENET_TACC_IPCHK_MASK)
#    define ENET_TACC_PROCHK_MASK 0x10u
#    define ENET_TACC_PROCHK_SHIFT 4u
#    define ENET_TACC_PROCHK_WIDTH 1u
#    define ENET_TACC_PROCHK(x) (((uint32_t)(((uint32_t)(x)) << ENET_TACC_PROCHK_SHIFT)) & ENET_TACC_PROCHK_MASK)
/* RACC Bit Fields */
#    define ENET_RACC_PADREM_MASK 0x1u
#    define ENET_RACC_PADREM_SHIFT 0u
#    define ENET_RACC_PADREM_WIDTH 1u
#    define ENET_RACC_PADREM(x) (((uint32_t)(((uint32_t)(x)) << ENET_RACC_PADREM_SHIFT)) & ENET_RACC_PADREM_MASK)
#    define ENET_RACC_IPDIS_MASK 0x2u
#    define ENET_RACC_IPDIS_SHIFT 1u
#    define ENET_RACC_IPDIS_WIDTH 1u
#    define ENET_RACC_IPDIS(x) (((uint32_t)(((uint32_t)(x)) << ENET_RACC_IPDIS_SHIFT)) & ENET_RACC_IPDIS_MASK)
#    define ENET_RACC_PRODIS_MASK 0x4u
#    define ENET_RACC_PRODIS_SHIFT 2u
#    define ENET_RACC_PRODIS_WIDTH 1u
#    define ENET_RACC_PRODIS(x) (((uint32_t)(((uint32_t)(x)) << ENET_RACC_PRODIS_SHIFT)) & ENET_RACC_PRODIS_MASK)
#    define ENET_RACC_LINEDIS_MASK 0x40u
#    define ENET_RACC_LINEDIS_SHIFT 6u
#    define ENET_RACC_LINEDIS_WIDTH 1u
#    define ENET_RACC_LINEDIS(x) (((uint32_t)(((uint32_t)(x)) << ENET_RACC_LINEDIS_SHIFT)) & ENET_RACC_LINEDIS_MASK)
#    define ENET_RACC_SHIFT16_MASK 0x80u
#    define ENET_RACC_SHIFT16_SHIFT 7u
#    define ENET_RACC_SHIFT16_WIDTH 1u
#    define ENET_RACC_SHIFT16(x) (((uint32_t)(((uint32_t)(x)) << ENET_RACC_SHIFT16_SHIFT)) & ENET_RACC_SHIFT16_MASK)
/* RMON_T_PACKETS Bit Fields */
#    define ENET_RMON_T_PACKETS_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_PACKETS_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_PACKETS_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_PACKETS_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_PACKETS_TXPKTS_SHIFT)) & ENET_RMON_T_PACKETS_TXPKTS_MASK)
/* RMON_T_BC_PKT Bit Fields */
#    define ENET_RMON_T_BC_PKT_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_BC_PKT_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_BC_PKT_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_BC_PKT_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_BC_PKT_TXPKTS_SHIFT)) & ENET_RMON_T_BC_PKT_TXPKTS_MASK)
/* RMON_T_MC_PKT Bit Fields */
#    define ENET_RMON_T_MC_PKT_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_MC_PKT_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_MC_PKT_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_MC_PKT_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_MC_PKT_TXPKTS_SHIFT)) & ENET_RMON_T_MC_PKT_TXPKTS_MASK)
/* RMON_T_CRC_ALIGN Bit Fields */
#    define ENET_RMON_T_CRC_ALIGN_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_CRC_ALIGN_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_CRC_ALIGN_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_CRC_ALIGN_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_CRC_ALIGN_TXPKTS_SHIFT)) & ENET_RMON_T_CRC_ALIGN_TXPKTS_MASK)
/* RMON_T_UNDERSIZE Bit Fields */
#    define ENET_RMON_T_UNDERSIZE_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_UNDERSIZE_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_UNDERSIZE_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_UNDERSIZE_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_UNDERSIZE_TXPKTS_SHIFT)) & ENET_RMON_T_UNDERSIZE_TXPKTS_MASK)
/* RMON_T_OVERSIZE Bit Fields */
#    define ENET_RMON_T_OVERSIZE_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_OVERSIZE_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_OVERSIZE_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_OVERSIZE_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_OVERSIZE_TXPKTS_SHIFT)) & ENET_RMON_T_OVERSIZE_TXPKTS_MASK)
/* RMON_T_FRAG Bit Fields */
#    define ENET_RMON_T_FRAG_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_FRAG_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_FRAG_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_FRAG_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_FRAG_TXPKTS_SHIFT)) & ENET_RMON_T_FRAG_TXPKTS_MASK)
/* RMON_T_JAB Bit Fields */
#    define ENET_RMON_T_JAB_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_JAB_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_JAB_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_JAB_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_JAB_TXPKTS_SHIFT)) & ENET_RMON_T_JAB_TXPKTS_MASK)
/* RMON_T_COL Bit Fields */
#    define ENET_RMON_T_COL_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_COL_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_COL_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_COL_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_COL_TXPKTS_SHIFT)) & ENET_RMON_T_COL_TXPKTS_MASK)
/* RMON_T_P64 Bit Fields */
#    define ENET_RMON_T_P64_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P64_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P64_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P64_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P64_TXPKTS_SHIFT)) & ENET_RMON_T_P64_TXPKTS_MASK)
/* RMON_T_P65TO127 Bit Fields */
#    define ENET_RMON_T_P65TO127_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P65TO127_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P65TO127_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P65TO127_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P65TO127_TXPKTS_SHIFT)) & ENET_RMON_T_P65TO127_TXPKTS_MASK)
/* RMON_T_P128TO255 Bit Fields */
#    define ENET_RMON_T_P128TO255_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P128TO255_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P128TO255_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P128TO255_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P128TO255_TXPKTS_SHIFT)) & ENET_RMON_T_P128TO255_TXPKTS_MASK)
/* RMON_T_P256TO511 Bit Fields */
#    define ENET_RMON_T_P256TO511_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P256TO511_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P256TO511_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P256TO511_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P256TO511_TXPKTS_SHIFT)) & ENET_RMON_T_P256TO511_TXPKTS_MASK)
/* RMON_T_P512TO1023 Bit Fields */
#    define ENET_RMON_T_P512TO1023_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P512TO1023_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P512TO1023_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P512TO1023_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P512TO1023_TXPKTS_SHIFT)) & ENET_RMON_T_P512TO1023_TXPKTS_MASK)
/* RMON_T_P1024TO2047 Bit Fields */
#    define ENET_RMON_T_P1024TO2047_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P1024TO2047_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P1024TO2047_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P1024TO2047_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P1024TO2047_TXPKTS_SHIFT)) & ENET_RMON_T_P1024TO2047_TXPKTS_MASK)
/* RMON_T_P_GTE2048 Bit Fields */
#    define ENET_RMON_T_P_GTE2048_TXPKTS_MASK 0xFFFFu
#    define ENET_RMON_T_P_GTE2048_TXPKTS_SHIFT 0u
#    define ENET_RMON_T_P_GTE2048_TXPKTS_WIDTH 16u
#    define ENET_RMON_T_P_GTE2048_TXPKTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_P_GTE2048_TXPKTS_SHIFT)) & ENET_RMON_T_P_GTE2048_TXPKTS_MASK)
/* RMON_T_OCTETS Bit Fields */
#    define ENET_RMON_T_OCTETS_TXOCTS_MASK 0xFFFFFFFFu
#    define ENET_RMON_T_OCTETS_TXOCTS_SHIFT 0u
#    define ENET_RMON_T_OCTETS_TXOCTS_WIDTH 32u
#    define ENET_RMON_T_OCTETS_TXOCTS(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_T_OCTETS_TXOCTS_SHIFT)) & ENET_RMON_T_OCTETS_TXOCTS_MASK)
/* IEEE_T_FRAME_OK Bit Fields */
#    define ENET_IEEE_T_FRAME_OK_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_FRAME_OK_COUNT_SHIFT 0u
#    define ENET_IEEE_T_FRAME_OK_COUNT_WIDTH 16u
#    define ENET_IEEE_T_FRAME_OK_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_FRAME_OK_COUNT_SHIFT)) & ENET_IEEE_T_FRAME_OK_COUNT_MASK)
/* IEEE_T_1COL Bit Fields */
#    define ENET_IEEE_T_1COL_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_1COL_COUNT_SHIFT 0u
#    define ENET_IEEE_T_1COL_COUNT_WIDTH 16u
#    define ENET_IEEE_T_1COL_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_1COL_COUNT_SHIFT)) & ENET_IEEE_T_1COL_COUNT_MASK)
/* IEEE_T_MCOL Bit Fields */
#    define ENET_IEEE_T_MCOL_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_MCOL_COUNT_SHIFT 0u
#    define ENET_IEEE_T_MCOL_COUNT_WIDTH 16u
#    define ENET_IEEE_T_MCOL_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_MCOL_COUNT_SHIFT)) & ENET_IEEE_T_MCOL_COUNT_MASK)
/* IEEE_T_DEF Bit Fields */
#    define ENET_IEEE_T_DEF_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_DEF_COUNT_SHIFT 0u
#    define ENET_IEEE_T_DEF_COUNT_WIDTH 16u
#    define ENET_IEEE_T_DEF_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_DEF_COUNT_SHIFT)) & ENET_IEEE_T_DEF_COUNT_MASK)
/* IEEE_T_LCOL Bit Fields */
#    define ENET_IEEE_T_LCOL_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_LCOL_COUNT_SHIFT 0u
#    define ENET_IEEE_T_LCOL_COUNT_WIDTH 16u
#    define ENET_IEEE_T_LCOL_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_LCOL_COUNT_SHIFT)) & ENET_IEEE_T_LCOL_COUNT_MASK)
/* IEEE_T_EXCOL Bit Fields */
#    define ENET_IEEE_T_EXCOL_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_EXCOL_COUNT_SHIFT 0u
#    define ENET_IEEE_T_EXCOL_COUNT_WIDTH 16u
#    define ENET_IEEE_T_EXCOL_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_EXCOL_COUNT_SHIFT)) & ENET_IEEE_T_EXCOL_COUNT_MASK)
/* IEEE_T_MACERR Bit Fields */
#    define ENET_IEEE_T_MACERR_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_MACERR_COUNT_SHIFT 0u
#    define ENET_IEEE_T_MACERR_COUNT_WIDTH 16u
#    define ENET_IEEE_T_MACERR_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_MACERR_COUNT_SHIFT)) & ENET_IEEE_T_MACERR_COUNT_MASK)
/* IEEE_T_CSERR Bit Fields */
#    define ENET_IEEE_T_CSERR_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_CSERR_COUNT_SHIFT 0u
#    define ENET_IEEE_T_CSERR_COUNT_WIDTH 16u
#    define ENET_IEEE_T_CSERR_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_CSERR_COUNT_SHIFT)) & ENET_IEEE_T_CSERR_COUNT_MASK)
/* IEEE_T_SQE Bit Fields */
#    define ENET_IEEE_T_SQE_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_SQE_COUNT_SHIFT 0u
#    define ENET_IEEE_T_SQE_COUNT_WIDTH 16u
#    define ENET_IEEE_T_SQE_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_SQE_COUNT_SHIFT)) & ENET_IEEE_T_SQE_COUNT_MASK)
/* IEEE_T_FDXFC Bit Fields */
#    define ENET_IEEE_T_FDXFC_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_T_FDXFC_COUNT_SHIFT 0u
#    define ENET_IEEE_T_FDXFC_COUNT_WIDTH 16u
#    define ENET_IEEE_T_FDXFC_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_FDXFC_COUNT_SHIFT)) & ENET_IEEE_T_FDXFC_COUNT_MASK)
/* IEEE_T_OCTETS_OK Bit Fields */
#    define ENET_IEEE_T_OCTETS_OK_COUNT_MASK 0xFFFFFFFFu
#    define ENET_IEEE_T_OCTETS_OK_COUNT_SHIFT 0u
#    define ENET_IEEE_T_OCTETS_OK_COUNT_WIDTH 32u
#    define ENET_IEEE_T_OCTETS_OK_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_T_OCTETS_OK_COUNT_SHIFT)) & ENET_IEEE_T_OCTETS_OK_COUNT_MASK)
/* RMON_R_PACKETS Bit Fields */
#    define ENET_RMON_R_PACKETS_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_PACKETS_COUNT_SHIFT 0u
#    define ENET_RMON_R_PACKETS_COUNT_WIDTH 16u
#    define ENET_RMON_R_PACKETS_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_PACKETS_COUNT_SHIFT)) & ENET_RMON_R_PACKETS_COUNT_MASK)
/* RMON_R_BC_PKT Bit Fields */
#    define ENET_RMON_R_BC_PKT_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_BC_PKT_COUNT_SHIFT 0u
#    define ENET_RMON_R_BC_PKT_COUNT_WIDTH 16u
#    define ENET_RMON_R_BC_PKT_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_BC_PKT_COUNT_SHIFT)) & ENET_RMON_R_BC_PKT_COUNT_MASK)
/* RMON_R_MC_PKT Bit Fields */
#    define ENET_RMON_R_MC_PKT_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_MC_PKT_COUNT_SHIFT 0u
#    define ENET_RMON_R_MC_PKT_COUNT_WIDTH 16u
#    define ENET_RMON_R_MC_PKT_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_MC_PKT_COUNT_SHIFT)) & ENET_RMON_R_MC_PKT_COUNT_MASK)
/* RMON_R_CRC_ALIGN Bit Fields */
#    define ENET_RMON_R_CRC_ALIGN_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_CRC_ALIGN_COUNT_SHIFT 0u
#    define ENET_RMON_R_CRC_ALIGN_COUNT_WIDTH 16u
#    define ENET_RMON_R_CRC_ALIGN_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_CRC_ALIGN_COUNT_SHIFT)) & ENET_RMON_R_CRC_ALIGN_COUNT_MASK)
/* RMON_R_UNDERSIZE Bit Fields */
#    define ENET_RMON_R_UNDERSIZE_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_UNDERSIZE_COUNT_SHIFT 0u
#    define ENET_RMON_R_UNDERSIZE_COUNT_WIDTH 16u
#    define ENET_RMON_R_UNDERSIZE_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_UNDERSIZE_COUNT_SHIFT)) & ENET_RMON_R_UNDERSIZE_COUNT_MASK)
/* RMON_R_OVERSIZE Bit Fields */
#    define ENET_RMON_R_OVERSIZE_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_OVERSIZE_COUNT_SHIFT 0u
#    define ENET_RMON_R_OVERSIZE_COUNT_WIDTH 16u
#    define ENET_RMON_R_OVERSIZE_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_OVERSIZE_COUNT_SHIFT)) & ENET_RMON_R_OVERSIZE_COUNT_MASK)
/* RMON_R_FRAG Bit Fields */
#    define ENET_RMON_R_FRAG_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_FRAG_COUNT_SHIFT 0u
#    define ENET_RMON_R_FRAG_COUNT_WIDTH 16u
#    define ENET_RMON_R_FRAG_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_FRAG_COUNT_SHIFT)) & ENET_RMON_R_FRAG_COUNT_MASK)
/* RMON_R_JAB Bit Fields */
#    define ENET_RMON_R_JAB_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_JAB_COUNT_SHIFT 0u
#    define ENET_RMON_R_JAB_COUNT_WIDTH 16u
#    define ENET_RMON_R_JAB_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_JAB_COUNT_SHIFT)) & ENET_RMON_R_JAB_COUNT_MASK)
/* RMON_R_P64 Bit Fields */
#    define ENET_RMON_R_P64_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P64_COUNT_SHIFT 0u
#    define ENET_RMON_R_P64_COUNT_WIDTH 16u
#    define ENET_RMON_R_P64_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P64_COUNT_SHIFT)) & ENET_RMON_R_P64_COUNT_MASK)
/* RMON_R_P65TO127 Bit Fields */
#    define ENET_RMON_R_P65TO127_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P65TO127_COUNT_SHIFT 0u
#    define ENET_RMON_R_P65TO127_COUNT_WIDTH 16u
#    define ENET_RMON_R_P65TO127_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P65TO127_COUNT_SHIFT)) & ENET_RMON_R_P65TO127_COUNT_MASK)
/* RMON_R_P128TO255 Bit Fields */
#    define ENET_RMON_R_P128TO255_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P128TO255_COUNT_SHIFT 0u
#    define ENET_RMON_R_P128TO255_COUNT_WIDTH 16u
#    define ENET_RMON_R_P128TO255_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P128TO255_COUNT_SHIFT)) & ENET_RMON_R_P128TO255_COUNT_MASK)
/* RMON_R_P256TO511 Bit Fields */
#    define ENET_RMON_R_P256TO511_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P256TO511_COUNT_SHIFT 0u
#    define ENET_RMON_R_P256TO511_COUNT_WIDTH 16u
#    define ENET_RMON_R_P256TO511_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P256TO511_COUNT_SHIFT)) & ENET_RMON_R_P256TO511_COUNT_MASK)
/* RMON_R_P512TO1023 Bit Fields */
#    define ENET_RMON_R_P512TO1023_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P512TO1023_COUNT_SHIFT 0u
#    define ENET_RMON_R_P512TO1023_COUNT_WIDTH 16u
#    define ENET_RMON_R_P512TO1023_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P512TO1023_COUNT_SHIFT)) & ENET_RMON_R_P512TO1023_COUNT_MASK)
/* RMON_R_P1024TO2047 Bit Fields */
#    define ENET_RMON_R_P1024TO2047_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P1024TO2047_COUNT_SHIFT 0u
#    define ENET_RMON_R_P1024TO2047_COUNT_WIDTH 16u
#    define ENET_RMON_R_P1024TO2047_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P1024TO2047_COUNT_SHIFT)) & ENET_RMON_R_P1024TO2047_COUNT_MASK)
/* RMON_R_P_GTE2048 Bit Fields */
#    define ENET_RMON_R_P_GTE2048_COUNT_MASK 0xFFFFu
#    define ENET_RMON_R_P_GTE2048_COUNT_SHIFT 0u
#    define ENET_RMON_R_P_GTE2048_COUNT_WIDTH 16u
#    define ENET_RMON_R_P_GTE2048_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_P_GTE2048_COUNT_SHIFT)) & ENET_RMON_R_P_GTE2048_COUNT_MASK)
/* RMON_R_OCTETS Bit Fields */
#    define ENET_RMON_R_OCTETS_COUNT_MASK 0xFFFFFFFFu
#    define ENET_RMON_R_OCTETS_COUNT_SHIFT 0u
#    define ENET_RMON_R_OCTETS_COUNT_WIDTH 32u
#    define ENET_RMON_R_OCTETS_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_RMON_R_OCTETS_COUNT_SHIFT)) & ENET_RMON_R_OCTETS_COUNT_MASK)
/* IEEE_R_DROP Bit Fields */
#    define ENET_IEEE_R_DROP_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_DROP_COUNT_SHIFT 0u
#    define ENET_IEEE_R_DROP_COUNT_WIDTH 16u
#    define ENET_IEEE_R_DROP_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_DROP_COUNT_SHIFT)) & ENET_IEEE_R_DROP_COUNT_MASK)
/* IEEE_R_FRAME_OK Bit Fields */
#    define ENET_IEEE_R_FRAME_OK_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_FRAME_OK_COUNT_SHIFT 0u
#    define ENET_IEEE_R_FRAME_OK_COUNT_WIDTH 16u
#    define ENET_IEEE_R_FRAME_OK_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_FRAME_OK_COUNT_SHIFT)) & ENET_IEEE_R_FRAME_OK_COUNT_MASK)
/* IEEE_R_CRC Bit Fields */
#    define ENET_IEEE_R_CRC_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_CRC_COUNT_SHIFT 0u
#    define ENET_IEEE_R_CRC_COUNT_WIDTH 16u
#    define ENET_IEEE_R_CRC_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_CRC_COUNT_SHIFT)) & ENET_IEEE_R_CRC_COUNT_MASK)
/* IEEE_R_ALIGN Bit Fields */
#    define ENET_IEEE_R_ALIGN_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_ALIGN_COUNT_SHIFT 0u
#    define ENET_IEEE_R_ALIGN_COUNT_WIDTH 16u
#    define ENET_IEEE_R_ALIGN_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_ALIGN_COUNT_SHIFT)) & ENET_IEEE_R_ALIGN_COUNT_MASK)
/* IEEE_R_MACERR Bit Fields */
#    define ENET_IEEE_R_MACERR_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_MACERR_COUNT_SHIFT 0u
#    define ENET_IEEE_R_MACERR_COUNT_WIDTH 16u
#    define ENET_IEEE_R_MACERR_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_MACERR_COUNT_SHIFT)) & ENET_IEEE_R_MACERR_COUNT_MASK)
/* IEEE_R_FDXFC Bit Fields */
#    define ENET_IEEE_R_FDXFC_COUNT_MASK 0xFFFFu
#    define ENET_IEEE_R_FDXFC_COUNT_SHIFT 0u
#    define ENET_IEEE_R_FDXFC_COUNT_WIDTH 16u
#    define ENET_IEEE_R_FDXFC_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_FDXFC_COUNT_SHIFT)) & ENET_IEEE_R_FDXFC_COUNT_MASK)
/* IEEE_R_OCTETS_OK Bit Fields */
#    define ENET_IEEE_R_OCTETS_OK_COUNT_MASK 0xFFFFFFFFu
#    define ENET_IEEE_R_OCTETS_OK_COUNT_SHIFT 0u
#    define ENET_IEEE_R_OCTETS_OK_COUNT_WIDTH 32u
#    define ENET_IEEE_R_OCTETS_OK_COUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_IEEE_R_OCTETS_OK_COUNT_SHIFT)) & ENET_IEEE_R_OCTETS_OK_COUNT_MASK)
/* ATCR Bit Fields */
#    define ENET_ATCR_EN_MASK 0x1u
#    define ENET_ATCR_EN_SHIFT 0u
#    define ENET_ATCR_EN_WIDTH 1u
#    define ENET_ATCR_EN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_EN_SHIFT)) & ENET_ATCR_EN_MASK)
#    define ENET_ATCR_OFFEN_MASK 0x4u
#    define ENET_ATCR_OFFEN_SHIFT 2u
#    define ENET_ATCR_OFFEN_WIDTH 1u
#    define ENET_ATCR_OFFEN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_OFFEN_SHIFT)) & ENET_ATCR_OFFEN_MASK)
#    define ENET_ATCR_OFFRST_MASK 0x8u
#    define ENET_ATCR_OFFRST_SHIFT 3u
#    define ENET_ATCR_OFFRST_WIDTH 1u
#    define ENET_ATCR_OFFRST(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_OFFRST_SHIFT)) & ENET_ATCR_OFFRST_MASK)
#    define ENET_ATCR_PEREN_MASK 0x10u
#    define ENET_ATCR_PEREN_SHIFT 4u
#    define ENET_ATCR_PEREN_WIDTH 1u
#    define ENET_ATCR_PEREN(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_PEREN_SHIFT)) & ENET_ATCR_PEREN_MASK)
#    define ENET_ATCR_PINPER_MASK 0x80u
#    define ENET_ATCR_PINPER_SHIFT 7u
#    define ENET_ATCR_PINPER_WIDTH 1u
#    define ENET_ATCR_PINPER(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_PINPER_SHIFT)) & ENET_ATCR_PINPER_MASK)
#    define ENET_ATCR_RESTART_MASK 0x200u
#    define ENET_ATCR_RESTART_SHIFT 9u
#    define ENET_ATCR_RESTART_WIDTH 1u
#    define ENET_ATCR_RESTART(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_RESTART_SHIFT)) & ENET_ATCR_RESTART_MASK)
#    define ENET_ATCR_CAPTURE_MASK 0x800u
#    define ENET_ATCR_CAPTURE_SHIFT 11u
#    define ENET_ATCR_CAPTURE_WIDTH 1u
#    define ENET_ATCR_CAPTURE(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_CAPTURE_SHIFT)) & ENET_ATCR_CAPTURE_MASK)
#    define ENET_ATCR_SLAVE_MASK 0x2000u
#    define ENET_ATCR_SLAVE_SHIFT 13u
#    define ENET_ATCR_SLAVE_WIDTH 1u
#    define ENET_ATCR_SLAVE(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCR_SLAVE_SHIFT)) & ENET_ATCR_SLAVE_MASK)
/* ATVR Bit Fields */
#    define ENET_ATVR_ATIME_MASK 0xFFFFFFFFu
#    define ENET_ATVR_ATIME_SHIFT 0u
#    define ENET_ATVR_ATIME_WIDTH 32u
#    define ENET_ATVR_ATIME(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATVR_ATIME_SHIFT)) & ENET_ATVR_ATIME_MASK)
/* ATOFF Bit Fields */
#    define ENET_ATOFF_OFFSET_MASK 0xFFFFFFFFu
#    define ENET_ATOFF_OFFSET_SHIFT 0u
#    define ENET_ATOFF_OFFSET_WIDTH 32u
#    define ENET_ATOFF_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATOFF_OFFSET_SHIFT)) & ENET_ATOFF_OFFSET_MASK)
/* ATPER Bit Fields */
#    define ENET_ATPER_PERIOD_MASK 0xFFFFFFFFu
#    define ENET_ATPER_PERIOD_SHIFT 0u
#    define ENET_ATPER_PERIOD_WIDTH 32u
#    define ENET_ATPER_PERIOD(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATPER_PERIOD_SHIFT)) & ENET_ATPER_PERIOD_MASK)
/* ATCOR Bit Fields */
#    define ENET_ATCOR_COR_MASK 0x7FFFFFFFu
#    define ENET_ATCOR_COR_SHIFT 0u
#    define ENET_ATCOR_COR_WIDTH 31u
#    define ENET_ATCOR_COR(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATCOR_COR_SHIFT)) & ENET_ATCOR_COR_MASK)
/* ATINC Bit Fields */
#    define ENET_ATINC_INC_MASK 0x7Fu
#    define ENET_ATINC_INC_SHIFT 0u
#    define ENET_ATINC_INC_WIDTH 7u
#    define ENET_ATINC_INC(x) (((uint32_t)(((uint32_t)(x)) << ENET_ATINC_INC_SHIFT)) & ENET_ATINC_INC_MASK)
#    define ENET_ATINC_INC_CORR_MASK 0x7F00u
#    define ENET_ATINC_INC_CORR_SHIFT 8u
#    define ENET_ATINC_INC_CORR_WIDTH 7u
#    define ENET_ATINC_INC_CORR(x) \
        (((uint32_t)(((uint32_t)(x)) << ENET_ATINC_INC_CORR_SHIFT)) & ENET_ATINC_INC_CORR_MASK)
/* ATSTMP Bit Fields */
#    define ENET_ATSTMP_TIMESTAMP_MASK 0xFFFFFFFFu
#    define ENET_ATSTMP_TIMESTAMP_SHIFT 0u
#    define ENET_ATSTMP_TIMESTAMP_WIDTH 32u
#    define ENET_ATSTMP_TIMESTAMP(x) \
