OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
        (((uint32_t)(((uint32_t)(x)) << ENET_ATSTMP_TIMESTAMP_SHIFT)) & ENET_ATSTMP_TIMESTAMP_MASK)
/* TGSR Bit Fields */
#    define ENET_TGSR_TF0_MASK 0x1u
#    define ENET_TGSR_TF0_SHIFT 0u
#    define ENET_TGSR_TF0_WIDTH 1u
#    define ENET_TGSR_TF0(x) (((uint32_t)(((uint32_t)(x)) << ENET_TGSR_TF0_SHIFT)) & ENET_TGSR_TF0_MASK)
#    define ENET_TGSR_TF1_MASK 0x2u
#    define ENET_TGSR_TF1_SHIFT 1u
#    define ENET_TGSR_TF1_WIDTH 1u
#    define ENET_TGSR_TF1(x) (((uint32_t)(((uint32_t)(x)) << ENET_TGSR_TF1_SHIFT)) & ENET_TGSR_TF1_MASK)
#    define ENET_TGSR_TF2_MASK 0x4u
#    define ENET_TGSR_TF2_SHIFT 2u
#    define ENET_TGSR_TF2_WIDTH 1u
#    define ENET_TGSR_TF2(x) (((uint32_t)(((uint32_t)(x)) << ENET_TGSR_TF2_SHIFT)) & ENET_TGSR_TF2_MASK)
#    define ENET_TGSR_TF3_MASK 0x8u
#    define ENET_TGSR_TF3_SHIFT 3u
#    define ENET_TGSR_TF3_WIDTH 1u
#    define ENET_TGSR_TF3(x) (((uint32_t)(((uint32_t)(x)) << ENET_TGSR_TF3_SHIFT)) & ENET_TGSR_TF3_MASK)
/* TCSR Bit Fields */
#    define ENET_TCSR_TDRE_MASK 0x1u
#    define ENET_TCSR_TDRE_SHIFT 0u
#    define ENET_TCSR_TDRE_WIDTH 1u
#    define ENET_TCSR_TDRE(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCSR_TDRE_SHIFT)) & ENET_TCSR_TDRE_MASK)
#    define ENET_TCSR_TMODE_MASK 0x3Cu
#    define ENET_TCSR_TMODE_SHIFT 2u
#    define ENET_TCSR_TMODE_WIDTH 4u
#    define ENET_TCSR_TMODE(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCSR_TMODE_SHIFT)) & ENET_TCSR_TMODE_MASK)
#    define ENET_TCSR_TIE_MASK 0x40u
#    define ENET_TCSR_TIE_SHIFT 6u
#    define ENET_TCSR_TIE_WIDTH 1u
#    define ENET_TCSR_TIE(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCSR_TIE_SHIFT)) & ENET_TCSR_TIE_MASK)
#    define ENET_TCSR_TF_MASK 0x80u
#    define ENET_TCSR_TF_SHIFT 7u
#    define ENET_TCSR_TF_WIDTH 1u
#    define ENET_TCSR_TF(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCSR_TF_SHIFT)) & ENET_TCSR_TF_MASK)
/* TCCR Bit Fields */
#    define ENET_TCCR_TCC_MASK 0xFFFFFFFFu
#    define ENET_TCCR_TCC_SHIFT 0u
#    define ENET_TCCR_TCC_WIDTH 32u
#    define ENET_TCCR_TCC(x) (((uint32_t)(((uint32_t)(x)) << ENET_TCCR_TCC_SHIFT)) & ENET_TCCR_TCC_MASK)

/*!
 * @}
 */ /* end of group ENET_Register_Masks */

/*!
 * @}
 */ /* end of group ENET_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- ERM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Peripheral_Access_Layer ERM Peripheral Access Layer
 * @{
 */

/** ERM - Size of Registers Arrays */
#    define ERM_EARn_COUNT 2u

/** ERM - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CR0; /**< ERM Configuration Register 0, offset: 0x0 */
    uint8_t       RESERVED_0[12];
    __IO uint32_t SR0; /**< ERM Status Register 0, offset: 0x10 */
    uint8_t       RESERVED_1[236];
    struct
    {                     /* offset: 0x100, array step: 0x10 */
        __I uint32_t EAR; /**< ERM Memory n Error Address Register, array offset: 0x100, array step: 0x10 */
        uint8_t      RESERVED_0[12];
    } EARn[ERM_EARn_COUNT];
} ERM_Type, *ERM_MemMapPtr;

/** Number of instances of the ERM module. */
#    define ERM_INSTANCE_COUNT (1u)

/* ERM - Peripheral instance base addresses */
/** Peripheral ERM base address */
#    define ERM_BASE (0x40018000u)
/** Peripheral ERM base pointer */
#    define ERM ((ERM_Type*) ERM_BASE)
/** Array initializer of ERM peripheral base addresses */
#    define ERM_BASE_ADDRS \
        {                  \
            ERM_BASE       \
        }
/** Array initializer of ERM peripheral base pointers */
#    define ERM_BASE_PTRS \
        {                 \
            ERM           \
        }
/** Number of interrupt vector arrays for the ERM module. */
#    define ERM_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the SINGLE type of ERM module. */
#    define ERM_SINGLE_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the DOUBLE type of ERM module. */
#    define ERM_DOUBLE_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the ERM peripheral type */
#    define ERM_SINGLE_IRQS       \
        {                         \
            ERM_single_fault_IRQn \
        }
#    define ERM_DOUBLE_IRQS       \
        {                         \
            ERM_double_fault_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- ERM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Register_Masks ERM Register Masks
 * @{
 */

/* CR0 Bit Fields */
#    define ERM_CR0_ENCIE1_MASK 0x4000000u
#    define ERM_CR0_ENCIE1_SHIFT 26u
#    define ERM_CR0_ENCIE1_WIDTH 1u
#    define ERM_CR0_ENCIE1(x) (((uint32_t)(((uint32_t)(x)) << ERM_CR0_ENCIE1_SHIFT)) & ERM_CR0_ENCIE1_MASK)
#    define ERM_CR0_ESCIE1_MASK 0x8000000u
#    define ERM_CR0_ESCIE1_SHIFT 27u
#    define ERM_CR0_ESCIE1_WIDTH 1u
#    define ERM_CR0_ESCIE1(x) (((uint32_t)(((uint32_t)(x)) << ERM_CR0_ESCIE1_SHIFT)) & ERM_CR0_ESCIE1_MASK)
#    define ERM_CR0_ENCIE0_MASK 0x40000000u
#    define ERM_CR0_ENCIE0_SHIFT 30u
#    define ERM_CR0_ENCIE0_WIDTH 1u
#    define ERM_CR0_ENCIE0(x) (((uint32_t)(((uint32_t)(x)) << ERM_CR0_ENCIE0_SHIFT)) & ERM_CR0_ENCIE0_MASK)
#    define ERM_CR0_ESCIE0_MASK 0x80000000u
#    define ERM_CR0_ESCIE0_SHIFT 31u
#    define ERM_CR0_ESCIE0_WIDTH 1u
#    define ERM_CR0_ESCIE0(x) (((uint32_t)(((uint32_t)(x)) << ERM_CR0_ESCIE0_SHIFT)) & ERM_CR0_ESCIE0_MASK)
/* SR0 Bit Fields */
#    define ERM_SR0_NCE1_MASK 0x4000000u
#    define ERM_SR0_NCE1_SHIFT 26u
#    define ERM_SR0_NCE1_WIDTH 1u
#    define ERM_SR0_NCE1(x) (((uint32_t)(((uint32_t)(x)) << ERM_SR0_NCE1_SHIFT)) & ERM_SR0_NCE1_MASK)
#    define ERM_SR0_SBC1_MASK 0x8000000u
#    define ERM_SR0_SBC1_SHIFT 27u
#    define ERM_SR0_SBC1_WIDTH 1u
#    define ERM_SR0_SBC1(x) (((uint32_t)(((uint32_t)(x)) << ERM_SR0_SBC1_SHIFT)) & ERM_SR0_SBC1_MASK)
#    define ERM_SR0_NCE0_MASK 0x40000000u
#    define ERM_SR0_NCE0_SHIFT 30u
#    define ERM_SR0_NCE0_WIDTH 1u
#    define ERM_SR0_NCE0(x) (((uint32_t)(((uint32_t)(x)) << ERM_SR0_NCE0_SHIFT)) & ERM_SR0_NCE0_MASK)
#    define ERM_SR0_SBC0_MASK 0x80000000u
#    define ERM_SR0_SBC0_SHIFT 31u
#    define ERM_SR0_SBC0_WIDTH 1u
#    define ERM_SR0_SBC0(x) (((uint32_t)(((uint32_t)(x)) << ERM_SR0_SBC0_SHIFT)) & ERM_SR0_SBC0_MASK)
/* EARn_EAR Bit Fields */
#    define ERM_EARn_EAR_EAR_MASK 0xFFFFFFFFu
#    define ERM_EARn_EAR_EAR_SHIFT 0u
#    define ERM_EARn_EAR_EAR_WIDTH 32u
#    define ERM_EARn_EAR_EAR(x) (((uint32_t)(((uint32_t)(x)) << ERM_EARn_EAR_EAR_SHIFT)) & ERM_EARn_EAR_EAR_MASK)

/*!
 * @}
 */ /* end of group ERM_Register_Masks */

/*!
 * @}
 */ /* end of group ERM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- EWM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EWM_Peripheral_Access_Layer EWM Peripheral Access Layer
 * @{
 */

/** EWM - Size of Registers Arrays */

/** EWM - Register Layout Typedef */
typedef struct
{
    __IO uint8_t CTRL; /**< Control Register, offset: 0x0 */
    __O uint8_t SERV;  /**< Service Register, offset: 0x1 */
    __IO uint8_t CMPL; /**< Compare Low Register, offset: 0x2 */
    __IO uint8_t CMPH; /**< Compare High Register, offset: 0x3 */
    uint8_t      RESERVED_0[1];
    __IO uint8_t CLKPRESCALER; /**< Clock Prescaler Register, offset: 0x5 */
} EWM_Type, *EWM_MemMapPtr;

