OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** FTFC - Register Layout Typedef */
typedef struct
{
    __IO uint8_t FSTAT; /**< Flash Status Register, offset: 0x0 */
    __IO uint8_t FCNFG; /**< Flash Configuration Register, offset: 0x1 */
    __I uint8_t FSEC;   /**< Flash Security Register, offset: 0x2 */
    __I uint8_t FOPT;   /**< Flash Option Register, offset: 0x3 */
    __IO        uint8_t
                FCCOB[FTFC_FCCOB_COUNT]; /**< Flash Common Command Object Registers, array offset: 0x4, array step: 0x1 */
    __IO        uint8_t
                FPROT[FTFC_FPROT_COUNT]; /**< Program Flash Protection Registers, array offset: 0x10, array step: 0x1 */
    uint8_t     RESERVED_0[2];
    __IO uint8_t FEPROT; /**< EEPROM Protection Register, offset: 0x16 */
    __IO uint8_t FDPROT; /**< Data Flash Protection Register, offset: 0x17 */
    uint8_t      RESERVED_1[20];
    __I uint8_t FCSESTAT; /**< Flash CSEc Status Register, offset: 0x2C */
    uint8_t     RESERVED_2[1];
    __IO uint8_t FERSTAT; /**< Flash Error Status Register, offset: 0x2E */
    __IO uint8_t FERCNFG; /**< Flash Error Configuration Register, offset: 0x2F */
} FTFC_Type, *FTFC_MemMapPtr;

/** Number of instances of the FTFC module. */
#    define FTFC_INSTANCE_COUNT (1u)

/* FTFC - Peripheral instance base addresses */
/** Peripheral FTFC base address */
#    define FTFC_BASE (0x40020000u)
/** Peripheral FTFC base pointer */
#    define FTFC ((FTFC_Type*) FTFC_BASE)
/** Array initializer of FTFC peripheral base addresses */
#    define FTFC_BASE_ADDRS \
        {                   \
            FTFC_BASE       \
        }
/** Array initializer of FTFC peripheral base pointers */
#    define FTFC_BASE_PTRS \
        {                  \
            FTFC           \
        }
/** Number of interrupt vector arrays for the FTFC module. */
#    define FTFC_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the COMMAND_COMPLETE type of FTFC module. */
#    define FTFC_COMMAND_COMPLETE_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the READ_COLLISION type of FTFC module. */
#    define FTFC_READ_COLLISION_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the FTFC peripheral type */
#    define FTFC_COMMAND_COMPLETE_IRQS \
        {                              \
            FTFC_IRQn                  \
        }
#    define FTFC_READ_COLLISION_IRQS \
        {                            \
            Read_Collision_IRQn      \
        }

/* ----------------------------------------------------------------------------
   -- FTFC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFC_Register_Masks FTFC Register Masks
 * @{
 */

/* FSTAT Bit Fields */
#    define FTFC_FSTAT_MGSTAT0_MASK 0x1u
#    define FTFC_FSTAT_MGSTAT0_SHIFT 0u
#    define FTFC_FSTAT_MGSTAT0_WIDTH 1u
#    define FTFC_FSTAT_MGSTAT0(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_MGSTAT0_SHIFT)) & FTFC_FSTAT_MGSTAT0_MASK)
#    define FTFC_FSTAT_FPVIOL_MASK 0x10u
#    define FTFC_FSTAT_FPVIOL_SHIFT 4u
#    define FTFC_FSTAT_FPVIOL_WIDTH 1u
#    define FTFC_FSTAT_FPVIOL(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_FPVIOL_SHIFT)) & FTFC_FSTAT_FPVIOL_MASK)
#    define FTFC_FSTAT_ACCERR_MASK 0x20u
#    define FTFC_FSTAT_ACCERR_SHIFT 5u
#    define FTFC_FSTAT_ACCERR_WIDTH 1u
#    define FTFC_FSTAT_ACCERR(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_ACCERR_SHIFT)) & FTFC_FSTAT_ACCERR_MASK)
#    define FTFC_FSTAT_RDCOLERR_MASK 0x40u
#    define FTFC_FSTAT_RDCOLERR_SHIFT 6u
#    define FTFC_FSTAT_RDCOLERR_WIDTH 1u
#    define FTFC_FSTAT_RDCOLERR(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_RDCOLERR_SHIFT)) & FTFC_FSTAT_RDCOLERR_MASK)
#    define FTFC_FSTAT_CCIF_MASK 0x80u
#    define FTFC_FSTAT_CCIF_SHIFT 7u
#    define FTFC_FSTAT_CCIF_WIDTH 1u
#    define FTFC_FSTAT_CCIF(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSTAT_CCIF_SHIFT)) & FTFC_FSTAT_CCIF_MASK)
/* FCNFG Bit Fields */
#    define FTFC_FCNFG_EEERDY_MASK 0x1u
#    define FTFC_FCNFG_EEERDY_SHIFT 0u
#    define FTFC_FCNFG_EEERDY_WIDTH 1u
#    define FTFC_FCNFG_EEERDY(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_EEERDY_SHIFT)) & FTFC_FCNFG_EEERDY_MASK)
#    define FTFC_FCNFG_RAMRDY_MASK 0x2u
#    define FTFC_FCNFG_RAMRDY_SHIFT 1u
#    define FTFC_FCNFG_RAMRDY_WIDTH 1u
#    define FTFC_FCNFG_RAMRDY(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_RAMRDY_SHIFT)) & FTFC_FCNFG_RAMRDY_MASK)
#    define FTFC_FCNFG_ERSSUSP_MASK 0x10u
#    define FTFC_FCNFG_ERSSUSP_SHIFT 4u
#    define FTFC_FCNFG_ERSSUSP_WIDTH 1u
#    define FTFC_FCNFG_ERSSUSP(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_ERSSUSP_SHIFT)) & FTFC_FCNFG_ERSSUSP_MASK)
#    define FTFC_FCNFG_ERSAREQ_MASK 0x20u
#    define FTFC_FCNFG_ERSAREQ_SHIFT 5u
#    define FTFC_FCNFG_ERSAREQ_WIDTH 1u
#    define FTFC_FCNFG_ERSAREQ(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_ERSAREQ_SHIFT)) & FTFC_FCNFG_ERSAREQ_MASK)
#    define FTFC_FCNFG_RDCOLLIE_MASK 0x40u
#    define FTFC_FCNFG_RDCOLLIE_SHIFT 6u
#    define FTFC_FCNFG_RDCOLLIE_WIDTH 1u
#    define FTFC_FCNFG_RDCOLLIE(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_RDCOLLIE_SHIFT)) & FTFC_FCNFG_RDCOLLIE_MASK)
#    define FTFC_FCNFG_CCIE_MASK 0x80u
#    define FTFC_FCNFG_CCIE_SHIFT 7u
#    define FTFC_FCNFG_CCIE_WIDTH 1u
#    define FTFC_FCNFG_CCIE(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCNFG_CCIE_SHIFT)) & FTFC_FCNFG_CCIE_MASK)
/* FSEC Bit Fields */
#    define FTFC_FSEC_SEC_MASK 0x3u
#    define FTFC_FSEC_SEC_SHIFT 0u
#    define FTFC_FSEC_SEC_WIDTH 2u
#    define FTFC_FSEC_SEC(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_SEC_SHIFT)) & FTFC_FSEC_SEC_MASK)
#    define FTFC_FSEC_FSLACC_MASK 0xCu
#    define FTFC_FSEC_FSLACC_SHIFT 2u
#    define FTFC_FSEC_FSLACC_WIDTH 2u
#    define FTFC_FSEC_FSLACC(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_FSLACC_SHIFT)) & FTFC_FSEC_FSLACC_MASK)
#    define FTFC_FSEC_MEEN_MASK 0x30u
#    define FTFC_FSEC_MEEN_SHIFT 4u
#    define FTFC_FSEC_MEEN_WIDTH 2u
#    define FTFC_FSEC_MEEN(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_MEEN_SHIFT)) & FTFC_FSEC_MEEN_MASK)
#    define FTFC_FSEC_KEYEN_MASK 0xC0u
#    define FTFC_FSEC_KEYEN_SHIFT 6u
#    define FTFC_FSEC_KEYEN_WIDTH 2u
#    define FTFC_FSEC_KEYEN(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FSEC_KEYEN_SHIFT)) & FTFC_FSEC_KEYEN_MASK)
/* FOPT Bit Fields */
#    define FTFC_FOPT_OPT_MASK 0xFFu
#    define FTFC_FOPT_OPT_SHIFT 0u
#    define FTFC_FOPT_OPT_WIDTH 8u
#    define FTFC_FOPT_OPT(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FOPT_OPT_SHIFT)) & FTFC_FOPT_OPT_MASK)
/* FCCOB Bit Fields */
#    define FTFC_FCCOB_CCOBn_MASK 0xFFu
#    define FTFC_FCCOB_CCOBn_SHIFT 0u
#    define FTFC_FCCOB_CCOBn_WIDTH 8u
#    define FTFC_FCCOB_CCOBn(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCCOB_CCOBn_SHIFT)) & FTFC_FCCOB_CCOBn_MASK)
/* FPROT Bit Fields */
#    define FTFC_FPROT_PROT_MASK 0xFFu
#    define FTFC_FPROT_PROT_SHIFT 0u
#    define FTFC_FPROT_PROT_WIDTH 8u
#    define FTFC_FPROT_PROT(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FPROT_PROT_SHIFT)) & FTFC_FPROT_PROT_MASK)
/* FEPROT Bit Fields */
#    define FTFC_FEPROT_EPROT_MASK 0xFFu
#    define FTFC_FEPROT_EPROT_SHIFT 0u
#    define FTFC_FEPROT_EPROT_WIDTH 8u
#    define FTFC_FEPROT_EPROT(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FEPROT_EPROT_SHIFT)) & FTFC_FEPROT_EPROT_MASK)
/* FDPROT Bit Fields */
#    define FTFC_FDPROT_DPROT_MASK 0xFFu
#    define FTFC_FDPROT_DPROT_SHIFT 0u
#    define FTFC_FDPROT_DPROT_WIDTH 8u
#    define FTFC_FDPROT_DPROT(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FDPROT_DPROT_SHIFT)) & FTFC_FDPROT_DPROT_MASK)
/* FCSESTAT Bit Fields */
#    define FTFC_FCSESTAT_BSY_MASK 0x1u
#    define FTFC_FCSESTAT_BSY_SHIFT 0u
#    define FTFC_FCSESTAT_BSY_WIDTH 1u
#    define FTFC_FCSESTAT_BSY(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BSY_SHIFT)) & FTFC_FCSESTAT_BSY_MASK)
#    define FTFC_FCSESTAT_SB_MASK 0x2u
#    define FTFC_FCSESTAT_SB_SHIFT 1u
#    define FTFC_FCSESTAT_SB_WIDTH 1u
#    define FTFC_FCSESTAT_SB(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_SB_SHIFT)) & FTFC_FCSESTAT_SB_MASK)
#    define FTFC_FCSESTAT_BIN_MASK 0x4u
#    define FTFC_FCSESTAT_BIN_SHIFT 2u
#    define FTFC_FCSESTAT_BIN_WIDTH 1u
#    define FTFC_FCSESTAT_BIN(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BIN_SHIFT)) & FTFC_FCSESTAT_BIN_MASK)
#    define FTFC_FCSESTAT_BFN_MASK 0x8u
#    define FTFC_FCSESTAT_BFN_SHIFT 3u
#    define FTFC_FCSESTAT_BFN_WIDTH 1u
#    define FTFC_FCSESTAT_BFN(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BFN_SHIFT)) & FTFC_FCSESTAT_BFN_MASK)
#    define FTFC_FCSESTAT_BOK_MASK 0x10u
#    define FTFC_FCSESTAT_BOK_SHIFT 4u
#    define FTFC_FCSESTAT_BOK_WIDTH 1u
#    define FTFC_FCSESTAT_BOK(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_BOK_SHIFT)) & FTFC_FCSESTAT_BOK_MASK)
#    define FTFC_FCSESTAT_RIN_MASK 0x20u
#    define FTFC_FCSESTAT_RIN_SHIFT 5u
#    define FTFC_FCSESTAT_RIN_WIDTH 1u
#    define FTFC_FCSESTAT_RIN(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_RIN_SHIFT)) & FTFC_FCSESTAT_RIN_MASK)
#    define FTFC_FCSESTAT_EDB_MASK 0x40u
#    define FTFC_FCSESTAT_EDB_SHIFT 6u
#    define FTFC_FCSESTAT_EDB_WIDTH 1u
#    define FTFC_FCSESTAT_EDB(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_EDB_SHIFT)) & FTFC_FCSESTAT_EDB_MASK)
#    define FTFC_FCSESTAT_IDB_MASK 0x80u
#    define FTFC_FCSESTAT_IDB_SHIFT 7u
#    define FTFC_FCSESTAT_IDB_WIDTH 1u
#    define FTFC_FCSESTAT_IDB(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FCSESTAT_IDB_SHIFT)) & FTFC_FCSESTAT_IDB_MASK)
/* FERSTAT Bit Fields */
#    define FTFC_FERSTAT_DFDIF_MASK 0x2u
#    define FTFC_FERSTAT_DFDIF_SHIFT 1u
#    define FTFC_FERSTAT_DFDIF_WIDTH 1u
#    define FTFC_FERSTAT_DFDIF(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FERSTAT_DFDIF_SHIFT)) & FTFC_FERSTAT_DFDIF_MASK)
/* FERCNFG Bit Fields */
#    define FTFC_FERCNFG_DFDIE_MASK 0x2u
#    define FTFC_FERCNFG_DFDIE_SHIFT 1u
#    define FTFC_FERCNFG_DFDIE_WIDTH 1u
#    define FTFC_FERCNFG_DFDIE(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FERCNFG_DFDIE_SHIFT)) & FTFC_FERCNFG_DFDIE_MASK)
#    define FTFC_FERCNFG_FDFD_MASK 0x20u
#    define FTFC_FERCNFG_FDFD_SHIFT 5u
#    define FTFC_FERCNFG_FDFD_WIDTH 1u
#    define FTFC_FERCNFG_FDFD(x) (((uint8_t)(((uint8_t)(x)) << FTFC_FERCNFG_FDFD_SHIFT)) & FTFC_FERCNFG_FDFD_MASK)

/*!
 * @}
 */ /* end of group FTFC_Register_Masks */

/*!
 * @}
 */ /* end of group FTFC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */

/** FTM - Size of Registers Arrays */
#    define FTM_CONTROLS_COUNT 8u
#    define FTM_CV_MIRROR_COUNT 8u

/** FTM - Register Layout Typedef */
typedef struct
{
    __IO uint32_t SC;  /**< Status And Control, offset: 0x0 */
    __IO uint32_t CNT; /**< Counter, offset: 0x4 */
    __IO uint32_t MOD; /**< Modulo, offset: 0x8 */
    struct
    {                       /* offset: 0xC, array step: 0x8 */
        __IO uint32_t CnSC; /**< Channel (n) Status And Control, array offset: 0xC, array step: 0x8 */
        __IO uint32_t CnV;  /**< Channel (n) Value, array offset: 0x10, array step: 0x8 */
    } CONTROLS[FTM_CONTROLS_COUNT];
    __IO uint32_t CNTIN;         /**< Counter Initial Value, offset: 0x4C */
    __IO uint32_t STATUS;        /**< Capture And Compare Status, offset: 0x50 */
    __IO uint32_t MODE;          /**< Features Mode Selection, offset: 0x54 */
    __IO uint32_t SYNC;          /**< Synchronization, offset: 0x58 */
    __IO uint32_t OUTINIT;       /**< Initial State For Channels Output, offset: 0x5C */
    __IO uint32_t OUTMASK;       /**< Output Mask, offset: 0x60 */
    __IO uint32_t COMBINE;       /**< Function For Linked Channels, offset: 0x64 */
    __IO uint32_t DEADTIME;      /**< Deadtime Configuration, offset: 0x68 */
    __IO uint32_t EXTTRIG;       /**< FTM External Trigger, offset: 0x6C */
    __IO uint32_t POL;           /**< Channels Polarity, offset: 0x70 */
    __IO uint32_t FMS;           /**< Fault Mode Status, offset: 0x74 */
    __IO uint32_t FILTER;        /**< Input Capture Filter Control, offset: 0x78 */
    __IO uint32_t FLTCTRL;       /**< Fault Control, offset: 0x7C */
    __IO uint32_t QDCTRL;        /**< Quadrature Decoder Control And Status, offset: 0x80 */
    __IO uint32_t CONF;          /**< Configuration, offset: 0x84 */
    __IO uint32_t FLTPOL;        /**< FTM Fault Input Polarity, offset: 0x88 */
    __IO uint32_t SYNCONF;       /**< Synchronization Configuration, offset: 0x8C */
    __IO uint32_t INVCTRL;       /**< FTM Inverting Control, offset: 0x90 */
    __IO uint32_t SWOCTRL;       /**< FTM Software Output Control, offset: 0x94 */
    __IO uint32_t PWMLOAD;       /**< FTM PWM Load, offset: 0x98 */
    __IO uint32_t HCR;           /**< Half Cycle Register, offset: 0x9C */
    __IO uint32_t PAIR0DEADTIME; /**< Pair 0 Deadtime Configuration, offset: 0xA0 */
    uint8_t       RESERVED_0[4];
    __IO uint32_t PAIR1DEADTIME; /**< Pair 1 Deadtime Configuration, offset: 0xA8 */
    uint8_t       RESERVED_1[4];
    __IO uint32_t PAIR2DEADTIME; /**< Pair 2 Deadtime Configuration, offset: 0xB0 */
    uint8_t       RESERVED_2[4];
    __IO uint32_t PAIR3DEADTIME; /**< Pair 3 Deadtime Configuration, offset: 0xB8 */
    uint8_t       RESERVED_3[324];
    __IO uint32_t MOD_MIRROR; /**< Mirror of Modulo Value, offset: 0x200 */
    __IO          uint32_t
                  CV_MIRROR[FTM_CV_MIRROR_COUNT]; /**< Mirror of Channel (n) Match Value, array offset: 0x204, array step: 0x4 */
} FTM_Type, *FTM_MemMapPtr;

/** Number of instances of the FTM module. */
#    define FTM_INSTANCE_COUNT (8u)

