OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* FTM - Peripheral instance base addresses */
/** Peripheral FTM0 base address */
#    define FTM0_BASE (0x40038000u)
/** Peripheral FTM0 base pointer */
#    define FTM0 ((FTM_Type*) FTM0_BASE)
/** Peripheral FTM1 base address */
#    define FTM1_BASE (0x40039000u)
/** Peripheral FTM1 base pointer */
#    define FTM1 ((FTM_Type*) FTM1_BASE)
/** Peripheral FTM2 base address */
#    define FTM2_BASE (0x4003A000u)
/** Peripheral FTM2 base pointer */
#    define FTM2 ((FTM_Type*) FTM2_BASE)
/** Peripheral FTM3 base address */
#    define FTM3_BASE (0x40026000u)
/** Peripheral FTM3 base pointer */
#    define FTM3 ((FTM_Type*) FTM3_BASE)
/** Peripheral FTM4 base address */
#    define FTM4_BASE (0x4006E000u)
/** Peripheral FTM4 base pointer */
#    define FTM4 ((FTM_Type*) FTM4_BASE)
/** Peripheral FTM5 base address */
#    define FTM5_BASE (0x4006F000u)
/** Peripheral FTM5 base pointer */
#    define FTM5 ((FTM_Type*) FTM5_BASE)
/** Peripheral FTM6 base address */
#    define FTM6_BASE (0x40070000u)
/** Peripheral FTM6 base pointer */
#    define FTM6 ((FTM_Type*) FTM6_BASE)
/** Peripheral FTM7 base address */
#    define FTM7_BASE (0x40071000u)
/** Peripheral FTM7 base pointer */
#    define FTM7 ((FTM_Type*) FTM7_BASE)
/** Array initializer of FTM peripheral base addresses */
#    define FTM_BASE_ADDRS                                                                         \
        {                                                                                          \
            FTM0_BASE, FTM1_BASE, FTM2_BASE, FTM3_BASE, FTM4_BASE, FTM5_BASE, FTM6_BASE, FTM7_BASE \
        }
/** Array initializer of FTM peripheral base pointers */
#    define FTM_BASE_PTRS                                  \
        {                                                  \
            FTM0, FTM1, FTM2, FTM3, FTM4, FTM5, FTM6, FTM7 \
        }
/** Number of interrupt vector arrays for the FTM module. */
#    define FTM_IRQS_ARR_COUNT (4u)
/** Number of interrupt channels for the FTM module. */
#    define FTM_IRQS_CH_COUNT (8u)
/** Number of interrupt channels for the Fault type of FTM module. */
#    define FTM_Fault_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the Overflow type of FTM module. */
#    define FTM_Overflow_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the Reload type of FTM module. */
#    define FTM_Reload_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the FTM peripheral type */
#    define FTM_IRQS                                                                                           \
        {                                                                                                      \
            {FTM0_Ch0_Ch1_IRQn,                                                                                \
             FTM0_Ch0_Ch1_IRQn,                                                                                \
             FTM0_Ch2_Ch3_IRQn,                                                                                \
             FTM0_Ch2_Ch3_IRQn,                                                                                \
             FTM0_Ch4_Ch5_IRQn,                                                                                \
             FTM0_Ch4_Ch5_IRQn,                                                                                \
             FTM0_Ch6_Ch7_IRQn,                                                                                \
             FTM0_Ch6_Ch7_IRQn},                                                                               \
                {FTM1_Ch0_Ch1_IRQn,                                                                            \
                 FTM1_Ch0_Ch1_IRQn,                                                                            \
                 FTM1_Ch2_Ch3_IRQn,                                                                            \
                 FTM1_Ch2_Ch3_IRQn,                                                                            \
                 FTM1_Ch4_Ch5_IRQn,                                                                            \
                 FTM1_Ch4_Ch5_IRQn,                                                                            \
                 FTM1_Ch6_Ch7_IRQn,                                                                            \
                 FTM1_Ch6_Ch7_IRQn},                                                                           \
                {FTM2_Ch0_Ch1_IRQn,                                                                            \
                 FTM2_Ch0_Ch1_IRQn,                                                                            \
                 FTM2_Ch2_Ch3_IRQn,                                                                            \
                 FTM2_Ch2_Ch3_IRQn,                                                                            \
                 FTM2_Ch4_Ch5_IRQn,                                                                            \
                 FTM2_Ch4_Ch5_IRQn,                                                                            \
                 FTM2_Ch6_Ch7_IRQn,                                                                            \
                 FTM2_Ch6_Ch7_IRQn},                                                                           \
                {FTM3_Ch0_Ch1_IRQn,                                                                            \
                 FTM3_Ch0_Ch1_IRQn,                                                                            \
                 FTM3_Ch2_Ch3_IRQn,                                                                            \
                 FTM3_Ch2_Ch3_IRQn,                                                                            \
                 FTM3_Ch4_Ch5_IRQn,                                                                            \
                 FTM3_Ch4_Ch5_IRQn,                                                                            \
                 FTM3_Ch6_Ch7_IRQn,                                                                            \
                 FTM3_Ch6_Ch7_IRQn},                                                                           \
                {FTM4_Ch0_Ch1_IRQn,                                                                            \
                 FTM4_Ch0_Ch1_IRQn,                                                                            \
                 FTM4_Ch2_Ch3_IRQn,                                                                            \
                 FTM4_Ch2_Ch3_IRQn,                                                                            \
                 FTM4_Ch4_Ch5_IRQn,                                                                            \
                 FTM4_Ch4_Ch5_IRQn,                                                                            \
                 FTM4_Ch6_Ch7_IRQn,                                                                            \
                 FTM4_Ch6_Ch7_IRQn},                                                                           \
                {FTM5_Ch0_Ch1_IRQn,                                                                            \
                 FTM5_Ch0_Ch1_IRQn,                                                                            \
                 FTM5_Ch2_Ch3_IRQn,                                                                            \
                 FTM5_Ch2_Ch3_IRQn,                                                                            \
                 FTM5_Ch4_Ch5_IRQn,                                                                            \
                 FTM5_Ch4_Ch5_IRQn,                                                                            \
                 FTM5_Ch6_Ch7_IRQn,                                                                            \
                 FTM5_Ch6_Ch7_IRQn},                                                                           \
                {FTM6_Ch0_Ch1_IRQn,                                                                            \
                 FTM6_Ch0_Ch1_IRQn,                                                                            \
                 FTM6_Ch2_Ch3_IRQn,                                                                            \
                 FTM6_Ch2_Ch3_IRQn,                                                                            \
                 FTM6_Ch4_Ch5_IRQn,                                                                            \
                 FTM6_Ch4_Ch5_IRQn,                                                                            \
                 FTM6_Ch6_Ch7_IRQn,                                                                            \
                 FTM6_Ch6_Ch7_IRQn},                                                                           \
            {                                                                                                  \
                FTM7_Ch0_Ch1_IRQn, FTM7_Ch0_Ch1_IRQn, FTM7_Ch2_Ch3_IRQn, FTM7_Ch2_Ch3_IRQn, FTM7_Ch4_Ch5_IRQn, \
                    FTM7_Ch4_Ch5_IRQn, FTM7_Ch6_Ch7_IRQn, FTM7_Ch6_Ch7_IRQn                                    \
            }                                                                                                  \
        }
#    define FTM_Fault_IRQS                                                                                        \
        {                                                                                                         \
            FTM0_Fault_IRQn, FTM1_Fault_IRQn, FTM2_Fault_IRQn, FTM3_Fault_IRQn, FTM4_Fault_IRQn, FTM5_Fault_IRQn, \
                FTM6_Fault_IRQn, FTM7_Fault_IRQn                                                                  \
        }
#    define FTM_Overflow_IRQS                                                                          \
        {                                                                                              \
            FTM0_Ovf_Reload_IRQn, FTM1_Ovf_Reload_IRQn, FTM2_Ovf_Reload_IRQn, FTM3_Ovf_Reload_IRQn,    \
                FTM4_Ovf_Reload_IRQn, FTM5_Ovf_Reload_IRQn, FTM6_Ovf_Reload_IRQn, FTM7_Ovf_Reload_IRQn \
        }
#    define FTM_Reload_IRQS                                                                            \
        {                                                                                              \
            FTM0_Ovf_Reload_IRQn, FTM1_Ovf_Reload_IRQn, FTM2_Ovf_Reload_IRQn, FTM3_Ovf_Reload_IRQn,    \
                FTM4_Ovf_Reload_IRQn, FTM5_Ovf_Reload_IRQn, FTM6_Ovf_Reload_IRQn, FTM7_Ovf_Reload_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- FTM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Register_Masks FTM Register Masks
 * @{
 */

