OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* SC Bit Fields */
#    define FTM_SC_PS_MASK 0x7u
#    define FTM_SC_PS_SHIFT 0u
#    define FTM_SC_PS_WIDTH 3u
#    define FTM_SC_PS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PS_SHIFT)) & FTM_SC_PS_MASK)
#    define FTM_SC_CLKS_MASK 0x18u
#    define FTM_SC_CLKS_SHIFT 3u
#    define FTM_SC_CLKS_WIDTH 2u
#    define FTM_SC_CLKS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_CLKS_SHIFT)) & FTM_SC_CLKS_MASK)
#    define FTM_SC_CPWMS_MASK 0x20u
#    define FTM_SC_CPWMS_SHIFT 5u
#    define FTM_SC_CPWMS_WIDTH 1u
#    define FTM_SC_CPWMS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_CPWMS_SHIFT)) & FTM_SC_CPWMS_MASK)
#    define FTM_SC_RIE_MASK 0x40u
#    define FTM_SC_RIE_SHIFT 6u
#    define FTM_SC_RIE_WIDTH 1u
#    define FTM_SC_RIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_RIE_SHIFT)) & FTM_SC_RIE_MASK)
#    define FTM_SC_RF_MASK 0x80u
#    define FTM_SC_RF_SHIFT 7u
#    define FTM_SC_RF_WIDTH 1u
#    define FTM_SC_RF(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_RF_SHIFT)) & FTM_SC_RF_MASK)
#    define FTM_SC_TOIE_MASK 0x100u
#    define FTM_SC_TOIE_SHIFT 8u
#    define FTM_SC_TOIE_WIDTH 1u
#    define FTM_SC_TOIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_TOIE_SHIFT)) & FTM_SC_TOIE_MASK)
#    define FTM_SC_TOF_MASK 0x200u
#    define FTM_SC_TOF_SHIFT 9u
#    define FTM_SC_TOF_WIDTH 1u
#    define FTM_SC_TOF(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_TOF_SHIFT)) & FTM_SC_TOF_MASK)
#    define FTM_SC_PWMEN0_MASK 0x10000u
#    define FTM_SC_PWMEN0_SHIFT 16u
#    define FTM_SC_PWMEN0_WIDTH 1u
#    define FTM_SC_PWMEN0(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN0_SHIFT)) & FTM_SC_PWMEN0_MASK)
#    define FTM_SC_PWMEN1_MASK 0x20000u
#    define FTM_SC_PWMEN1_SHIFT 17u
#    define FTM_SC_PWMEN1_WIDTH 1u
#    define FTM_SC_PWMEN1(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN1_SHIFT)) & FTM_SC_PWMEN1_MASK)
#    define FTM_SC_PWMEN2_MASK 0x40000u
#    define FTM_SC_PWMEN2_SHIFT 18u
#    define FTM_SC_PWMEN2_WIDTH 1u
#    define FTM_SC_PWMEN2(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN2_SHIFT)) & FTM_SC_PWMEN2_MASK)
#    define FTM_SC_PWMEN3_MASK 0x80000u
#    define FTM_SC_PWMEN3_SHIFT 19u
#    define FTM_SC_PWMEN3_WIDTH 1u
#    define FTM_SC_PWMEN3(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN3_SHIFT)) & FTM_SC_PWMEN3_MASK)
#    define FTM_SC_PWMEN4_MASK 0x100000u
#    define FTM_SC_PWMEN4_SHIFT 20u
#    define FTM_SC_PWMEN4_WIDTH 1u
#    define FTM_SC_PWMEN4(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN4_SHIFT)) & FTM_SC_PWMEN4_MASK)
#    define FTM_SC_PWMEN5_MASK 0x200000u
#    define FTM_SC_PWMEN5_SHIFT 21u
#    define FTM_SC_PWMEN5_WIDTH 1u
#    define FTM_SC_PWMEN5(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN5_SHIFT)) & FTM_SC_PWMEN5_MASK)
#    define FTM_SC_PWMEN6_MASK 0x400000u
#    define FTM_SC_PWMEN6_SHIFT 22u
#    define FTM_SC_PWMEN6_WIDTH 1u
#    define FTM_SC_PWMEN6(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN6_SHIFT)) & FTM_SC_PWMEN6_MASK)
#    define FTM_SC_PWMEN7_MASK 0x800000u
#    define FTM_SC_PWMEN7_SHIFT 23u
#    define FTM_SC_PWMEN7_WIDTH 1u
#    define FTM_SC_PWMEN7(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_PWMEN7_SHIFT)) & FTM_SC_PWMEN7_MASK)
#    define FTM_SC_FLTPS_MASK 0xF000000u
#    define FTM_SC_FLTPS_SHIFT 24u
#    define FTM_SC_FLTPS_WIDTH 4u
#    define FTM_SC_FLTPS(x) (((uint32_t)(((uint32_t)(x)) << FTM_SC_FLTPS_SHIFT)) & FTM_SC_FLTPS_MASK)
/* CNT Bit Fields */
#    define FTM_CNT_COUNT_MASK 0xFFFFu
#    define FTM_CNT_COUNT_SHIFT 0u
#    define FTM_CNT_COUNT_WIDTH 16u
#    define FTM_CNT_COUNT(x) (((uint32_t)(((uint32_t)(x)) << FTM_CNT_COUNT_SHIFT)) & FTM_CNT_COUNT_MASK)
/* MOD Bit Fields */
#    define FTM_MOD_MOD_MASK 0xFFFFu
#    define FTM_MOD_MOD_SHIFT 0u
#    define FTM_MOD_MOD_WIDTH 16u
#    define FTM_MOD_MOD(x) (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MOD_SHIFT)) & FTM_MOD_MOD_MASK)
/* CnSC Bit Fields */
#    define FTM_CnSC_DMA_MASK 0x1u
#    define FTM_CnSC_DMA_SHIFT 0u
#    define FTM_CnSC_DMA_WIDTH 1u
#    define FTM_CnSC_DMA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_DMA_SHIFT)) & FTM_CnSC_DMA_MASK)
#    define FTM_CnSC_ICRST_MASK 0x2u
#    define FTM_CnSC_ICRST_SHIFT 1u
#    define FTM_CnSC_ICRST_WIDTH 1u
#    define FTM_CnSC_ICRST(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_ICRST_SHIFT)) & FTM_CnSC_ICRST_MASK)
#    define FTM_CnSC_ELSA_MASK 0x4u
#    define FTM_CnSC_ELSA_SHIFT 2u
#    define FTM_CnSC_ELSA_WIDTH 1u
#    define FTM_CnSC_ELSA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_ELSA_SHIFT)) & FTM_CnSC_ELSA_MASK)
#    define FTM_CnSC_ELSB_MASK 0x8u
#    define FTM_CnSC_ELSB_SHIFT 3u
#    define FTM_CnSC_ELSB_WIDTH 1u
#    define FTM_CnSC_ELSB(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_ELSB_SHIFT)) & FTM_CnSC_ELSB_MASK)
#    define FTM_CnSC_MSA_MASK 0x10u
#    define FTM_CnSC_MSA_SHIFT 4u
#    define FTM_CnSC_MSA_WIDTH 1u
#    define FTM_CnSC_MSA(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_MSA_SHIFT)) & FTM_CnSC_MSA_MASK)
#    define FTM_CnSC_MSB_MASK 0x20u
#    define FTM_CnSC_MSB_SHIFT 5u
#    define FTM_CnSC_MSB_WIDTH 1u
#    define FTM_CnSC_MSB(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_MSB_SHIFT)) & FTM_CnSC_MSB_MASK)
#    define FTM_CnSC_CHIE_MASK 0x40u
#    define FTM_CnSC_CHIE_SHIFT 6u
#    define FTM_CnSC_CHIE_WIDTH 1u
#    define FTM_CnSC_CHIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_CHIE_SHIFT)) & FTM_CnSC_CHIE_MASK)
#    define FTM_CnSC_CHF_MASK 0x80u
#    define FTM_CnSC_CHF_SHIFT 7u
#    define FTM_CnSC_CHF_WIDTH 1u
#    define FTM_CnSC_CHF(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_CHF_SHIFT)) & FTM_CnSC_CHF_MASK)
#    define FTM_CnSC_TRIGMODE_MASK 0x100u
#    define FTM_CnSC_TRIGMODE_SHIFT 8u
#    define FTM_CnSC_TRIGMODE_WIDTH 1u
#    define FTM_CnSC_TRIGMODE(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_TRIGMODE_SHIFT)) & FTM_CnSC_TRIGMODE_MASK)
#    define FTM_CnSC_CHIS_MASK 0x200u
#    define FTM_CnSC_CHIS_SHIFT 9u
#    define FTM_CnSC_CHIS_WIDTH 1u
#    define FTM_CnSC_CHIS(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_CHIS_SHIFT)) & FTM_CnSC_CHIS_MASK)
#    define FTM_CnSC_CHOV_MASK 0x400u
#    define FTM_CnSC_CHOV_SHIFT 10u
#    define FTM_CnSC_CHOV_WIDTH 1u
#    define FTM_CnSC_CHOV(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnSC_CHOV_SHIFT)) & FTM_CnSC_CHOV_MASK)
/* CnV Bit Fields */
#    define FTM_CnV_VAL_MASK 0xFFFFu
#    define FTM_CnV_VAL_SHIFT 0u
#    define FTM_CnV_VAL_WIDTH 16u
#    define FTM_CnV_VAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_CnV_VAL_SHIFT)) & FTM_CnV_VAL_MASK)
/* CNTIN Bit Fields */
#    define FTM_CNTIN_INIT_MASK 0xFFFFu
#    define FTM_CNTIN_INIT_SHIFT 0u
#    define FTM_CNTIN_INIT_WIDTH 16u
#    define FTM_CNTIN_INIT(x) (((uint32_t)(((uint32_t)(x)) << FTM_CNTIN_INIT_SHIFT)) & FTM_CNTIN_INIT_MASK)
/* STATUS Bit Fields */
#    define FTM_STATUS_CH0F_MASK 0x1u
#    define FTM_STATUS_CH0F_SHIFT 0u
#    define FTM_STATUS_CH0F_WIDTH 1u
#    define FTM_STATUS_CH0F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH0F_SHIFT)) & FTM_STATUS_CH0F_MASK)
#    define FTM_STATUS_CH1F_MASK 0x2u
#    define FTM_STATUS_CH1F_SHIFT 1u
#    define FTM_STATUS_CH1F_WIDTH 1u
#    define FTM_STATUS_CH1F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH1F_SHIFT)) & FTM_STATUS_CH1F_MASK)
#    define FTM_STATUS_CH2F_MASK 0x4u
#    define FTM_STATUS_CH2F_SHIFT 2u
#    define FTM_STATUS_CH2F_WIDTH 1u
#    define FTM_STATUS_CH2F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH2F_SHIFT)) & FTM_STATUS_CH2F_MASK)
#    define FTM_STATUS_CH3F_MASK 0x8u
#    define FTM_STATUS_CH3F_SHIFT 3u
#    define FTM_STATUS_CH3F_WIDTH 1u
#    define FTM_STATUS_CH3F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH3F_SHIFT)) & FTM_STATUS_CH3F_MASK)
#    define FTM_STATUS_CH4F_MASK 0x10u
#    define FTM_STATUS_CH4F_SHIFT 4u
#    define FTM_STATUS_CH4F_WIDTH 1u
#    define FTM_STATUS_CH4F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH4F_SHIFT)) & FTM_STATUS_CH4F_MASK)
#    define FTM_STATUS_CH5F_MASK 0x20u
#    define FTM_STATUS_CH5F_SHIFT 5u
#    define FTM_STATUS_CH5F_WIDTH 1u
#    define FTM_STATUS_CH5F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH5F_SHIFT)) & FTM_STATUS_CH5F_MASK)
#    define FTM_STATUS_CH6F_MASK 0x40u
#    define FTM_STATUS_CH6F_SHIFT 6u
#    define FTM_STATUS_CH6F_WIDTH 1u
#    define FTM_STATUS_CH6F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH6F_SHIFT)) & FTM_STATUS_CH6F_MASK)
#    define FTM_STATUS_CH7F_MASK 0x80u
#    define FTM_STATUS_CH7F_SHIFT 7u
#    define FTM_STATUS_CH7F_WIDTH 1u
#    define FTM_STATUS_CH7F(x) (((uint32_t)(((uint32_t)(x)) << FTM_STATUS_CH7F_SHIFT)) & FTM_STATUS_CH7F_MASK)
/* MODE Bit Fields */
#    define FTM_MODE_FTMEN_MASK 0x1u
#    define FTM_MODE_FTMEN_SHIFT 0u
#    define FTM_MODE_FTMEN_WIDTH 1u
#    define FTM_MODE_FTMEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FTMEN_SHIFT)) & FTM_MODE_FTMEN_MASK)
#    define FTM_MODE_INIT_MASK 0x2u
#    define FTM_MODE_INIT_SHIFT 1u
#    define FTM_MODE_INIT_WIDTH 1u
#    define FTM_MODE_INIT(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_INIT_SHIFT)) & FTM_MODE_INIT_MASK)
#    define FTM_MODE_WPDIS_MASK 0x4u
#    define FTM_MODE_WPDIS_SHIFT 2u
#    define FTM_MODE_WPDIS_WIDTH 1u
#    define FTM_MODE_WPDIS(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_WPDIS_SHIFT)) & FTM_MODE_WPDIS_MASK)
#    define FTM_MODE_PWMSYNC_MASK 0x8u
#    define FTM_MODE_PWMSYNC_SHIFT 3u
#    define FTM_MODE_PWMSYNC_WIDTH 1u
#    define FTM_MODE_PWMSYNC(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_PWMSYNC_SHIFT)) & FTM_MODE_PWMSYNC_MASK)
#    define FTM_MODE_CAPTEST_MASK 0x10u
#    define FTM_MODE_CAPTEST_SHIFT 4u
#    define FTM_MODE_CAPTEST_WIDTH 1u
#    define FTM_MODE_CAPTEST(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_CAPTEST_SHIFT)) & FTM_MODE_CAPTEST_MASK)
#    define FTM_MODE_FAULTM_MASK 0x60u
#    define FTM_MODE_FAULTM_SHIFT 5u
#    define FTM_MODE_FAULTM_WIDTH 2u
#    define FTM_MODE_FAULTM(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTM_SHIFT)) & FTM_MODE_FAULTM_MASK)
#    define FTM_MODE_FAULTIE_MASK 0x80u
#    define FTM_MODE_FAULTIE_SHIFT 7u
#    define FTM_MODE_FAULTIE_WIDTH 1u
#    define FTM_MODE_FAULTIE(x) (((uint32_t)(((uint32_t)(x)) << FTM_MODE_FAULTIE_SHIFT)) & FTM_MODE_FAULTIE_MASK)
/* SYNC Bit Fields */
#    define FTM_SYNC_CNTMIN_MASK 0x1u
#    define FTM_SYNC_CNTMIN_SHIFT 0u
#    define FTM_SYNC_CNTMIN_WIDTH 1u
#    define FTM_SYNC_CNTMIN(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMIN_SHIFT)) & FTM_SYNC_CNTMIN_MASK)
#    define FTM_SYNC_CNTMAX_MASK 0x2u
#    define FTM_SYNC_CNTMAX_SHIFT 1u
#    define FTM_SYNC_CNTMAX_WIDTH 1u
#    define FTM_SYNC_CNTMAX(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_CNTMAX_SHIFT)) & FTM_SYNC_CNTMAX_MASK)
#    define FTM_SYNC_REINIT_MASK 0x4u
#    define FTM_SYNC_REINIT_SHIFT 2u
#    define FTM_SYNC_REINIT_WIDTH 1u
#    define FTM_SYNC_REINIT(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_REINIT_SHIFT)) & FTM_SYNC_REINIT_MASK)
#    define FTM_SYNC_SYNCHOM_MASK 0x8u
#    define FTM_SYNC_SYNCHOM_SHIFT 3u
#    define FTM_SYNC_SYNCHOM_WIDTH 1u
#    define FTM_SYNC_SYNCHOM(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_SYNCHOM_SHIFT)) & FTM_SYNC_SYNCHOM_MASK)
#    define FTM_SYNC_TRIG0_MASK 0x10u
#    define FTM_SYNC_TRIG0_SHIFT 4u
#    define FTM_SYNC_TRIG0_WIDTH 1u
#    define FTM_SYNC_TRIG0(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG0_SHIFT)) & FTM_SYNC_TRIG0_MASK)
#    define FTM_SYNC_TRIG1_MASK 0x20u
#    define FTM_SYNC_TRIG1_SHIFT 5u
#    define FTM_SYNC_TRIG1_WIDTH 1u
#    define FTM_SYNC_TRIG1(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG1_SHIFT)) & FTM_SYNC_TRIG1_MASK)
#    define FTM_SYNC_TRIG2_MASK 0x40u
#    define FTM_SYNC_TRIG2_SHIFT 6u
#    define FTM_SYNC_TRIG2_WIDTH 1u
#    define FTM_SYNC_TRIG2(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_TRIG2_SHIFT)) & FTM_SYNC_TRIG2_MASK)
#    define FTM_SYNC_SWSYNC_MASK 0x80u
#    define FTM_SYNC_SWSYNC_SHIFT 7u
#    define FTM_SYNC_SWSYNC_WIDTH 1u
#    define FTM_SYNC_SWSYNC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNC_SWSYNC_SHIFT)) & FTM_SYNC_SWSYNC_MASK)
/* OUTINIT Bit Fields */
#    define FTM_OUTINIT_CH0OI_MASK 0x1u
#    define FTM_OUTINIT_CH0OI_SHIFT 0u
#    define FTM_OUTINIT_CH0OI_WIDTH 1u
#    define FTM_OUTINIT_CH0OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH0OI_SHIFT)) & FTM_OUTINIT_CH0OI_MASK)
#    define FTM_OUTINIT_CH1OI_MASK 0x2u
#    define FTM_OUTINIT_CH1OI_SHIFT 1u
#    define FTM_OUTINIT_CH1OI_WIDTH 1u
#    define FTM_OUTINIT_CH1OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH1OI_SHIFT)) & FTM_OUTINIT_CH1OI_MASK)
#    define FTM_OUTINIT_CH2OI_MASK 0x4u
#    define FTM_OUTINIT_CH2OI_SHIFT 2u
#    define FTM_OUTINIT_CH2OI_WIDTH 1u
#    define FTM_OUTINIT_CH2OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH2OI_SHIFT)) & FTM_OUTINIT_CH2OI_MASK)
#    define FTM_OUTINIT_CH3OI_MASK 0x8u
#    define FTM_OUTINIT_CH3OI_SHIFT 3u
#    define FTM_OUTINIT_CH3OI_WIDTH 1u
#    define FTM_OUTINIT_CH3OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH3OI_SHIFT)) & FTM_OUTINIT_CH3OI_MASK)
#    define FTM_OUTINIT_CH4OI_MASK 0x10u
#    define FTM_OUTINIT_CH4OI_SHIFT 4u
#    define FTM_OUTINIT_CH4OI_WIDTH 1u
#    define FTM_OUTINIT_CH4OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH4OI_SHIFT)) & FTM_OUTINIT_CH4OI_MASK)
#    define FTM_OUTINIT_CH5OI_MASK 0x20u
#    define FTM_OUTINIT_CH5OI_SHIFT 5u
#    define FTM_OUTINIT_CH5OI_WIDTH 1u
#    define FTM_OUTINIT_CH5OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH5OI_SHIFT)) & FTM_OUTINIT_CH5OI_MASK)
#    define FTM_OUTINIT_CH6OI_MASK 0x40u
#    define FTM_OUTINIT_CH6OI_SHIFT 6u
#    define FTM_OUTINIT_CH6OI_WIDTH 1u
#    define FTM_OUTINIT_CH6OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH6OI_SHIFT)) & FTM_OUTINIT_CH6OI_MASK)
#    define FTM_OUTINIT_CH7OI_MASK 0x80u
#    define FTM_OUTINIT_CH7OI_SHIFT 7u
#    define FTM_OUTINIT_CH7OI_WIDTH 1u
#    define FTM_OUTINIT_CH7OI(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTINIT_CH7OI_SHIFT)) & FTM_OUTINIT_CH7OI_MASK)
/* OUTMASK Bit Fields */
#    define FTM_OUTMASK_CH0OM_MASK 0x1u
#    define FTM_OUTMASK_CH0OM_SHIFT 0u
#    define FTM_OUTMASK_CH0OM_WIDTH 1u
#    define FTM_OUTMASK_CH0OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH0OM_SHIFT)) & FTM_OUTMASK_CH0OM_MASK)
#    define FTM_OUTMASK_CH1OM_MASK 0x2u
#    define FTM_OUTMASK_CH1OM_SHIFT 1u
#    define FTM_OUTMASK_CH1OM_WIDTH 1u
#    define FTM_OUTMASK_CH1OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH1OM_SHIFT)) & FTM_OUTMASK_CH1OM_MASK)
#    define FTM_OUTMASK_CH2OM_MASK 0x4u
#    define FTM_OUTMASK_CH2OM_SHIFT 2u
#    define FTM_OUTMASK_CH2OM_WIDTH 1u
#    define FTM_OUTMASK_CH2OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH2OM_SHIFT)) & FTM_OUTMASK_CH2OM_MASK)
#    define FTM_OUTMASK_CH3OM_MASK 0x8u
#    define FTM_OUTMASK_CH3OM_SHIFT 3u
#    define FTM_OUTMASK_CH3OM_WIDTH 1u
#    define FTM_OUTMASK_CH3OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH3OM_SHIFT)) & FTM_OUTMASK_CH3OM_MASK)
#    define FTM_OUTMASK_CH4OM_MASK 0x10u
#    define FTM_OUTMASK_CH4OM_SHIFT 4u
#    define FTM_OUTMASK_CH4OM_WIDTH 1u
#    define FTM_OUTMASK_CH4OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH4OM_SHIFT)) & FTM_OUTMASK_CH4OM_MASK)
#    define FTM_OUTMASK_CH5OM_MASK 0x20u
#    define FTM_OUTMASK_CH5OM_SHIFT 5u
#    define FTM_OUTMASK_CH5OM_WIDTH 1u
#    define FTM_OUTMASK_CH5OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH5OM_SHIFT)) & FTM_OUTMASK_CH5OM_MASK)
#    define FTM_OUTMASK_CH6OM_MASK 0x40u
#    define FTM_OUTMASK_CH6OM_SHIFT 6u
#    define FTM_OUTMASK_CH6OM_WIDTH 1u
#    define FTM_OUTMASK_CH6OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH6OM_SHIFT)) & FTM_OUTMASK_CH6OM_MASK)
#    define FTM_OUTMASK_CH7OM_MASK 0x80u
#    define FTM_OUTMASK_CH7OM_SHIFT 7u
#    define FTM_OUTMASK_CH7OM_WIDTH 1u
#    define FTM_OUTMASK_CH7OM(x) (((uint32_t)(((uint32_t)(x)) << FTM_OUTMASK_CH7OM_SHIFT)) & FTM_OUTMASK_CH7OM_MASK)
/* COMBINE Bit Fields */
#    define FTM_COMBINE_COMBINE0_MASK 0x1u
#    define FTM_COMBINE_COMBINE0_SHIFT 0u
#    define FTM_COMBINE_COMBINE0_WIDTH 1u
#    define FTM_COMBINE_COMBINE0(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE0_SHIFT)) & FTM_COMBINE_COMBINE0_MASK)
#    define FTM_COMBINE_COMP0_MASK 0x2u
#    define FTM_COMBINE_COMP0_SHIFT 1u
#    define FTM_COMBINE_COMP0_WIDTH 1u
#    define FTM_COMBINE_COMP0(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP0_SHIFT)) & FTM_COMBINE_COMP0_MASK)
#    define FTM_COMBINE_DECAPEN0_MASK 0x4u
#    define FTM_COMBINE_DECAPEN0_SHIFT 2u
#    define FTM_COMBINE_DECAPEN0_WIDTH 1u
#    define FTM_COMBINE_DECAPEN0(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN0_SHIFT)) & FTM_COMBINE_DECAPEN0_MASK)
#    define FTM_COMBINE_DECAP0_MASK 0x8u
#    define FTM_COMBINE_DECAP0_SHIFT 3u
#    define FTM_COMBINE_DECAP0_WIDTH 1u
#    define FTM_COMBINE_DECAP0(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP0_SHIFT)) & FTM_COMBINE_DECAP0_MASK)
#    define FTM_COMBINE_DTEN0_MASK 0x10u
#    define FTM_COMBINE_DTEN0_SHIFT 4u
#    define FTM_COMBINE_DTEN0_WIDTH 1u
#    define FTM_COMBINE_DTEN0(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN0_SHIFT)) & FTM_COMBINE_DTEN0_MASK)
#    define FTM_COMBINE_SYNCEN0_MASK 0x20u
#    define FTM_COMBINE_SYNCEN0_SHIFT 5u
#    define FTM_COMBINE_SYNCEN0_WIDTH 1u
#    define FTM_COMBINE_SYNCEN0(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN0_SHIFT)) & FTM_COMBINE_SYNCEN0_MASK)
#    define FTM_COMBINE_FAULTEN0_MASK 0x40u
#    define FTM_COMBINE_FAULTEN0_SHIFT 6u
#    define FTM_COMBINE_FAULTEN0_WIDTH 1u
#    define FTM_COMBINE_FAULTEN0(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN0_SHIFT)) & FTM_COMBINE_FAULTEN0_MASK)
#    define FTM_COMBINE_MCOMBINE0_MASK 0x80u
#    define FTM_COMBINE_MCOMBINE0_SHIFT 7u
#    define FTM_COMBINE_MCOMBINE0_WIDTH 1u
#    define FTM_COMBINE_MCOMBINE0(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE0_SHIFT)) & FTM_COMBINE_MCOMBINE0_MASK)
#    define FTM_COMBINE_COMBINE1_MASK 0x100u
#    define FTM_COMBINE_COMBINE1_SHIFT 8u
#    define FTM_COMBINE_COMBINE1_WIDTH 1u
#    define FTM_COMBINE_COMBINE1(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE1_SHIFT)) & FTM_COMBINE_COMBINE1_MASK)
#    define FTM_COMBINE_COMP1_MASK 0x200u
#    define FTM_COMBINE_COMP1_SHIFT 9u
#    define FTM_COMBINE_COMP1_WIDTH 1u
#    define FTM_COMBINE_COMP1(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP1_SHIFT)) & FTM_COMBINE_COMP1_MASK)
#    define FTM_COMBINE_DECAPEN1_MASK 0x400u
#    define FTM_COMBINE_DECAPEN1_SHIFT 10u
#    define FTM_COMBINE_DECAPEN1_WIDTH 1u
#    define FTM_COMBINE_DECAPEN1(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN1_SHIFT)) & FTM_COMBINE_DECAPEN1_MASK)
#    define FTM_COMBINE_DECAP1_MASK 0x800u
#    define FTM_COMBINE_DECAP1_SHIFT 11u
#    define FTM_COMBINE_DECAP1_WIDTH 1u
#    define FTM_COMBINE_DECAP1(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP1_SHIFT)) & FTM_COMBINE_DECAP1_MASK)
#    define FTM_COMBINE_DTEN1_MASK 0x1000u
#    define FTM_COMBINE_DTEN1_SHIFT 12u
#    define FTM_COMBINE_DTEN1_WIDTH 1u
#    define FTM_COMBINE_DTEN1(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN1_SHIFT)) & FTM_COMBINE_DTEN1_MASK)
#    define FTM_COMBINE_SYNCEN1_MASK 0x2000u
#    define FTM_COMBINE_SYNCEN1_SHIFT 13u
#    define FTM_COMBINE_SYNCEN1_WIDTH 1u
#    define FTM_COMBINE_SYNCEN1(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN1_SHIFT)) & FTM_COMBINE_SYNCEN1_MASK)
#    define FTM_COMBINE_FAULTEN1_MASK 0x4000u
#    define FTM_COMBINE_FAULTEN1_SHIFT 14u
#    define FTM_COMBINE_FAULTEN1_WIDTH 1u
#    define FTM_COMBINE_FAULTEN1(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN1_SHIFT)) & FTM_COMBINE_FAULTEN1_MASK)
#    define FTM_COMBINE_MCOMBINE1_MASK 0x8000u
#    define FTM_COMBINE_MCOMBINE1_SHIFT 15u
#    define FTM_COMBINE_MCOMBINE1_WIDTH 1u
#    define FTM_COMBINE_MCOMBINE1(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE1_SHIFT)) & FTM_COMBINE_MCOMBINE1_MASK)
#    define FTM_COMBINE_COMBINE2_MASK 0x10000u
#    define FTM_COMBINE_COMBINE2_SHIFT 16u
#    define FTM_COMBINE_COMBINE2_WIDTH 1u
#    define FTM_COMBINE_COMBINE2(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE2_SHIFT)) & FTM_COMBINE_COMBINE2_MASK)
#    define FTM_COMBINE_COMP2_MASK 0x20000u
#    define FTM_COMBINE_COMP2_SHIFT 17u
#    define FTM_COMBINE_COMP2_WIDTH 1u
#    define FTM_COMBINE_COMP2(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP2_SHIFT)) & FTM_COMBINE_COMP2_MASK)
#    define FTM_COMBINE_DECAPEN2_MASK 0x40000u
#    define FTM_COMBINE_DECAPEN2_SHIFT 18u
#    define FTM_COMBINE_DECAPEN2_WIDTH 1u
#    define FTM_COMBINE_DECAPEN2(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN2_SHIFT)) & FTM_COMBINE_DECAPEN2_MASK)
#    define FTM_COMBINE_DECAP2_MASK 0x80000u
#    define FTM_COMBINE_DECAP2_SHIFT 19u
#    define FTM_COMBINE_DECAP2_WIDTH 1u
#    define FTM_COMBINE_DECAP2(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP2_SHIFT)) & FTM_COMBINE_DECAP2_MASK)
#    define FTM_COMBINE_DTEN2_MASK 0x100000u
#    define FTM_COMBINE_DTEN2_SHIFT 20u
#    define FTM_COMBINE_DTEN2_WIDTH 1u
#    define FTM_COMBINE_DTEN2(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN2_SHIFT)) & FTM_COMBINE_DTEN2_MASK)
#    define FTM_COMBINE_SYNCEN2_MASK 0x200000u
#    define FTM_COMBINE_SYNCEN2_SHIFT 21u
#    define FTM_COMBINE_SYNCEN2_WIDTH 1u
#    define FTM_COMBINE_SYNCEN2(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN2_SHIFT)) & FTM_COMBINE_SYNCEN2_MASK)
#    define FTM_COMBINE_FAULTEN2_MASK 0x400000u
#    define FTM_COMBINE_FAULTEN2_SHIFT 22u
#    define FTM_COMBINE_FAULTEN2_WIDTH 1u
#    define FTM_COMBINE_FAULTEN2(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN2_SHIFT)) & FTM_COMBINE_FAULTEN2_MASK)
#    define FTM_COMBINE_MCOMBINE2_MASK 0x800000u
#    define FTM_COMBINE_MCOMBINE2_SHIFT 23u
#    define FTM_COMBINE_MCOMBINE2_WIDTH 1u
#    define FTM_COMBINE_MCOMBINE2(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE2_SHIFT)) & FTM_COMBINE_MCOMBINE2_MASK)
#    define FTM_COMBINE_COMBINE3_MASK 0x1000000u
#    define FTM_COMBINE_COMBINE3_SHIFT 24u
#    define FTM_COMBINE_COMBINE3_WIDTH 1u
#    define FTM_COMBINE_COMBINE3(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMBINE3_SHIFT)) & FTM_COMBINE_COMBINE3_MASK)
#    define FTM_COMBINE_COMP3_MASK 0x2000000u
#    define FTM_COMBINE_COMP3_SHIFT 25u
#    define FTM_COMBINE_COMP3_WIDTH 1u
#    define FTM_COMBINE_COMP3(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_COMP3_SHIFT)) & FTM_COMBINE_COMP3_MASK)
#    define FTM_COMBINE_DECAPEN3_MASK 0x4000000u
#    define FTM_COMBINE_DECAPEN3_SHIFT 26u
#    define FTM_COMBINE_DECAPEN3_WIDTH 1u
#    define FTM_COMBINE_DECAPEN3(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAPEN3_SHIFT)) & FTM_COMBINE_DECAPEN3_MASK)
#    define FTM_COMBINE_DECAP3_MASK 0x8000000u
#    define FTM_COMBINE_DECAP3_SHIFT 27u
#    define FTM_COMBINE_DECAP3_WIDTH 1u
#    define FTM_COMBINE_DECAP3(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DECAP3_SHIFT)) & FTM_COMBINE_DECAP3_MASK)
#    define FTM_COMBINE_DTEN3_MASK 0x10000000u
#    define FTM_COMBINE_DTEN3_SHIFT 28u
#    define FTM_COMBINE_DTEN3_WIDTH 1u
#    define FTM_COMBINE_DTEN3(x) (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_DTEN3_SHIFT)) & FTM_COMBINE_DTEN3_MASK)
#    define FTM_COMBINE_SYNCEN3_MASK 0x20000000u
#    define FTM_COMBINE_SYNCEN3_SHIFT 29u
#    define FTM_COMBINE_SYNCEN3_WIDTH 1u
#    define FTM_COMBINE_SYNCEN3(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_SYNCEN3_SHIFT)) & FTM_COMBINE_SYNCEN3_MASK)
#    define FTM_COMBINE_FAULTEN3_MASK 0x40000000u
#    define FTM_COMBINE_FAULTEN3_SHIFT 30u
#    define FTM_COMBINE_FAULTEN3_WIDTH 1u
#    define FTM_COMBINE_FAULTEN3(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_FAULTEN3_SHIFT)) & FTM_COMBINE_FAULTEN3_MASK)
#    define FTM_COMBINE_MCOMBINE3_MASK 0x80000000u
#    define FTM_COMBINE_MCOMBINE3_SHIFT 31u
#    define FTM_COMBINE_MCOMBINE3_WIDTH 1u
#    define FTM_COMBINE_MCOMBINE3(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_COMBINE_MCOMBINE3_SHIFT)) & FTM_COMBINE_MCOMBINE3_MASK)
/* DEADTIME Bit Fields */
#    define FTM_DEADTIME_DTVAL_MASK 0x3Fu
