OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define FTM_DEADTIME_DTVAL_SHIFT 0u
#    define FTM_DEADTIME_DTVAL_WIDTH 6u
#    define FTM_DEADTIME_DTVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTVAL_SHIFT)) & FTM_DEADTIME_DTVAL_MASK)
#    define FTM_DEADTIME_DTPS_MASK 0xC0u
#    define FTM_DEADTIME_DTPS_SHIFT 6u
#    define FTM_DEADTIME_DTPS_WIDTH 2u
#    define FTM_DEADTIME_DTPS(x) (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTPS_SHIFT)) & FTM_DEADTIME_DTPS_MASK)
#    define FTM_DEADTIME_DTVALEX_MASK 0xF0000u
#    define FTM_DEADTIME_DTVALEX_SHIFT 16u
#    define FTM_DEADTIME_DTVALEX_WIDTH 4u
#    define FTM_DEADTIME_DTVALEX(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_DEADTIME_DTVALEX_SHIFT)) & FTM_DEADTIME_DTVALEX_MASK)
/* EXTTRIG Bit Fields */
#    define FTM_EXTTRIG_CH2TRIG_MASK 0x1u
#    define FTM_EXTTRIG_CH2TRIG_SHIFT 0u
#    define FTM_EXTTRIG_CH2TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH2TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH2TRIG_SHIFT)) & FTM_EXTTRIG_CH2TRIG_MASK)
#    define FTM_EXTTRIG_CH3TRIG_MASK 0x2u
#    define FTM_EXTTRIG_CH3TRIG_SHIFT 1u
#    define FTM_EXTTRIG_CH3TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH3TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH3TRIG_SHIFT)) & FTM_EXTTRIG_CH3TRIG_MASK)
#    define FTM_EXTTRIG_CH4TRIG_MASK 0x4u
#    define FTM_EXTTRIG_CH4TRIG_SHIFT 2u
#    define FTM_EXTTRIG_CH4TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH4TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH4TRIG_SHIFT)) & FTM_EXTTRIG_CH4TRIG_MASK)
#    define FTM_EXTTRIG_CH5TRIG_MASK 0x8u
#    define FTM_EXTTRIG_CH5TRIG_SHIFT 3u
#    define FTM_EXTTRIG_CH5TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH5TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH5TRIG_SHIFT)) & FTM_EXTTRIG_CH5TRIG_MASK)
#    define FTM_EXTTRIG_CH0TRIG_MASK 0x10u
#    define FTM_EXTTRIG_CH0TRIG_SHIFT 4u
#    define FTM_EXTTRIG_CH0TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH0TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH0TRIG_SHIFT)) & FTM_EXTTRIG_CH0TRIG_MASK)
#    define FTM_EXTTRIG_CH1TRIG_MASK 0x20u
#    define FTM_EXTTRIG_CH1TRIG_SHIFT 5u
#    define FTM_EXTTRIG_CH1TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH1TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH1TRIG_SHIFT)) & FTM_EXTTRIG_CH1TRIG_MASK)
#    define FTM_EXTTRIG_INITTRIGEN_MASK 0x40u
#    define FTM_EXTTRIG_INITTRIGEN_SHIFT 6u
#    define FTM_EXTTRIG_INITTRIGEN_WIDTH 1u
#    define FTM_EXTTRIG_INITTRIGEN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_INITTRIGEN_SHIFT)) & FTM_EXTTRIG_INITTRIGEN_MASK)
#    define FTM_EXTTRIG_TRIGF_MASK 0x80u
#    define FTM_EXTTRIG_TRIGF_SHIFT 7u
#    define FTM_EXTTRIG_TRIGF_WIDTH 1u
#    define FTM_EXTTRIG_TRIGF(x) (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_TRIGF_SHIFT)) & FTM_EXTTRIG_TRIGF_MASK)
#    define FTM_EXTTRIG_CH6TRIG_MASK 0x100u
#    define FTM_EXTTRIG_CH6TRIG_SHIFT 8u
#    define FTM_EXTTRIG_CH6TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH6TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH6TRIG_SHIFT)) & FTM_EXTTRIG_CH6TRIG_MASK)
#    define FTM_EXTTRIG_CH7TRIG_MASK 0x200u
#    define FTM_EXTTRIG_CH7TRIG_SHIFT 9u
#    define FTM_EXTTRIG_CH7TRIG_WIDTH 1u
#    define FTM_EXTTRIG_CH7TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_EXTTRIG_CH7TRIG_SHIFT)) & FTM_EXTTRIG_CH7TRIG_MASK)
/* POL Bit Fields */
#    define FTM_POL_POL0_MASK 0x1u
#    define FTM_POL_POL0_SHIFT 0u
#    define FTM_POL_POL0_WIDTH 1u
#    define FTM_POL_POL0(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL0_SHIFT)) & FTM_POL_POL0_MASK)
#    define FTM_POL_POL1_MASK 0x2u
#    define FTM_POL_POL1_SHIFT 1u
#    define FTM_POL_POL1_WIDTH 1u
#    define FTM_POL_POL1(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL1_SHIFT)) & FTM_POL_POL1_MASK)
#    define FTM_POL_POL2_MASK 0x4u
#    define FTM_POL_POL2_SHIFT 2u
#    define FTM_POL_POL2_WIDTH 1u
#    define FTM_POL_POL2(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL2_SHIFT)) & FTM_POL_POL2_MASK)
#    define FTM_POL_POL3_MASK 0x8u
#    define FTM_POL_POL3_SHIFT 3u
#    define FTM_POL_POL3_WIDTH 1u
#    define FTM_POL_POL3(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL3_SHIFT)) & FTM_POL_POL3_MASK)
#    define FTM_POL_POL4_MASK 0x10u
#    define FTM_POL_POL4_SHIFT 4u
#    define FTM_POL_POL4_WIDTH 1u
#    define FTM_POL_POL4(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL4_SHIFT)) & FTM_POL_POL4_MASK)
#    define FTM_POL_POL5_MASK 0x20u
#    define FTM_POL_POL5_SHIFT 5u
#    define FTM_POL_POL5_WIDTH 1u
#    define FTM_POL_POL5(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL5_SHIFT)) & FTM_POL_POL5_MASK)
#    define FTM_POL_POL6_MASK 0x40u
#    define FTM_POL_POL6_SHIFT 6u
#    define FTM_POL_POL6_WIDTH 1u
#    define FTM_POL_POL6(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL6_SHIFT)) & FTM_POL_POL6_MASK)
#    define FTM_POL_POL7_MASK 0x80u
#    define FTM_POL_POL7_SHIFT 7u
#    define FTM_POL_POL7_WIDTH 1u
#    define FTM_POL_POL7(x) (((uint32_t)(((uint32_t)(x)) << FTM_POL_POL7_SHIFT)) & FTM_POL_POL7_MASK)
/* FMS Bit Fields */
#    define FTM_FMS_FAULTF0_MASK 0x1u
#    define FTM_FMS_FAULTF0_SHIFT 0u
#    define FTM_FMS_FAULTF0_WIDTH 1u
#    define FTM_FMS_FAULTF0(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF0_SHIFT)) & FTM_FMS_FAULTF0_MASK)
#    define FTM_FMS_FAULTF1_MASK 0x2u
#    define FTM_FMS_FAULTF1_SHIFT 1u
#    define FTM_FMS_FAULTF1_WIDTH 1u
#    define FTM_FMS_FAULTF1(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF1_SHIFT)) & FTM_FMS_FAULTF1_MASK)
#    define FTM_FMS_FAULTF2_MASK 0x4u
#    define FTM_FMS_FAULTF2_SHIFT 2u
#    define FTM_FMS_FAULTF2_WIDTH 1u
#    define FTM_FMS_FAULTF2(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF2_SHIFT)) & FTM_FMS_FAULTF2_MASK)
#    define FTM_FMS_FAULTF3_MASK 0x8u
#    define FTM_FMS_FAULTF3_SHIFT 3u
#    define FTM_FMS_FAULTF3_WIDTH 1u
#    define FTM_FMS_FAULTF3(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF3_SHIFT)) & FTM_FMS_FAULTF3_MASK)
#    define FTM_FMS_FAULTIN_MASK 0x20u
#    define FTM_FMS_FAULTIN_SHIFT 5u
#    define FTM_FMS_FAULTIN_WIDTH 1u
#    define FTM_FMS_FAULTIN(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTIN_SHIFT)) & FTM_FMS_FAULTIN_MASK)
#    define FTM_FMS_WPEN_MASK 0x40u
#    define FTM_FMS_WPEN_SHIFT 6u
#    define FTM_FMS_WPEN_WIDTH 1u
#    define FTM_FMS_WPEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_WPEN_SHIFT)) & FTM_FMS_WPEN_MASK)
#    define FTM_FMS_FAULTF_MASK 0x80u
#    define FTM_FMS_FAULTF_SHIFT 7u
#    define FTM_FMS_FAULTF_WIDTH 1u
#    define FTM_FMS_FAULTF(x) (((uint32_t)(((uint32_t)(x)) << FTM_FMS_FAULTF_SHIFT)) & FTM_FMS_FAULTF_MASK)
/* FILTER Bit Fields */
#    define FTM_FILTER_CH0FVAL_MASK 0xFu
#    define FTM_FILTER_CH0FVAL_SHIFT 0u
#    define FTM_FILTER_CH0FVAL_WIDTH 4u
#    define FTM_FILTER_CH0FVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH0FVAL_SHIFT)) & FTM_FILTER_CH0FVAL_MASK)
#    define FTM_FILTER_CH1FVAL_MASK 0xF0u
#    define FTM_FILTER_CH1FVAL_SHIFT 4u
#    define FTM_FILTER_CH1FVAL_WIDTH 4u
#    define FTM_FILTER_CH1FVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH1FVAL_SHIFT)) & FTM_FILTER_CH1FVAL_MASK)
#    define FTM_FILTER_CH2FVAL_MASK 0xF00u
#    define FTM_FILTER_CH2FVAL_SHIFT 8u
#    define FTM_FILTER_CH2FVAL_WIDTH 4u
#    define FTM_FILTER_CH2FVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH2FVAL_SHIFT)) & FTM_FILTER_CH2FVAL_MASK)
#    define FTM_FILTER_CH3FVAL_MASK 0xF000u
#    define FTM_FILTER_CH3FVAL_SHIFT 12u
#    define FTM_FILTER_CH3FVAL_WIDTH 4u
#    define FTM_FILTER_CH3FVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FILTER_CH3FVAL_SHIFT)) & FTM_FILTER_CH3FVAL_MASK)
/* FLTCTRL Bit Fields */
#    define FTM_FLTCTRL_FAULT0EN_MASK 0x1u
#    define FTM_FLTCTRL_FAULT0EN_SHIFT 0u
#    define FTM_FLTCTRL_FAULT0EN_WIDTH 1u
#    define FTM_FLTCTRL_FAULT0EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT0EN_SHIFT)) & FTM_FLTCTRL_FAULT0EN_MASK)
#    define FTM_FLTCTRL_FAULT1EN_MASK 0x2u
#    define FTM_FLTCTRL_FAULT1EN_SHIFT 1u
#    define FTM_FLTCTRL_FAULT1EN_WIDTH 1u
#    define FTM_FLTCTRL_FAULT1EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT1EN_SHIFT)) & FTM_FLTCTRL_FAULT1EN_MASK)
#    define FTM_FLTCTRL_FAULT2EN_MASK 0x4u
#    define FTM_FLTCTRL_FAULT2EN_SHIFT 2u
#    define FTM_FLTCTRL_FAULT2EN_WIDTH 1u
#    define FTM_FLTCTRL_FAULT2EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT2EN_SHIFT)) & FTM_FLTCTRL_FAULT2EN_MASK)
#    define FTM_FLTCTRL_FAULT3EN_MASK 0x8u
#    define FTM_FLTCTRL_FAULT3EN_SHIFT 3u
#    define FTM_FLTCTRL_FAULT3EN_WIDTH 1u
#    define FTM_FLTCTRL_FAULT3EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FAULT3EN_SHIFT)) & FTM_FLTCTRL_FAULT3EN_MASK)
#    define FTM_FLTCTRL_FFLTR0EN_MASK 0x10u
#    define FTM_FLTCTRL_FFLTR0EN_SHIFT 4u
#    define FTM_FLTCTRL_FFLTR0EN_WIDTH 1u
#    define FTM_FLTCTRL_FFLTR0EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR0EN_SHIFT)) & FTM_FLTCTRL_FFLTR0EN_MASK)
#    define FTM_FLTCTRL_FFLTR1EN_MASK 0x20u
#    define FTM_FLTCTRL_FFLTR1EN_SHIFT 5u
#    define FTM_FLTCTRL_FFLTR1EN_WIDTH 1u
#    define FTM_FLTCTRL_FFLTR1EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR1EN_SHIFT)) & FTM_FLTCTRL_FFLTR1EN_MASK)
#    define FTM_FLTCTRL_FFLTR2EN_MASK 0x40u
#    define FTM_FLTCTRL_FFLTR2EN_SHIFT 6u
#    define FTM_FLTCTRL_FFLTR2EN_WIDTH 1u
#    define FTM_FLTCTRL_FFLTR2EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR2EN_SHIFT)) & FTM_FLTCTRL_FFLTR2EN_MASK)
#    define FTM_FLTCTRL_FFLTR3EN_MASK 0x80u
#    define FTM_FLTCTRL_FFLTR3EN_SHIFT 7u
#    define FTM_FLTCTRL_FFLTR3EN_WIDTH 1u
#    define FTM_FLTCTRL_FFLTR3EN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFLTR3EN_SHIFT)) & FTM_FLTCTRL_FFLTR3EN_MASK)
#    define FTM_FLTCTRL_FFVAL_MASK 0xF00u
#    define FTM_FLTCTRL_FFVAL_SHIFT 8u
#    define FTM_FLTCTRL_FFVAL_WIDTH 4u
#    define FTM_FLTCTRL_FFVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FFVAL_SHIFT)) & FTM_FLTCTRL_FFVAL_MASK)
#    define FTM_FLTCTRL_FSTATE_MASK 0x8000u
#    define FTM_FLTCTRL_FSTATE_SHIFT 15u
#    define FTM_FLTCTRL_FSTATE_WIDTH 1u
#    define FTM_FLTCTRL_FSTATE(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTCTRL_FSTATE_SHIFT)) & FTM_FLTCTRL_FSTATE_MASK)
/* QDCTRL Bit Fields */
#    define FTM_QDCTRL_QUADEN_MASK 0x1u
#    define FTM_QDCTRL_QUADEN_SHIFT 0u
#    define FTM_QDCTRL_QUADEN_WIDTH 1u
#    define FTM_QDCTRL_QUADEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADEN_SHIFT)) & FTM_QDCTRL_QUADEN_MASK)
#    define FTM_QDCTRL_TOFDIR_MASK 0x2u
#    define FTM_QDCTRL_TOFDIR_SHIFT 1u
#    define FTM_QDCTRL_TOFDIR_WIDTH 1u
#    define FTM_QDCTRL_TOFDIR(x) (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_TOFDIR_SHIFT)) & FTM_QDCTRL_TOFDIR_MASK)
#    define FTM_QDCTRL_QUADIR_MASK 0x4u
#    define FTM_QDCTRL_QUADIR_SHIFT 2u
#    define FTM_QDCTRL_QUADIR_WIDTH 1u
#    define FTM_QDCTRL_QUADIR(x) (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADIR_SHIFT)) & FTM_QDCTRL_QUADIR_MASK)
#    define FTM_QDCTRL_QUADMODE_MASK 0x8u
#    define FTM_QDCTRL_QUADMODE_SHIFT 3u
#    define FTM_QDCTRL_QUADMODE_WIDTH 1u
#    define FTM_QDCTRL_QUADMODE(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_QUADMODE_SHIFT)) & FTM_QDCTRL_QUADMODE_MASK)
#    define FTM_QDCTRL_PHBPOL_MASK 0x10u
#    define FTM_QDCTRL_PHBPOL_SHIFT 4u
#    define FTM_QDCTRL_PHBPOL_WIDTH 1u
#    define FTM_QDCTRL_PHBPOL(x) (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHBPOL_SHIFT)) & FTM_QDCTRL_PHBPOL_MASK)
#    define FTM_QDCTRL_PHAPOL_MASK 0x20u
#    define FTM_QDCTRL_PHAPOL_SHIFT 5u
#    define FTM_QDCTRL_PHAPOL_WIDTH 1u
#    define FTM_QDCTRL_PHAPOL(x) (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHAPOL_SHIFT)) & FTM_QDCTRL_PHAPOL_MASK)
#    define FTM_QDCTRL_PHBFLTREN_MASK 0x40u
#    define FTM_QDCTRL_PHBFLTREN_SHIFT 6u
#    define FTM_QDCTRL_PHBFLTREN_WIDTH 1u
#    define FTM_QDCTRL_PHBFLTREN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHBFLTREN_SHIFT)) & FTM_QDCTRL_PHBFLTREN_MASK)
#    define FTM_QDCTRL_PHAFLTREN_MASK 0x80u
#    define FTM_QDCTRL_PHAFLTREN_SHIFT 7u
#    define FTM_QDCTRL_PHAFLTREN_WIDTH 1u
#    define FTM_QDCTRL_PHAFLTREN(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_QDCTRL_PHAFLTREN_SHIFT)) & FTM_QDCTRL_PHAFLTREN_MASK)
/* CONF Bit Fields */
#    define FTM_CONF_LDFQ_MASK 0x1Fu
#    define FTM_CONF_LDFQ_SHIFT 0u
#    define FTM_CONF_LDFQ_WIDTH 5u
#    define FTM_CONF_LDFQ(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_LDFQ_SHIFT)) & FTM_CONF_LDFQ_MASK)
#    define FTM_CONF_BDMMODE_MASK 0xC0u
#    define FTM_CONF_BDMMODE_SHIFT 6u
#    define FTM_CONF_BDMMODE_WIDTH 2u
#    define FTM_CONF_BDMMODE(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_BDMMODE_SHIFT)) & FTM_CONF_BDMMODE_MASK)
#    define FTM_CONF_GTBEEN_MASK 0x200u
#    define FTM_CONF_GTBEEN_SHIFT 9u
#    define FTM_CONF_GTBEEN_WIDTH 1u
#    define FTM_CONF_GTBEEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_GTBEEN_SHIFT)) & FTM_CONF_GTBEEN_MASK)
#    define FTM_CONF_GTBEOUT_MASK 0x400u
#    define FTM_CONF_GTBEOUT_SHIFT 10u
#    define FTM_CONF_GTBEOUT_WIDTH 1u
#    define FTM_CONF_GTBEOUT(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_GTBEOUT_SHIFT)) & FTM_CONF_GTBEOUT_MASK)
#    define FTM_CONF_ITRIGR_MASK 0x800u
#    define FTM_CONF_ITRIGR_SHIFT 11u
#    define FTM_CONF_ITRIGR_WIDTH 1u
#    define FTM_CONF_ITRIGR(x) (((uint32_t)(((uint32_t)(x)) << FTM_CONF_ITRIGR_SHIFT)) & FTM_CONF_ITRIGR_MASK)
/* FLTPOL Bit Fields */
#    define FTM_FLTPOL_FLT0POL_MASK 0x1u
#    define FTM_FLTPOL_FLT0POL_SHIFT 0u
#    define FTM_FLTPOL_FLT0POL_WIDTH 1u
#    define FTM_FLTPOL_FLT0POL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT0POL_SHIFT)) & FTM_FLTPOL_FLT0POL_MASK)
#    define FTM_FLTPOL_FLT1POL_MASK 0x2u
#    define FTM_FLTPOL_FLT1POL_SHIFT 1u
#    define FTM_FLTPOL_FLT1POL_WIDTH 1u
#    define FTM_FLTPOL_FLT1POL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT1POL_SHIFT)) & FTM_FLTPOL_FLT1POL_MASK)
#    define FTM_FLTPOL_FLT2POL_MASK 0x4u
#    define FTM_FLTPOL_FLT2POL_SHIFT 2u
#    define FTM_FLTPOL_FLT2POL_WIDTH 1u
#    define FTM_FLTPOL_FLT2POL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT2POL_SHIFT)) & FTM_FLTPOL_FLT2POL_MASK)
#    define FTM_FLTPOL_FLT3POL_MASK 0x8u
#    define FTM_FLTPOL_FLT3POL_SHIFT 3u
#    define FTM_FLTPOL_FLT3POL_WIDTH 1u
#    define FTM_FLTPOL_FLT3POL(x) (((uint32_t)(((uint32_t)(x)) << FTM_FLTPOL_FLT3POL_SHIFT)) & FTM_FLTPOL_FLT3POL_MASK)
/* SYNCONF Bit Fields */
#    define FTM_SYNCONF_HWTRIGMODE_MASK 0x1u
#    define FTM_SYNCONF_HWTRIGMODE_SHIFT 0u
#    define FTM_SYNCONF_HWTRIGMODE_WIDTH 1u
#    define FTM_SYNCONF_HWTRIGMODE(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWTRIGMODE_SHIFT)) & FTM_SYNCONF_HWTRIGMODE_MASK)
#    define FTM_SYNCONF_CNTINC_MASK 0x4u
#    define FTM_SYNCONF_CNTINC_SHIFT 2u
#    define FTM_SYNCONF_CNTINC_WIDTH 1u
#    define FTM_SYNCONF_CNTINC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_CNTINC_SHIFT)) & FTM_SYNCONF_CNTINC_MASK)
#    define FTM_SYNCONF_INVC_MASK 0x10u
#    define FTM_SYNCONF_INVC_SHIFT 4u
#    define FTM_SYNCONF_INVC_WIDTH 1u
#    define FTM_SYNCONF_INVC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_INVC_SHIFT)) & FTM_SYNCONF_INVC_MASK)
#    define FTM_SYNCONF_SWOC_MASK 0x20u
#    define FTM_SYNCONF_SWOC_SHIFT 5u
#    define FTM_SYNCONF_SWOC_WIDTH 1u
#    define FTM_SYNCONF_SWOC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWOC_SHIFT)) & FTM_SYNCONF_SWOC_MASK)
#    define FTM_SYNCONF_SYNCMODE_MASK 0x80u
#    define FTM_SYNCONF_SYNCMODE_SHIFT 7u
#    define FTM_SYNCONF_SYNCMODE_WIDTH 1u
#    define FTM_SYNCONF_SYNCMODE(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SYNCMODE_SHIFT)) & FTM_SYNCONF_SYNCMODE_MASK)
#    define FTM_SYNCONF_SWRSTCNT_MASK 0x100u
#    define FTM_SYNCONF_SWRSTCNT_SHIFT 8u
#    define FTM_SYNCONF_SWRSTCNT_WIDTH 1u
#    define FTM_SYNCONF_SWRSTCNT(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWRSTCNT_SHIFT)) & FTM_SYNCONF_SWRSTCNT_MASK)
#    define FTM_SYNCONF_SWWRBUF_MASK 0x200u
#    define FTM_SYNCONF_SWWRBUF_SHIFT 9u
#    define FTM_SYNCONF_SWWRBUF_WIDTH 1u
#    define FTM_SYNCONF_SWWRBUF(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWWRBUF_SHIFT)) & FTM_SYNCONF_SWWRBUF_MASK)
#    define FTM_SYNCONF_SWOM_MASK 0x400u
#    define FTM_SYNCONF_SWOM_SHIFT 10u
#    define FTM_SYNCONF_SWOM_WIDTH 1u
#    define FTM_SYNCONF_SWOM(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWOM_SHIFT)) & FTM_SYNCONF_SWOM_MASK)
#    define FTM_SYNCONF_SWINVC_MASK 0x800u
#    define FTM_SYNCONF_SWINVC_SHIFT 11u
#    define FTM_SYNCONF_SWINVC_WIDTH 1u
#    define FTM_SYNCONF_SWINVC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWINVC_SHIFT)) & FTM_SYNCONF_SWINVC_MASK)
#    define FTM_SYNCONF_SWSOC_MASK 0x1000u
#    define FTM_SYNCONF_SWSOC_SHIFT 12u
#    define FTM_SYNCONF_SWSOC_WIDTH 1u
#    define FTM_SYNCONF_SWSOC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_SWSOC_SHIFT)) & FTM_SYNCONF_SWSOC_MASK)
#    define FTM_SYNCONF_HWRSTCNT_MASK 0x10000u
#    define FTM_SYNCONF_HWRSTCNT_SHIFT 16u
#    define FTM_SYNCONF_HWRSTCNT_WIDTH 1u
#    define FTM_SYNCONF_HWRSTCNT(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWRSTCNT_SHIFT)) & FTM_SYNCONF_HWRSTCNT_MASK)
#    define FTM_SYNCONF_HWWRBUF_MASK 0x20000u
#    define FTM_SYNCONF_HWWRBUF_SHIFT 17u
#    define FTM_SYNCONF_HWWRBUF_WIDTH 1u
#    define FTM_SYNCONF_HWWRBUF(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWWRBUF_SHIFT)) & FTM_SYNCONF_HWWRBUF_MASK)
#    define FTM_SYNCONF_HWOM_MASK 0x40000u
#    define FTM_SYNCONF_HWOM_SHIFT 18u
#    define FTM_SYNCONF_HWOM_WIDTH 1u
#    define FTM_SYNCONF_HWOM(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWOM_SHIFT)) & FTM_SYNCONF_HWOM_MASK)
#    define FTM_SYNCONF_HWINVC_MASK 0x80000u
#    define FTM_SYNCONF_HWINVC_SHIFT 19u
#    define FTM_SYNCONF_HWINVC_WIDTH 1u
#    define FTM_SYNCONF_HWINVC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWINVC_SHIFT)) & FTM_SYNCONF_HWINVC_MASK)
#    define FTM_SYNCONF_HWSOC_MASK 0x100000u
#    define FTM_SYNCONF_HWSOC_SHIFT 20u
#    define FTM_SYNCONF_HWSOC_WIDTH 1u
#    define FTM_SYNCONF_HWSOC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SYNCONF_HWSOC_SHIFT)) & FTM_SYNCONF_HWSOC_MASK)
/* INVCTRL Bit Fields */
#    define FTM_INVCTRL_INV0EN_MASK 0x1u
#    define FTM_INVCTRL_INV0EN_SHIFT 0u
#    define FTM_INVCTRL_INV0EN_WIDTH 1u
#    define FTM_INVCTRL_INV0EN(x) (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV0EN_SHIFT)) & FTM_INVCTRL_INV0EN_MASK)
#    define FTM_INVCTRL_INV1EN_MASK 0x2u
#    define FTM_INVCTRL_INV1EN_SHIFT 1u
#    define FTM_INVCTRL_INV1EN_WIDTH 1u
#    define FTM_INVCTRL_INV1EN(x) (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV1EN_SHIFT)) & FTM_INVCTRL_INV1EN_MASK)
#    define FTM_INVCTRL_INV2EN_MASK 0x4u
#    define FTM_INVCTRL_INV2EN_SHIFT 2u
#    define FTM_INVCTRL_INV2EN_WIDTH 1u
#    define FTM_INVCTRL_INV2EN(x) (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV2EN_SHIFT)) & FTM_INVCTRL_INV2EN_MASK)
#    define FTM_INVCTRL_INV3EN_MASK 0x8u
#    define FTM_INVCTRL_INV3EN_SHIFT 3u
#    define FTM_INVCTRL_INV3EN_WIDTH 1u
#    define FTM_INVCTRL_INV3EN(x) (((uint32_t)(((uint32_t)(x)) << FTM_INVCTRL_INV3EN_SHIFT)) & FTM_INVCTRL_INV3EN_MASK)
/* SWOCTRL Bit Fields */
#    define FTM_SWOCTRL_CH0OC_MASK 0x1u
#    define FTM_SWOCTRL_CH0OC_SHIFT 0u
#    define FTM_SWOCTRL_CH0OC_WIDTH 1u
#    define FTM_SWOCTRL_CH0OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH0OC_SHIFT)) & FTM_SWOCTRL_CH0OC_MASK)
#    define FTM_SWOCTRL_CH1OC_MASK 0x2u
#    define FTM_SWOCTRL_CH1OC_SHIFT 1u
#    define FTM_SWOCTRL_CH1OC_WIDTH 1u
#    define FTM_SWOCTRL_CH1OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH1OC_SHIFT)) & FTM_SWOCTRL_CH1OC_MASK)
#    define FTM_SWOCTRL_CH2OC_MASK 0x4u
#    define FTM_SWOCTRL_CH2OC_SHIFT 2u
#    define FTM_SWOCTRL_CH2OC_WIDTH 1u
#    define FTM_SWOCTRL_CH2OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH2OC_SHIFT)) & FTM_SWOCTRL_CH2OC_MASK)
#    define FTM_SWOCTRL_CH3OC_MASK 0x8u
#    define FTM_SWOCTRL_CH3OC_SHIFT 3u
#    define FTM_SWOCTRL_CH3OC_WIDTH 1u
#    define FTM_SWOCTRL_CH3OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH3OC_SHIFT)) & FTM_SWOCTRL_CH3OC_MASK)
#    define FTM_SWOCTRL_CH4OC_MASK 0x10u
#    define FTM_SWOCTRL_CH4OC_SHIFT 4u
#    define FTM_SWOCTRL_CH4OC_WIDTH 1u
#    define FTM_SWOCTRL_CH4OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH4OC_SHIFT)) & FTM_SWOCTRL_CH4OC_MASK)
#    define FTM_SWOCTRL_CH5OC_MASK 0x20u
#    define FTM_SWOCTRL_CH5OC_SHIFT 5u
#    define FTM_SWOCTRL_CH5OC_WIDTH 1u
#    define FTM_SWOCTRL_CH5OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH5OC_SHIFT)) & FTM_SWOCTRL_CH5OC_MASK)
#    define FTM_SWOCTRL_CH6OC_MASK 0x40u
#    define FTM_SWOCTRL_CH6OC_SHIFT 6u
#    define FTM_SWOCTRL_CH6OC_WIDTH 1u
#    define FTM_SWOCTRL_CH6OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH6OC_SHIFT)) & FTM_SWOCTRL_CH6OC_MASK)
#    define FTM_SWOCTRL_CH7OC_MASK 0x80u
#    define FTM_SWOCTRL_CH7OC_SHIFT 7u
#    define FTM_SWOCTRL_CH7OC_WIDTH 1u
#    define FTM_SWOCTRL_CH7OC(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH7OC_SHIFT)) & FTM_SWOCTRL_CH7OC_MASK)
#    define FTM_SWOCTRL_CH0OCV_MASK 0x100u
#    define FTM_SWOCTRL_CH0OCV_SHIFT 8u
#    define FTM_SWOCTRL_CH0OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH0OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH0OCV_SHIFT)) & FTM_SWOCTRL_CH0OCV_MASK)
#    define FTM_SWOCTRL_CH1OCV_MASK 0x200u
#    define FTM_SWOCTRL_CH1OCV_SHIFT 9u
#    define FTM_SWOCTRL_CH1OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH1OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH1OCV_SHIFT)) & FTM_SWOCTRL_CH1OCV_MASK)
#    define FTM_SWOCTRL_CH2OCV_MASK 0x400u
#    define FTM_SWOCTRL_CH2OCV_SHIFT 10u
#    define FTM_SWOCTRL_CH2OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH2OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH2OCV_SHIFT)) & FTM_SWOCTRL_CH2OCV_MASK)
#    define FTM_SWOCTRL_CH3OCV_MASK 0x800u
#    define FTM_SWOCTRL_CH3OCV_SHIFT 11u
#    define FTM_SWOCTRL_CH3OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH3OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH3OCV_SHIFT)) & FTM_SWOCTRL_CH3OCV_MASK)
#    define FTM_SWOCTRL_CH4OCV_MASK 0x1000u
#    define FTM_SWOCTRL_CH4OCV_SHIFT 12u
#    define FTM_SWOCTRL_CH4OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH4OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH4OCV_SHIFT)) & FTM_SWOCTRL_CH4OCV_MASK)
#    define FTM_SWOCTRL_CH5OCV_MASK 0x2000u
#    define FTM_SWOCTRL_CH5OCV_SHIFT 13u
#    define FTM_SWOCTRL_CH5OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH5OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH5OCV_SHIFT)) & FTM_SWOCTRL_CH5OCV_MASK)
#    define FTM_SWOCTRL_CH6OCV_MASK 0x4000u
#    define FTM_SWOCTRL_CH6OCV_SHIFT 14u
#    define FTM_SWOCTRL_CH6OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH6OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH6OCV_SHIFT)) & FTM_SWOCTRL_CH6OCV_MASK)
#    define FTM_SWOCTRL_CH7OCV_MASK 0x8000u
#    define FTM_SWOCTRL_CH7OCV_SHIFT 15u
#    define FTM_SWOCTRL_CH7OCV_WIDTH 1u
#    define FTM_SWOCTRL_CH7OCV(x) (((uint32_t)(((uint32_t)(x)) << FTM_SWOCTRL_CH7OCV_SHIFT)) & FTM_SWOCTRL_CH7OCV_MASK)
/* PWMLOAD Bit Fields */
#    define FTM_PWMLOAD_CH0SEL_MASK 0x1u
#    define FTM_PWMLOAD_CH0SEL_SHIFT 0u
#    define FTM_PWMLOAD_CH0SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH0SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH0SEL_SHIFT)) & FTM_PWMLOAD_CH0SEL_MASK)
#    define FTM_PWMLOAD_CH1SEL_MASK 0x2u
#    define FTM_PWMLOAD_CH1SEL_SHIFT 1u
#    define FTM_PWMLOAD_CH1SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH1SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH1SEL_SHIFT)) & FTM_PWMLOAD_CH1SEL_MASK)
#    define FTM_PWMLOAD_CH2SEL_MASK 0x4u
#    define FTM_PWMLOAD_CH2SEL_SHIFT 2u
#    define FTM_PWMLOAD_CH2SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH2SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH2SEL_SHIFT)) & FTM_PWMLOAD_CH2SEL_MASK)
#    define FTM_PWMLOAD_CH3SEL_MASK 0x8u
#    define FTM_PWMLOAD_CH3SEL_SHIFT 3u
#    define FTM_PWMLOAD_CH3SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH3SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH3SEL_SHIFT)) & FTM_PWMLOAD_CH3SEL_MASK)
#    define FTM_PWMLOAD_CH4SEL_MASK 0x10u
#    define FTM_PWMLOAD_CH4SEL_SHIFT 4u
#    define FTM_PWMLOAD_CH4SEL_WIDTH 1u
