OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define FTM_PWMLOAD_CH4SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH4SEL_SHIFT)) & FTM_PWMLOAD_CH4SEL_MASK)
#    define FTM_PWMLOAD_CH5SEL_MASK 0x20u
#    define FTM_PWMLOAD_CH5SEL_SHIFT 5u
#    define FTM_PWMLOAD_CH5SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH5SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH5SEL_SHIFT)) & FTM_PWMLOAD_CH5SEL_MASK)
#    define FTM_PWMLOAD_CH6SEL_MASK 0x40u
#    define FTM_PWMLOAD_CH6SEL_SHIFT 6u
#    define FTM_PWMLOAD_CH6SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH6SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH6SEL_SHIFT)) & FTM_PWMLOAD_CH6SEL_MASK)
#    define FTM_PWMLOAD_CH7SEL_MASK 0x80u
#    define FTM_PWMLOAD_CH7SEL_SHIFT 7u
#    define FTM_PWMLOAD_CH7SEL_WIDTH 1u
#    define FTM_PWMLOAD_CH7SEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_CH7SEL_SHIFT)) & FTM_PWMLOAD_CH7SEL_MASK)
#    define FTM_PWMLOAD_HCSEL_MASK 0x100u
#    define FTM_PWMLOAD_HCSEL_SHIFT 8u
#    define FTM_PWMLOAD_HCSEL_WIDTH 1u
#    define FTM_PWMLOAD_HCSEL(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_HCSEL_SHIFT)) & FTM_PWMLOAD_HCSEL_MASK)
#    define FTM_PWMLOAD_LDOK_MASK 0x200u
#    define FTM_PWMLOAD_LDOK_SHIFT 9u
#    define FTM_PWMLOAD_LDOK_WIDTH 1u
#    define FTM_PWMLOAD_LDOK(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_LDOK_SHIFT)) & FTM_PWMLOAD_LDOK_MASK)
#    define FTM_PWMLOAD_GLEN_MASK 0x400u
#    define FTM_PWMLOAD_GLEN_SHIFT 10u
#    define FTM_PWMLOAD_GLEN_WIDTH 1u
#    define FTM_PWMLOAD_GLEN(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_GLEN_SHIFT)) & FTM_PWMLOAD_GLEN_MASK)
#    define FTM_PWMLOAD_GLDOK_MASK 0x800u
#    define FTM_PWMLOAD_GLDOK_SHIFT 11u
#    define FTM_PWMLOAD_GLDOK_WIDTH 1u
#    define FTM_PWMLOAD_GLDOK(x) (((uint32_t)(((uint32_t)(x)) << FTM_PWMLOAD_GLDOK_SHIFT)) & FTM_PWMLOAD_GLDOK_MASK)
/* HCR Bit Fields */
#    define FTM_HCR_HCVAL_MASK 0xFFFFu
#    define FTM_HCR_HCVAL_SHIFT 0u
#    define FTM_HCR_HCVAL_WIDTH 16u
#    define FTM_HCR_HCVAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_HCR_HCVAL_SHIFT)) & FTM_HCR_HCVAL_MASK)
/* PAIR0DEADTIME Bit Fields */
#    define FTM_PAIR0DEADTIME_DTVAL_MASK 0x3Fu
#    define FTM_PAIR0DEADTIME_DTVAL_SHIFT 0u
#    define FTM_PAIR0DEADTIME_DTVAL_WIDTH 6u
#    define FTM_PAIR0DEADTIME_DTVAL(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTVAL_SHIFT)) & FTM_PAIR0DEADTIME_DTVAL_MASK)
#    define FTM_PAIR0DEADTIME_DTPS_MASK 0xC0u
#    define FTM_PAIR0DEADTIME_DTPS_SHIFT 6u
#    define FTM_PAIR0DEADTIME_DTPS_WIDTH 2u
#    define FTM_PAIR0DEADTIME_DTPS(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTPS_SHIFT)) & FTM_PAIR0DEADTIME_DTPS_MASK)
#    define FTM_PAIR0DEADTIME_DTVALEX_MASK 0xF0000u
#    define FTM_PAIR0DEADTIME_DTVALEX_SHIFT 16u
#    define FTM_PAIR0DEADTIME_DTVALEX_WIDTH 4u
#    define FTM_PAIR0DEADTIME_DTVALEX(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR0DEADTIME_DTVALEX_SHIFT)) & FTM_PAIR0DEADTIME_DTVALEX_MASK)
/* PAIR1DEADTIME Bit Fields */
#    define FTM_PAIR1DEADTIME_DTVAL_MASK 0x3Fu
#    define FTM_PAIR1DEADTIME_DTVAL_SHIFT 0u
#    define FTM_PAIR1DEADTIME_DTVAL_WIDTH 6u
#    define FTM_PAIR1DEADTIME_DTVAL(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTVAL_SHIFT)) & FTM_PAIR1DEADTIME_DTVAL_MASK)
#    define FTM_PAIR1DEADTIME_DTPS_MASK 0xC0u
#    define FTM_PAIR1DEADTIME_DTPS_SHIFT 6u
#    define FTM_PAIR1DEADTIME_DTPS_WIDTH 2u
#    define FTM_PAIR1DEADTIME_DTPS(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTPS_SHIFT)) & FTM_PAIR1DEADTIME_DTPS_MASK)
#    define FTM_PAIR1DEADTIME_DTVALEX_MASK 0xF0000u
#    define FTM_PAIR1DEADTIME_DTVALEX_SHIFT 16u
#    define FTM_PAIR1DEADTIME_DTVALEX_WIDTH 4u
#    define FTM_PAIR1DEADTIME_DTVALEX(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR1DEADTIME_DTVALEX_SHIFT)) & FTM_PAIR1DEADTIME_DTVALEX_MASK)
/* PAIR2DEADTIME Bit Fields */
#    define FTM_PAIR2DEADTIME_DTVAL_MASK 0x3Fu
#    define FTM_PAIR2DEADTIME_DTVAL_SHIFT 0u
#    define FTM_PAIR2DEADTIME_DTVAL_WIDTH 6u
#    define FTM_PAIR2DEADTIME_DTVAL(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTVAL_SHIFT)) & FTM_PAIR2DEADTIME_DTVAL_MASK)
#    define FTM_PAIR2DEADTIME_DTPS_MASK 0xC0u
#    define FTM_PAIR2DEADTIME_DTPS_SHIFT 6u
#    define FTM_PAIR2DEADTIME_DTPS_WIDTH 2u
#    define FTM_PAIR2DEADTIME_DTPS(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTPS_SHIFT)) & FTM_PAIR2DEADTIME_DTPS_MASK)
#    define FTM_PAIR2DEADTIME_DTVALEX_MASK 0xF0000u
#    define FTM_PAIR2DEADTIME_DTVALEX_SHIFT 16u
#    define FTM_PAIR2DEADTIME_DTVALEX_WIDTH 4u
#    define FTM_PAIR2DEADTIME_DTVALEX(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR2DEADTIME_DTVALEX_SHIFT)) & FTM_PAIR2DEADTIME_DTVALEX_MASK)
/* PAIR3DEADTIME Bit Fields */
#    define FTM_PAIR3DEADTIME_DTVAL_MASK 0x3Fu
#    define FTM_PAIR3DEADTIME_DTVAL_SHIFT 0u
#    define FTM_PAIR3DEADTIME_DTVAL_WIDTH 6u
#    define FTM_PAIR3DEADTIME_DTVAL(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTVAL_SHIFT)) & FTM_PAIR3DEADTIME_DTVAL_MASK)
#    define FTM_PAIR3DEADTIME_DTPS_MASK 0xC0u
#    define FTM_PAIR3DEADTIME_DTPS_SHIFT 6u
#    define FTM_PAIR3DEADTIME_DTPS_WIDTH 2u
#    define FTM_PAIR3DEADTIME_DTPS(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTPS_SHIFT)) & FTM_PAIR3DEADTIME_DTPS_MASK)
#    define FTM_PAIR3DEADTIME_DTVALEX_MASK 0xF0000u
#    define FTM_PAIR3DEADTIME_DTVALEX_SHIFT 16u
#    define FTM_PAIR3DEADTIME_DTVALEX_WIDTH 4u
#    define FTM_PAIR3DEADTIME_DTVALEX(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_PAIR3DEADTIME_DTVALEX_SHIFT)) & FTM_PAIR3DEADTIME_DTVALEX_MASK)
/* MOD_MIRROR Bit Fields */
#    define FTM_MOD_MIRROR_FRACMOD_MASK 0xF800u
#    define FTM_MOD_MIRROR_FRACMOD_SHIFT 11u
#    define FTM_MOD_MIRROR_FRACMOD_WIDTH 5u
#    define FTM_MOD_MIRROR_FRACMOD(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MIRROR_FRACMOD_SHIFT)) & FTM_MOD_MIRROR_FRACMOD_MASK)
#    define FTM_MOD_MIRROR_MOD_MASK 0xFFFF0000u
#    define FTM_MOD_MIRROR_MOD_SHIFT 16u
#    define FTM_MOD_MIRROR_MOD_WIDTH 16u
#    define FTM_MOD_MIRROR_MOD(x) (((uint32_t)(((uint32_t)(x)) << FTM_MOD_MIRROR_MOD_SHIFT)) & FTM_MOD_MIRROR_MOD_MASK)
/* CV_MIRROR Bit Fields */
#    define FTM_CV_MIRROR_FRACVAL_MASK 0xF800u
#    define FTM_CV_MIRROR_FRACVAL_SHIFT 11u
#    define FTM_CV_MIRROR_FRACVAL_WIDTH 5u
#    define FTM_CV_MIRROR_FRACVAL(x) \
        (((uint32_t)(((uint32_t)(x)) << FTM_CV_MIRROR_FRACVAL_SHIFT)) & FTM_CV_MIRROR_FRACVAL_MASK)
#    define FTM_CV_MIRROR_VAL_MASK 0xFFFF0000u
#    define FTM_CV_MIRROR_VAL_SHIFT 16u
#    define FTM_CV_MIRROR_VAL_WIDTH 16u
#    define FTM_CV_MIRROR_VAL(x) (((uint32_t)(((uint32_t)(x)) << FTM_CV_MIRROR_VAL_SHIFT)) & FTM_CV_MIRROR_VAL_MASK)

/*!
 * @}
 */ /* end of group FTM_Register_Masks */

/*!
 * @}
 */ /* end of group FTM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- GPIO Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPIO_Peripheral_Access_Layer GPIO Peripheral Access Layer
 * @{
 */

