OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** GPIO - Size of Registers Arrays */

/** GPIO - Register Layout Typedef */
typedef struct
{
    __IO uint32_t PDOR; /**< Port Data Output Register, offset: 0x0 */
    __O uint32_t PSOR;  /**< Port Set Output Register, offset: 0x4 */
    __O uint32_t PCOR;  /**< Port Clear Output Register, offset: 0x8 */
    __O uint32_t PTOR;  /**< Port Toggle Output Register, offset: 0xC */
    __I uint32_t PDIR;  /**< Port Data Input Register, offset: 0x10 */
    __IO uint32_t PDDR; /**< Port Data Direction Register, offset: 0x14 */
    __IO uint32_t PIDR; /**< Port Input Disable Register, offset: 0x18 */
} GPIO_Type, *GPIO_MemMapPtr;

/** Number of instances of the GPIO module. */
#    define GPIO_INSTANCE_COUNT (5u)

/* GPIO - Peripheral instance base addresses */
/** Peripheral PTA base address */
#    define PTA_BASE (0x400FF000u)
/** Peripheral PTA base pointer */
#    define PTA ((GPIO_Type*) PTA_BASE)
/** Peripheral PTB base address */
#    define PTB_BASE (0x400FF040u)
/** Peripheral PTB base pointer */
#    define PTB ((GPIO_Type*) PTB_BASE)
/** Peripheral PTC base address */
#    define PTC_BASE (0x400FF080u)
/** Peripheral PTC base pointer */
#    define PTC ((GPIO_Type*) PTC_BASE)
/** Peripheral PTD base address */
#    define PTD_BASE (0x400FF0C0u)
/** Peripheral PTD base pointer */
#    define PTD ((GPIO_Type*) PTD_BASE)
/** Peripheral PTE base address */
#    define PTE_BASE (0x400FF100u)
/** Peripheral PTE base pointer */
#    define PTE ((GPIO_Type*) PTE_BASE)
/** Array initializer of GPIO peripheral base addresses */
#    define GPIO_BASE_ADDRS                                  \
        {                                                    \
            PTA_BASE, PTB_BASE, PTC_BASE, PTD_BASE, PTE_BASE \
        }
/** Array initializer of GPIO peripheral base pointers */
#    define GPIO_BASE_PTRS          \
        {                           \
            PTA, PTB, PTC, PTD, PTE \
        }

/* ----------------------------------------------------------------------------
   -- GPIO Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GPIO_Register_Masks GPIO Register Masks
 * @{
 */

/* PDOR Bit Fields */
#    define GPIO_PDOR_PDO_MASK 0xFFFFFFFFu
#    define GPIO_PDOR_PDO_SHIFT 0u
#    define GPIO_PDOR_PDO_WIDTH 32u
#    define GPIO_PDOR_PDO(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PDOR_PDO_SHIFT)) & GPIO_PDOR_PDO_MASK)
/* PSOR Bit Fields */
#    define GPIO_PSOR_PTSO_MASK 0xFFFFFFFFu
#    define GPIO_PSOR_PTSO_SHIFT 0u
#    define GPIO_PSOR_PTSO_WIDTH 32u
#    define GPIO_PSOR_PTSO(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PSOR_PTSO_SHIFT)) & GPIO_PSOR_PTSO_MASK)
/* PCOR Bit Fields */
#    define GPIO_PCOR_PTCO_MASK 0xFFFFFFFFu
#    define GPIO_PCOR_PTCO_SHIFT 0u
#    define GPIO_PCOR_PTCO_WIDTH 32u
#    define GPIO_PCOR_PTCO(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PCOR_PTCO_SHIFT)) & GPIO_PCOR_PTCO_MASK)
/* PTOR Bit Fields */
#    define GPIO_PTOR_PTTO_MASK 0xFFFFFFFFu
#    define GPIO_PTOR_PTTO_SHIFT 0u
#    define GPIO_PTOR_PTTO_WIDTH 32u
#    define GPIO_PTOR_PTTO(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PTOR_PTTO_SHIFT)) & GPIO_PTOR_PTTO_MASK)
/* PDIR Bit Fields */
#    define GPIO_PDIR_PDI_MASK 0xFFFFFFFFu
#    define GPIO_PDIR_PDI_SHIFT 0u
#    define GPIO_PDIR_PDI_WIDTH 32u
#    define GPIO_PDIR_PDI(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PDIR_PDI_SHIFT)) & GPIO_PDIR_PDI_MASK)
/* PDDR Bit Fields */
#    define GPIO_PDDR_PDD_MASK 0xFFFFFFFFu
#    define GPIO_PDDR_PDD_SHIFT 0u
#    define GPIO_PDDR_PDD_WIDTH 32u
#    define GPIO_PDDR_PDD(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PDDR_PDD_SHIFT)) & GPIO_PDDR_PDD_MASK)
/* PIDR Bit Fields */
#    define GPIO_PIDR_PID_MASK 0xFFFFFFFFu
#    define GPIO_PIDR_PID_SHIFT 0u
#    define GPIO_PIDR_PID_WIDTH 32u
#    define GPIO_PIDR_PID(x) (((uint32_t)(((uint32_t)(x)) << GPIO_PIDR_PID_SHIFT)) & GPIO_PIDR_PID_MASK)

/*!
 * @}
 */ /* end of group GPIO_Register_Masks */

/*!
 * @}
 */ /* end of group GPIO_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LMEM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LMEM_Peripheral_Access_Layer LMEM Peripheral Access Layer
 * @{
 */

/** LMEM - Size of Registers Arrays */

/** LMEM - Register Layout Typedef */
typedef struct
{
    __IO uint32_t PCCCR;  /**< Cache control register, offset: 0x0 */
    __IO uint32_t PCCLCR; /**< Cache line control register, offset: 0x4 */
    __IO uint32_t PCCSAR; /**< Cache search address register, offset: 0x8 */
    __IO uint32_t PCCCVR; /**< Cache read/write value register, offset: 0xC */
    uint8_t       RESERVED_0[16];
    __IO uint32_t PCCRMR; /**< Cache regions mode register, offset: 0x20 */
} LMEM_Type, *LMEM_MemMapPtr;

/** Number of instances of the LMEM module. */
#    define LMEM_INSTANCE_COUNT (1u)

/* LMEM - Peripheral instance base addresses */
/** Peripheral LMEM base address */
#    define LMEM_BASE (0xE0082000u)
/** Peripheral LMEM base pointer */
#    define LMEM ((LMEM_Type*) LMEM_BASE)
/** Array initializer of LMEM peripheral base addresses */
#    define LMEM_BASE_ADDRS \
        {                   \
            LMEM_BASE       \
        }
/** Array initializer of LMEM peripheral base pointers */
#    define LMEM_BASE_PTRS \
        {                  \
            LMEM           \
        }

/* ----------------------------------------------------------------------------
   -- LMEM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LMEM_Register_Masks LMEM Register Masks
 * @{
 */

/* PCCCR Bit Fields */
#    define LMEM_PCCCR_ENCACHE_MASK 0x1u
#    define LMEM_PCCCR_ENCACHE_SHIFT 0u
#    define LMEM_PCCCR_ENCACHE_WIDTH 1u
#    define LMEM_PCCCR_ENCACHE(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_ENCACHE_SHIFT)) & LMEM_PCCCR_ENCACHE_MASK)
#    define LMEM_PCCCR_PCCR2_MASK 0x4u
#    define LMEM_PCCCR_PCCR2_SHIFT 2u
#    define LMEM_PCCCR_PCCR2_WIDTH 1u
#    define LMEM_PCCCR_PCCR2(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PCCR2_SHIFT)) & LMEM_PCCCR_PCCR2_MASK)
#    define LMEM_PCCCR_PCCR3_MASK 0x8u
#    define LMEM_PCCCR_PCCR3_SHIFT 3u
#    define LMEM_PCCCR_PCCR3_WIDTH 1u
#    define LMEM_PCCCR_PCCR3(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PCCR3_SHIFT)) & LMEM_PCCCR_PCCR3_MASK)
#    define LMEM_PCCCR_INVW0_MASK 0x1000000u
#    define LMEM_PCCCR_INVW0_SHIFT 24u
#    define LMEM_PCCCR_INVW0_WIDTH 1u
#    define LMEM_PCCCR_INVW0(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_INVW0_SHIFT)) & LMEM_PCCCR_INVW0_MASK)
#    define LMEM_PCCCR_PUSHW0_MASK 0x2000000u
#    define LMEM_PCCCR_PUSHW0_SHIFT 25u
#    define LMEM_PCCCR_PUSHW0_WIDTH 1u
#    define LMEM_PCCCR_PUSHW0(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PUSHW0_SHIFT)) & LMEM_PCCCR_PUSHW0_MASK)
#    define LMEM_PCCCR_INVW1_MASK 0x4000000u
#    define LMEM_PCCCR_INVW1_SHIFT 26u
#    define LMEM_PCCCR_INVW1_WIDTH 1u
#    define LMEM_PCCCR_INVW1(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_INVW1_SHIFT)) & LMEM_PCCCR_INVW1_MASK)
#    define LMEM_PCCCR_PUSHW1_MASK 0x8000000u
#    define LMEM_PCCCR_PUSHW1_SHIFT 27u
#    define LMEM_PCCCR_PUSHW1_WIDTH 1u
#    define LMEM_PCCCR_PUSHW1(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_PUSHW1_SHIFT)) & LMEM_PCCCR_PUSHW1_MASK)
#    define LMEM_PCCCR_GO_MASK 0x80000000u
#    define LMEM_PCCCR_GO_SHIFT 31u
#    define LMEM_PCCCR_GO_WIDTH 1u
#    define LMEM_PCCCR_GO(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_GO_SHIFT)) & LMEM_PCCCR_GO_MASK)
/* PCCLCR Bit Fields */
#    define LMEM_PCCLCR_LGO_MASK 0x1u
#    define LMEM_PCCLCR_LGO_SHIFT 0u
#    define LMEM_PCCLCR_LGO_WIDTH 1u
#    define LMEM_PCCLCR_LGO(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LGO_SHIFT)) & LMEM_PCCLCR_LGO_MASK)
#    define LMEM_PCCLCR_CACHEADDR_MASK 0x3FFCu
#    define LMEM_PCCLCR_CACHEADDR_SHIFT 2u
#    define LMEM_PCCLCR_CACHEADDR_WIDTH 12u
#    define LMEM_PCCLCR_CACHEADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_CACHEADDR_SHIFT)) & LMEM_PCCLCR_CACHEADDR_MASK)
#    define LMEM_PCCLCR_WSEL_MASK 0x4000u
#    define LMEM_PCCLCR_WSEL_SHIFT 14u
#    define LMEM_PCCLCR_WSEL_WIDTH 1u
#    define LMEM_PCCLCR_WSEL(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_WSEL_SHIFT)) & LMEM_PCCLCR_WSEL_MASK)
#    define LMEM_PCCLCR_TDSEL_MASK 0x10000u
#    define LMEM_PCCLCR_TDSEL_SHIFT 16u
#    define LMEM_PCCLCR_TDSEL_WIDTH 1u
#    define LMEM_PCCLCR_TDSEL(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_TDSEL_SHIFT)) & LMEM_PCCLCR_TDSEL_MASK)
#    define LMEM_PCCLCR_LCIVB_MASK 0x100000u
#    define LMEM_PCCLCR_LCIVB_SHIFT 20u
#    define LMEM_PCCLCR_LCIVB_WIDTH 1u
#    define LMEM_PCCLCR_LCIVB(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCIVB_SHIFT)) & LMEM_PCCLCR_LCIVB_MASK)
#    define LMEM_PCCLCR_LCIMB_MASK 0x200000u
#    define LMEM_PCCLCR_LCIMB_SHIFT 21u
#    define LMEM_PCCLCR_LCIMB_WIDTH 1u
#    define LMEM_PCCLCR_LCIMB(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCIMB_SHIFT)) & LMEM_PCCLCR_LCIMB_MASK)
#    define LMEM_PCCLCR_LCWAY_MASK 0x400000u
#    define LMEM_PCCLCR_LCWAY_SHIFT 22u
#    define LMEM_PCCLCR_LCWAY_WIDTH 1u
#    define LMEM_PCCLCR_LCWAY(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCWAY_SHIFT)) & LMEM_PCCLCR_LCWAY_MASK)
#    define LMEM_PCCLCR_LCMD_MASK 0x3000000u
#    define LMEM_PCCLCR_LCMD_SHIFT 24u
#    define LMEM_PCCLCR_LCMD_WIDTH 2u
#    define LMEM_PCCLCR_LCMD(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LCMD_SHIFT)) & LMEM_PCCLCR_LCMD_MASK)
#    define LMEM_PCCLCR_LADSEL_MASK 0x4000000u
#    define LMEM_PCCLCR_LADSEL_SHIFT 26u
#    define LMEM_PCCLCR_LADSEL_WIDTH 1u
#    define LMEM_PCCLCR_LADSEL(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LADSEL_SHIFT)) & LMEM_PCCLCR_LADSEL_MASK)
#    define LMEM_PCCLCR_LACC_MASK 0x8000000u
#    define LMEM_PCCLCR_LACC_SHIFT 27u
#    define LMEM_PCCLCR_LACC_WIDTH 1u
#    define LMEM_PCCLCR_LACC(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCLCR_LACC_SHIFT)) & LMEM_PCCLCR_LACC_MASK)
/* PCCSAR Bit Fields */
#    define LMEM_PCCSAR_LGO_MASK 0x1u
#    define LMEM_PCCSAR_LGO_SHIFT 0u
#    define LMEM_PCCSAR_LGO_WIDTH 1u
#    define LMEM_PCCSAR_LGO(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCSAR_LGO_SHIFT)) & LMEM_PCCSAR_LGO_MASK)
#    define LMEM_PCCSAR_PHYADDR_MASK 0xFFFFFFFCu
#    define LMEM_PCCSAR_PHYADDR_SHIFT 2u
#    define LMEM_PCCSAR_PHYADDR_WIDTH 30u
#    define LMEM_PCCSAR_PHYADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << LMEM_PCCSAR_PHYADDR_SHIFT)) & LMEM_PCCSAR_PHYADDR_MASK)
/* PCCCVR Bit Fields */
#    define LMEM_PCCCVR_DATA_MASK 0xFFFFFFFFu
#    define LMEM_PCCCVR_DATA_SHIFT 0u
#    define LMEM_PCCCVR_DATA_WIDTH 32u
#    define LMEM_PCCCVR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCVR_DATA_SHIFT)) & LMEM_PCCCVR_DATA_MASK)
/* PCCRMR Bit Fields */
#    define LMEM_PCCRMR_R15_MASK 0x3u
#    define LMEM_PCCRMR_R15_SHIFT 0u
#    define LMEM_PCCRMR_R15_WIDTH 2u
#    define LMEM_PCCRMR_R15(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R15_SHIFT)) & LMEM_PCCRMR_R15_MASK)
#    define LMEM_PCCRMR_R14_MASK 0xCu
#    define LMEM_PCCRMR_R14_SHIFT 2u
#    define LMEM_PCCRMR_R14_WIDTH 2u
#    define LMEM_PCCRMR_R14(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R14_SHIFT)) & LMEM_PCCRMR_R14_MASK)
#    define LMEM_PCCRMR_R13_MASK 0x30u
#    define LMEM_PCCRMR_R13_SHIFT 4u
#    define LMEM_PCCRMR_R13_WIDTH 2u
#    define LMEM_PCCRMR_R13(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R13_SHIFT)) & LMEM_PCCRMR_R13_MASK)
#    define LMEM_PCCRMR_R12_MASK 0xC0u
#    define LMEM_PCCRMR_R12_SHIFT 6u
#    define LMEM_PCCRMR_R12_WIDTH 2u
#    define LMEM_PCCRMR_R12(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R12_SHIFT)) & LMEM_PCCRMR_R12_MASK)
#    define LMEM_PCCRMR_R11_MASK 0x300u
#    define LMEM_PCCRMR_R11_SHIFT 8u
#    define LMEM_PCCRMR_R11_WIDTH 2u
#    define LMEM_PCCRMR_R11(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R11_SHIFT)) & LMEM_PCCRMR_R11_MASK)
#    define LMEM_PCCRMR_R10_MASK 0xC00u
#    define LMEM_PCCRMR_R10_SHIFT 10u
#    define LMEM_PCCRMR_R10_WIDTH 2u
#    define LMEM_PCCRMR_R10(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R10_SHIFT)) & LMEM_PCCRMR_R10_MASK)
#    define LMEM_PCCRMR_R9_MASK 0x3000u
#    define LMEM_PCCRMR_R9_SHIFT 12u
#    define LMEM_PCCRMR_R9_WIDTH 2u
#    define LMEM_PCCRMR_R9(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R9_SHIFT)) & LMEM_PCCRMR_R9_MASK)
#    define LMEM_PCCRMR_R8_MASK 0xC000u
#    define LMEM_PCCRMR_R8_SHIFT 14u
#    define LMEM_PCCRMR_R8_WIDTH 2u
#    define LMEM_PCCRMR_R8(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R8_SHIFT)) & LMEM_PCCRMR_R8_MASK)
#    define LMEM_PCCRMR_R7_MASK 0x30000u
#    define LMEM_PCCRMR_R7_SHIFT 16u
#    define LMEM_PCCRMR_R7_WIDTH 2u
#    define LMEM_PCCRMR_R7(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R7_SHIFT)) & LMEM_PCCRMR_R7_MASK)
#    define LMEM_PCCRMR_R6_MASK 0xC0000u
#    define LMEM_PCCRMR_R6_SHIFT 18u
#    define LMEM_PCCRMR_R6_WIDTH 2u
#    define LMEM_PCCRMR_R6(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R6_SHIFT)) & LMEM_PCCRMR_R6_MASK)
#    define LMEM_PCCRMR_R5_MASK 0x300000u
#    define LMEM_PCCRMR_R5_SHIFT 20u
#    define LMEM_PCCRMR_R5_WIDTH 2u
#    define LMEM_PCCRMR_R5(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R5_SHIFT)) & LMEM_PCCRMR_R5_MASK)
#    define LMEM_PCCRMR_R4_MASK 0xC00000u
#    define LMEM_PCCRMR_R4_SHIFT 22u
#    define LMEM_PCCRMR_R4_WIDTH 2u
#    define LMEM_PCCRMR_R4(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R4_SHIFT)) & LMEM_PCCRMR_R4_MASK)
#    define LMEM_PCCRMR_R3_MASK 0x3000000u
#    define LMEM_PCCRMR_R3_SHIFT 24u
#    define LMEM_PCCRMR_R3_WIDTH 2u
#    define LMEM_PCCRMR_R3(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R3_SHIFT)) & LMEM_PCCRMR_R3_MASK)
#    define LMEM_PCCRMR_R2_MASK 0xC000000u
#    define LMEM_PCCRMR_R2_SHIFT 26u
#    define LMEM_PCCRMR_R2_WIDTH 2u
#    define LMEM_PCCRMR_R2(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R2_SHIFT)) & LMEM_PCCRMR_R2_MASK)
#    define LMEM_PCCRMR_R1_MASK 0x30000000u
#    define LMEM_PCCRMR_R1_SHIFT 28u
#    define LMEM_PCCRMR_R1_WIDTH 2u
#    define LMEM_PCCRMR_R1(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R1_SHIFT)) & LMEM_PCCRMR_R1_MASK)
#    define LMEM_PCCRMR_R0_MASK 0xC0000000u
#    define LMEM_PCCRMR_R0_SHIFT 30u
#    define LMEM_PCCRMR_R0_WIDTH 2u
#    define LMEM_PCCRMR_R0(x) (((uint32_t)(((uint32_t)(x)) << LMEM_PCCRMR_R0_SHIFT)) & LMEM_PCCRMR_R0_MASK)

/*!
 * @}
 */ /* end of group LMEM_Register_Masks */

/*!
 * @}
 */ /* end of group LMEM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPI2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral_Access_Layer LPI2C Peripheral Access Layer
 * @{
 */

/** LPI2C - Size of Registers Arrays */

/** LPI2C - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    uint8_t      RESERVED_0[8];
    __IO uint32_t MCR;    /**< Master Control Register, offset: 0x10 */
    __IO uint32_t MSR;    /**< Master Status Register, offset: 0x14 */
    __IO uint32_t MIER;   /**< Master Interrupt Enable Register, offset: 0x18 */
    __IO uint32_t MDER;   /**< Master DMA Enable Register, offset: 0x1C */
    __IO uint32_t MCFGR0; /**< Master Configuration Register 0, offset: 0x20 */
    __IO uint32_t MCFGR1; /**< Master Configuration Register 1, offset: 0x24 */
    __IO uint32_t MCFGR2; /**< Master Configuration Register 2, offset: 0x28 */
    __IO uint32_t MCFGR3; /**< Master Configuration Register 3, offset: 0x2C */
    uint8_t       RESERVED_1[16];
    __IO uint32_t MDMR; /**< Master Data Match Register, offset: 0x40 */
    uint8_t       RESERVED_2[4];
    __IO uint32_t MCCR0; /**< Master Clock Configuration Register 0, offset: 0x48 */
    uint8_t       RESERVED_3[4];
    __IO uint32_t MCCR1; /**< Master Clock Configuration Register 1, offset: 0x50 */
    uint8_t       RESERVED_4[4];
    __IO uint32_t MFCR; /**< Master FIFO Control Register, offset: 0x58 */
    __I uint32_t MFSR;  /**< Master FIFO Status Register, offset: 0x5C */
    __IO uint32_t MTDR; /**< Master Transmit Data Register, offset: 0x60 */
    uint8_t       RESERVED_5[12];
    __I uint32_t MRDR; /**< Master Receive Data Register, offset: 0x70 */
    uint8_t      RESERVED_6[156];
    __IO uint32_t SCR;  /**< Slave Control Register, offset: 0x110 */
    __IO uint32_t SSR;  /**< Slave Status Register, offset: 0x114 */
    __IO uint32_t SIER; /**< Slave Interrupt Enable Register, offset: 0x118 */
    __IO uint32_t SDER; /**< Slave DMA Enable Register, offset: 0x11C */
    uint8_t       RESERVED_7[4];
    __IO uint32_t SCFGR1; /**< Slave Configuration Register 1, offset: 0x124 */
    __IO uint32_t SCFGR2; /**< Slave Configuration Register 2, offset: 0x128 */
    uint8_t       RESERVED_8[20];
    __IO uint32_t SAMR; /**< Slave Address Match Register, offset: 0x140 */
    uint8_t       RESERVED_9[12];
    __I uint32_t SASR;  /**< Slave Address Status Register, offset: 0x150 */
    __IO uint32_t STAR; /**< Slave Transmit ACK Register, offset: 0x154 */
    uint8_t       RESERVED_10[8];
    __IO uint32_t STDR; /**< Slave Transmit Data Register, offset: 0x160 */
    uint8_t       RESERVED_11[12];
    __I uint32_t SRDR; /**< Slave Receive Data Register, offset: 0x170 */
} LPI2C_Type, *LPI2C_MemMapPtr;

/** Number of instances of the LPI2C module. */
#    define LPI2C_INSTANCE_COUNT (2u)

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C0 base address */
#    define LPI2C0_BASE (0x40066000u)
/** Peripheral LPI2C0 base pointer */
#    define LPI2C0 ((LPI2C_Type*) LPI2C0_BASE)
/** Peripheral LPI2C1 base address */
#    define LPI2C1_BASE (0x40067000u)
/** Peripheral LPI2C1 base pointer */
#    define LPI2C1 ((LPI2C_Type*) LPI2C1_BASE)
/** Array initializer of LPI2C peripheral base addresses */
#    define LPI2C_BASE_ADDRS         \
        {                            \
            LPI2C0_BASE, LPI2C1_BASE \
        }
/** Array initializer of LPI2C peripheral base pointers */
#    define LPI2C_BASE_PTRS \
        {                   \
            LPI2C0, LPI2C1  \
        }
/** Number of interrupt vector arrays for the LPI2C module. */
#    define LPI2C_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the MASTER type of LPI2C module. */
#    define LPI2C_MASTER_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the SLAVE type of LPI2C module. */
#    define LPI2C_SLAVE_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the LPI2C peripheral type */
#    define LPI2C_MASTER_IRQS                      \
        {                                          \
            LPI2C0_Master_IRQn, LPI2C1_Master_IRQn \
        }
#    define LPI2C_SLAVE_IRQS                     \
        {                                        \
            LPI2C0_Slave_IRQn, LPI2C1_Slave_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- LPI2C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Register_Masks LPI2C Register Masks
 * @{
 */

