OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* VERID Bit Fields */
#    define LPI2C_VERID_FEATURE_MASK 0xFFFFu
#    define LPI2C_VERID_FEATURE_SHIFT 0u
#    define LPI2C_VERID_FEATURE_WIDTH 16u
#    define LPI2C_VERID_FEATURE(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_VERID_FEATURE_SHIFT)) & LPI2C_VERID_FEATURE_MASK)
#    define LPI2C_VERID_MINOR_MASK 0xFF0000u
#    define LPI2C_VERID_MINOR_SHIFT 16u
#    define LPI2C_VERID_MINOR_WIDTH 8u
#    define LPI2C_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_VERID_MINOR_SHIFT)) & LPI2C_VERID_MINOR_MASK)
#    define LPI2C_VERID_MAJOR_MASK 0xFF000000u
#    define LPI2C_VERID_MAJOR_SHIFT 24u
#    define LPI2C_VERID_MAJOR_WIDTH 8u
#    define LPI2C_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_VERID_MAJOR_SHIFT)) & LPI2C_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define LPI2C_PARAM_MTXFIFO_MASK 0xFu
#    define LPI2C_PARAM_MTXFIFO_SHIFT 0u
#    define LPI2C_PARAM_MTXFIFO_WIDTH 4u
#    define LPI2C_PARAM_MTXFIFO(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_PARAM_MTXFIFO_SHIFT)) & LPI2C_PARAM_MTXFIFO_MASK)
#    define LPI2C_PARAM_MRXFIFO_MASK 0xF00u
#    define LPI2C_PARAM_MRXFIFO_SHIFT 8u
#    define LPI2C_PARAM_MRXFIFO_WIDTH 4u
#    define LPI2C_PARAM_MRXFIFO(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_PARAM_MRXFIFO_SHIFT)) & LPI2C_PARAM_MRXFIFO_MASK)
/* MCR Bit Fields */
#    define LPI2C_MCR_MEN_MASK 0x1u
#    define LPI2C_MCR_MEN_SHIFT 0u
#    define LPI2C_MCR_MEN_WIDTH 1u
#    define LPI2C_MCR_MEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_MEN_SHIFT)) & LPI2C_MCR_MEN_MASK)
#    define LPI2C_MCR_RST_MASK 0x2u
#    define LPI2C_MCR_RST_SHIFT 1u
#    define LPI2C_MCR_RST_WIDTH 1u
#    define LPI2C_MCR_RST(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_RST_SHIFT)) & LPI2C_MCR_RST_MASK)
#    define LPI2C_MCR_DOZEN_MASK 0x4u
#    define LPI2C_MCR_DOZEN_SHIFT 2u
#    define LPI2C_MCR_DOZEN_WIDTH 1u
#    define LPI2C_MCR_DOZEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_DOZEN_SHIFT)) & LPI2C_MCR_DOZEN_MASK)
#    define LPI2C_MCR_DBGEN_MASK 0x8u
#    define LPI2C_MCR_DBGEN_SHIFT 3u
#    define LPI2C_MCR_DBGEN_WIDTH 1u
#    define LPI2C_MCR_DBGEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_DBGEN_SHIFT)) & LPI2C_MCR_DBGEN_MASK)
#    define LPI2C_MCR_RTF_MASK 0x100u
#    define LPI2C_MCR_RTF_SHIFT 8u
#    define LPI2C_MCR_RTF_WIDTH 1u
#    define LPI2C_MCR_RTF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_RTF_SHIFT)) & LPI2C_MCR_RTF_MASK)
#    define LPI2C_MCR_RRF_MASK 0x200u
#    define LPI2C_MCR_RRF_SHIFT 9u
#    define LPI2C_MCR_RRF_WIDTH 1u
#    define LPI2C_MCR_RRF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCR_RRF_SHIFT)) & LPI2C_MCR_RRF_MASK)
/* MSR Bit Fields */
#    define LPI2C_MSR_TDF_MASK 0x1u
#    define LPI2C_MSR_TDF_SHIFT 0u
#    define LPI2C_MSR_TDF_WIDTH 1u
#    define LPI2C_MSR_TDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_TDF_SHIFT)) & LPI2C_MSR_TDF_MASK)
#    define LPI2C_MSR_RDF_MASK 0x2u
#    define LPI2C_MSR_RDF_SHIFT 1u
#    define LPI2C_MSR_RDF_WIDTH 1u
#    define LPI2C_MSR_RDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_RDF_SHIFT)) & LPI2C_MSR_RDF_MASK)
#    define LPI2C_MSR_EPF_MASK 0x100u
#    define LPI2C_MSR_EPF_SHIFT 8u
#    define LPI2C_MSR_EPF_WIDTH 1u
#    define LPI2C_MSR_EPF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_EPF_SHIFT)) & LPI2C_MSR_EPF_MASK)
#    define LPI2C_MSR_SDF_MASK 0x200u
#    define LPI2C_MSR_SDF_SHIFT 9u
#    define LPI2C_MSR_SDF_WIDTH 1u
#    define LPI2C_MSR_SDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_SDF_SHIFT)) & LPI2C_MSR_SDF_MASK)
#    define LPI2C_MSR_NDF_MASK 0x400u
#    define LPI2C_MSR_NDF_SHIFT 10u
#    define LPI2C_MSR_NDF_WIDTH 1u
#    define LPI2C_MSR_NDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_NDF_SHIFT)) & LPI2C_MSR_NDF_MASK)
#    define LPI2C_MSR_ALF_MASK 0x800u
#    define LPI2C_MSR_ALF_SHIFT 11u
#    define LPI2C_MSR_ALF_WIDTH 1u
#    define LPI2C_MSR_ALF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_ALF_SHIFT)) & LPI2C_MSR_ALF_MASK)
#    define LPI2C_MSR_FEF_MASK 0x1000u
#    define LPI2C_MSR_FEF_SHIFT 12u
#    define LPI2C_MSR_FEF_WIDTH 1u
#    define LPI2C_MSR_FEF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_FEF_SHIFT)) & LPI2C_MSR_FEF_MASK)
#    define LPI2C_MSR_PLTF_MASK 0x2000u
#    define LPI2C_MSR_PLTF_SHIFT 13u
#    define LPI2C_MSR_PLTF_WIDTH 1u
#    define LPI2C_MSR_PLTF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_PLTF_SHIFT)) & LPI2C_MSR_PLTF_MASK)
#    define LPI2C_MSR_DMF_MASK 0x4000u
#    define LPI2C_MSR_DMF_SHIFT 14u
#    define LPI2C_MSR_DMF_WIDTH 1u
#    define LPI2C_MSR_DMF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_DMF_SHIFT)) & LPI2C_MSR_DMF_MASK)
#    define LPI2C_MSR_MBF_MASK 0x1000000u
#    define LPI2C_MSR_MBF_SHIFT 24u
#    define LPI2C_MSR_MBF_WIDTH 1u
#    define LPI2C_MSR_MBF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_MBF_SHIFT)) & LPI2C_MSR_MBF_MASK)
#    define LPI2C_MSR_BBF_MASK 0x2000000u
#    define LPI2C_MSR_BBF_SHIFT 25u
#    define LPI2C_MSR_BBF_WIDTH 1u
#    define LPI2C_MSR_BBF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MSR_BBF_SHIFT)) & LPI2C_MSR_BBF_MASK)
/* MIER Bit Fields */
#    define LPI2C_MIER_TDIE_MASK 0x1u
#    define LPI2C_MIER_TDIE_SHIFT 0u
#    define LPI2C_MIER_TDIE_WIDTH 1u
#    define LPI2C_MIER_TDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_TDIE_SHIFT)) & LPI2C_MIER_TDIE_MASK)
#    define LPI2C_MIER_RDIE_MASK 0x2u
#    define LPI2C_MIER_RDIE_SHIFT 1u
#    define LPI2C_MIER_RDIE_WIDTH 1u
#    define LPI2C_MIER_RDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_RDIE_SHIFT)) & LPI2C_MIER_RDIE_MASK)
#    define LPI2C_MIER_EPIE_MASK 0x100u
#    define LPI2C_MIER_EPIE_SHIFT 8u
#    define LPI2C_MIER_EPIE_WIDTH 1u
#    define LPI2C_MIER_EPIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_EPIE_SHIFT)) & LPI2C_MIER_EPIE_MASK)
#    define LPI2C_MIER_SDIE_MASK 0x200u
#    define LPI2C_MIER_SDIE_SHIFT 9u
#    define LPI2C_MIER_SDIE_WIDTH 1u
#    define LPI2C_MIER_SDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_SDIE_SHIFT)) & LPI2C_MIER_SDIE_MASK)
#    define LPI2C_MIER_NDIE_MASK 0x400u
#    define LPI2C_MIER_NDIE_SHIFT 10u
#    define LPI2C_MIER_NDIE_WIDTH 1u
#    define LPI2C_MIER_NDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_NDIE_SHIFT)) & LPI2C_MIER_NDIE_MASK)
#    define LPI2C_MIER_ALIE_MASK 0x800u
#    define LPI2C_MIER_ALIE_SHIFT 11u
#    define LPI2C_MIER_ALIE_WIDTH 1u
#    define LPI2C_MIER_ALIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_ALIE_SHIFT)) & LPI2C_MIER_ALIE_MASK)
#    define LPI2C_MIER_FEIE_MASK 0x1000u
#    define LPI2C_MIER_FEIE_SHIFT 12u
#    define LPI2C_MIER_FEIE_WIDTH 1u
#    define LPI2C_MIER_FEIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_FEIE_SHIFT)) & LPI2C_MIER_FEIE_MASK)
#    define LPI2C_MIER_PLTIE_MASK 0x2000u
#    define LPI2C_MIER_PLTIE_SHIFT 13u
#    define LPI2C_MIER_PLTIE_WIDTH 1u
#    define LPI2C_MIER_PLTIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_PLTIE_SHIFT)) & LPI2C_MIER_PLTIE_MASK)
#    define LPI2C_MIER_DMIE_MASK 0x4000u
#    define LPI2C_MIER_DMIE_SHIFT 14u
#    define LPI2C_MIER_DMIE_WIDTH 1u
#    define LPI2C_MIER_DMIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MIER_DMIE_SHIFT)) & LPI2C_MIER_DMIE_MASK)
/* MDER Bit Fields */
#    define LPI2C_MDER_TDDE_MASK 0x1u
#    define LPI2C_MDER_TDDE_SHIFT 0u
#    define LPI2C_MDER_TDDE_WIDTH 1u
#    define LPI2C_MDER_TDDE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MDER_TDDE_SHIFT)) & LPI2C_MDER_TDDE_MASK)
#    define LPI2C_MDER_RDDE_MASK 0x2u
#    define LPI2C_MDER_RDDE_SHIFT 1u
#    define LPI2C_MDER_RDDE_WIDTH 1u
#    define LPI2C_MDER_RDDE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MDER_RDDE_SHIFT)) & LPI2C_MDER_RDDE_MASK)
/* MCFGR0 Bit Fields */
#    define LPI2C_MCFGR0_HREN_MASK 0x1u
#    define LPI2C_MCFGR0_HREN_SHIFT 0u
#    define LPI2C_MCFGR0_HREN_WIDTH 1u
#    define LPI2C_MCFGR0_HREN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR0_HREN_SHIFT)) & LPI2C_MCFGR0_HREN_MASK)
#    define LPI2C_MCFGR0_HRPOL_MASK 0x2u
#    define LPI2C_MCFGR0_HRPOL_SHIFT 1u
#    define LPI2C_MCFGR0_HRPOL_WIDTH 1u
#    define LPI2C_MCFGR0_HRPOL(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR0_HRPOL_SHIFT)) & LPI2C_MCFGR0_HRPOL_MASK)
#    define LPI2C_MCFGR0_HRSEL_MASK 0x4u
#    define LPI2C_MCFGR0_HRSEL_SHIFT 2u
#    define LPI2C_MCFGR0_HRSEL_WIDTH 1u
#    define LPI2C_MCFGR0_HRSEL(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR0_HRSEL_SHIFT)) & LPI2C_MCFGR0_HRSEL_MASK)
#    define LPI2C_MCFGR0_CIRFIFO_MASK 0x100u
#    define LPI2C_MCFGR0_CIRFIFO_SHIFT 8u
#    define LPI2C_MCFGR0_CIRFIFO_WIDTH 1u
#    define LPI2C_MCFGR0_CIRFIFO(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR0_CIRFIFO_SHIFT)) & LPI2C_MCFGR0_CIRFIFO_MASK)
#    define LPI2C_MCFGR0_RDMO_MASK 0x200u
#    define LPI2C_MCFGR0_RDMO_SHIFT 9u
#    define LPI2C_MCFGR0_RDMO_WIDTH 1u
#    define LPI2C_MCFGR0_RDMO(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR0_RDMO_SHIFT)) & LPI2C_MCFGR0_RDMO_MASK)
/* MCFGR1 Bit Fields */
#    define LPI2C_MCFGR1_PRESCALE_MASK 0x7u
#    define LPI2C_MCFGR1_PRESCALE_SHIFT 0u
#    define LPI2C_MCFGR1_PRESCALE_WIDTH 3u
#    define LPI2C_MCFGR1_PRESCALE(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_PRESCALE_SHIFT)) & LPI2C_MCFGR1_PRESCALE_MASK)
#    define LPI2C_MCFGR1_AUTOSTOP_MASK 0x100u
#    define LPI2C_MCFGR1_AUTOSTOP_SHIFT 8u
#    define LPI2C_MCFGR1_AUTOSTOP_WIDTH 1u
#    define LPI2C_MCFGR1_AUTOSTOP(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_AUTOSTOP_SHIFT)) & LPI2C_MCFGR1_AUTOSTOP_MASK)
#    define LPI2C_MCFGR1_IGNACK_MASK 0x200u
#    define LPI2C_MCFGR1_IGNACK_SHIFT 9u
#    define LPI2C_MCFGR1_IGNACK_WIDTH 1u
#    define LPI2C_MCFGR1_IGNACK(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_IGNACK_SHIFT)) & LPI2C_MCFGR1_IGNACK_MASK)
#    define LPI2C_MCFGR1_TIMECFG_MASK 0x400u
#    define LPI2C_MCFGR1_TIMECFG_SHIFT 10u
#    define LPI2C_MCFGR1_TIMECFG_WIDTH 1u
#    define LPI2C_MCFGR1_TIMECFG(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_TIMECFG_SHIFT)) & LPI2C_MCFGR1_TIMECFG_MASK)
#    define LPI2C_MCFGR1_MATCFG_MASK 0x70000u
#    define LPI2C_MCFGR1_MATCFG_SHIFT 16u
#    define LPI2C_MCFGR1_MATCFG_WIDTH 3u
#    define LPI2C_MCFGR1_MATCFG(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_MATCFG_SHIFT)) & LPI2C_MCFGR1_MATCFG_MASK)
#    define LPI2C_MCFGR1_PINCFG_MASK 0x7000000u
#    define LPI2C_MCFGR1_PINCFG_SHIFT 24u
#    define LPI2C_MCFGR1_PINCFG_WIDTH 3u
#    define LPI2C_MCFGR1_PINCFG(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR1_PINCFG_SHIFT)) & LPI2C_MCFGR1_PINCFG_MASK)
/* MCFGR2 Bit Fields */
#    define LPI2C_MCFGR2_BUSIDLE_MASK 0xFFFu
#    define LPI2C_MCFGR2_BUSIDLE_SHIFT 0u
#    define LPI2C_MCFGR2_BUSIDLE_WIDTH 12u
#    define LPI2C_MCFGR2_BUSIDLE(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR2_BUSIDLE_SHIFT)) & LPI2C_MCFGR2_BUSIDLE_MASK)
#    define LPI2C_MCFGR2_FILTSCL_MASK 0xF0000u
#    define LPI2C_MCFGR2_FILTSCL_SHIFT 16u
#    define LPI2C_MCFGR2_FILTSCL_WIDTH 4u
#    define LPI2C_MCFGR2_FILTSCL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR2_FILTSCL_SHIFT)) & LPI2C_MCFGR2_FILTSCL_MASK)
#    define LPI2C_MCFGR2_FILTSDA_MASK 0xF000000u
#    define LPI2C_MCFGR2_FILTSDA_SHIFT 24u
#    define LPI2C_MCFGR2_FILTSDA_WIDTH 4u
#    define LPI2C_MCFGR2_FILTSDA(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR2_FILTSDA_SHIFT)) & LPI2C_MCFGR2_FILTSDA_MASK)
/* MCFGR3 Bit Fields */
#    define LPI2C_MCFGR3_PINLOW_MASK 0xFFF00u
#    define LPI2C_MCFGR3_PINLOW_SHIFT 8u
#    define LPI2C_MCFGR3_PINLOW_WIDTH 12u
#    define LPI2C_MCFGR3_PINLOW(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCFGR3_PINLOW_SHIFT)) & LPI2C_MCFGR3_PINLOW_MASK)
/* MDMR Bit Fields */
#    define LPI2C_MDMR_MATCH0_MASK 0xFFu
#    define LPI2C_MDMR_MATCH0_SHIFT 0u
#    define LPI2C_MDMR_MATCH0_WIDTH 8u
#    define LPI2C_MDMR_MATCH0(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MDMR_MATCH0_SHIFT)) & LPI2C_MDMR_MATCH0_MASK)
#    define LPI2C_MDMR_MATCH1_MASK 0xFF0000u
#    define LPI2C_MDMR_MATCH1_SHIFT 16u
#    define LPI2C_MDMR_MATCH1_WIDTH 8u
#    define LPI2C_MDMR_MATCH1(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MDMR_MATCH1_SHIFT)) & LPI2C_MDMR_MATCH1_MASK)
/* MCCR0 Bit Fields */
#    define LPI2C_MCCR0_CLKLO_MASK 0x3Fu
#    define LPI2C_MCCR0_CLKLO_SHIFT 0u
#    define LPI2C_MCCR0_CLKLO_WIDTH 6u
#    define LPI2C_MCCR0_CLKLO(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR0_CLKLO_SHIFT)) & LPI2C_MCCR0_CLKLO_MASK)
#    define LPI2C_MCCR0_CLKHI_MASK 0x3F00u
#    define LPI2C_MCCR0_CLKHI_SHIFT 8u
#    define LPI2C_MCCR0_CLKHI_WIDTH 6u
#    define LPI2C_MCCR0_CLKHI(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR0_CLKHI_SHIFT)) & LPI2C_MCCR0_CLKHI_MASK)
#    define LPI2C_MCCR0_SETHOLD_MASK 0x3F0000u
#    define LPI2C_MCCR0_SETHOLD_SHIFT 16u
#    define LPI2C_MCCR0_SETHOLD_WIDTH 6u
#    define LPI2C_MCCR0_SETHOLD(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR0_SETHOLD_SHIFT)) & LPI2C_MCCR0_SETHOLD_MASK)
#    define LPI2C_MCCR0_DATAVD_MASK 0x3F000000u
#    define LPI2C_MCCR0_DATAVD_SHIFT 24u
#    define LPI2C_MCCR0_DATAVD_WIDTH 6u
#    define LPI2C_MCCR0_DATAVD(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR0_DATAVD_SHIFT)) & LPI2C_MCCR0_DATAVD_MASK)
/* MCCR1 Bit Fields */
#    define LPI2C_MCCR1_CLKLO_MASK 0x3Fu
#    define LPI2C_MCCR1_CLKLO_SHIFT 0u
#    define LPI2C_MCCR1_CLKLO_WIDTH 6u
#    define LPI2C_MCCR1_CLKLO(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR1_CLKLO_SHIFT)) & LPI2C_MCCR1_CLKLO_MASK)
#    define LPI2C_MCCR1_CLKHI_MASK 0x3F00u
#    define LPI2C_MCCR1_CLKHI_SHIFT 8u
#    define LPI2C_MCCR1_CLKHI_WIDTH 6u
#    define LPI2C_MCCR1_CLKHI(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR1_CLKHI_SHIFT)) & LPI2C_MCCR1_CLKHI_MASK)
#    define LPI2C_MCCR1_SETHOLD_MASK 0x3F0000u
#    define LPI2C_MCCR1_SETHOLD_SHIFT 16u
#    define LPI2C_MCCR1_SETHOLD_WIDTH 6u
#    define LPI2C_MCCR1_SETHOLD(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR1_SETHOLD_SHIFT)) & LPI2C_MCCR1_SETHOLD_MASK)
#    define LPI2C_MCCR1_DATAVD_MASK 0x3F000000u
#    define LPI2C_MCCR1_DATAVD_SHIFT 24u
#    define LPI2C_MCCR1_DATAVD_WIDTH 6u
#    define LPI2C_MCCR1_DATAVD(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MCCR1_DATAVD_SHIFT)) & LPI2C_MCCR1_DATAVD_MASK)
/* MFCR Bit Fields */
#    define LPI2C_MFCR_TXWATER_MASK 0x3u
#    define LPI2C_MFCR_TXWATER_SHIFT 0u
#    define LPI2C_MFCR_TXWATER_WIDTH 2u
#    define LPI2C_MFCR_TXWATER(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MFCR_TXWATER_SHIFT)) & LPI2C_MFCR_TXWATER_MASK)
#    define LPI2C_MFCR_RXWATER_MASK 0x30000u
#    define LPI2C_MFCR_RXWATER_SHIFT 16u
#    define LPI2C_MFCR_RXWATER_WIDTH 2u
#    define LPI2C_MFCR_RXWATER(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MFCR_RXWATER_SHIFT)) & LPI2C_MFCR_RXWATER_MASK)
/* MFSR Bit Fields */
#    define LPI2C_MFSR_TXCOUNT_MASK 0x7u
#    define LPI2C_MFSR_TXCOUNT_SHIFT 0u
#    define LPI2C_MFSR_TXCOUNT_WIDTH 3u
#    define LPI2C_MFSR_TXCOUNT(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MFSR_TXCOUNT_SHIFT)) & LPI2C_MFSR_TXCOUNT_MASK)
#    define LPI2C_MFSR_RXCOUNT_MASK 0x70000u
#    define LPI2C_MFSR_RXCOUNT_SHIFT 16u
#    define LPI2C_MFSR_RXCOUNT_WIDTH 3u
#    define LPI2C_MFSR_RXCOUNT(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MFSR_RXCOUNT_SHIFT)) & LPI2C_MFSR_RXCOUNT_MASK)
/* MTDR Bit Fields */
#    define LPI2C_MTDR_DATA_MASK 0xFFu
#    define LPI2C_MTDR_DATA_SHIFT 0u
#    define LPI2C_MTDR_DATA_WIDTH 8u
#    define LPI2C_MTDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MTDR_DATA_SHIFT)) & LPI2C_MTDR_DATA_MASK)
#    define LPI2C_MTDR_CMD_MASK 0x700u
#    define LPI2C_MTDR_CMD_SHIFT 8u
#    define LPI2C_MTDR_CMD_WIDTH 3u
#    define LPI2C_MTDR_CMD(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MTDR_CMD_SHIFT)) & LPI2C_MTDR_CMD_MASK)
/* MRDR Bit Fields */
#    define LPI2C_MRDR_DATA_MASK 0xFFu
#    define LPI2C_MRDR_DATA_SHIFT 0u
#    define LPI2C_MRDR_DATA_WIDTH 8u
#    define LPI2C_MRDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MRDR_DATA_SHIFT)) & LPI2C_MRDR_DATA_MASK)
#    define LPI2C_MRDR_RXEMPTY_MASK 0x4000u
#    define LPI2C_MRDR_RXEMPTY_SHIFT 14u
#    define LPI2C_MRDR_RXEMPTY_WIDTH 1u
#    define LPI2C_MRDR_RXEMPTY(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_MRDR_RXEMPTY_SHIFT)) & LPI2C_MRDR_RXEMPTY_MASK)
/* SCR Bit Fields */
#    define LPI2C_SCR_SEN_MASK 0x1u
#    define LPI2C_SCR_SEN_SHIFT 0u
#    define LPI2C_SCR_SEN_WIDTH 1u
#    define LPI2C_SCR_SEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCR_SEN_SHIFT)) & LPI2C_SCR_SEN_MASK)
#    define LPI2C_SCR_RST_MASK 0x2u
#    define LPI2C_SCR_RST_SHIFT 1u
#    define LPI2C_SCR_RST_WIDTH 1u
#    define LPI2C_SCR_RST(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCR_RST_SHIFT)) & LPI2C_SCR_RST_MASK)
#    define LPI2C_SCR_FILTEN_MASK 0x10u
#    define LPI2C_SCR_FILTEN_SHIFT 4u
#    define LPI2C_SCR_FILTEN_WIDTH 1u
#    define LPI2C_SCR_FILTEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCR_FILTEN_SHIFT)) & LPI2C_SCR_FILTEN_MASK)
#    define LPI2C_SCR_FILTDZ_MASK 0x20u
#    define LPI2C_SCR_FILTDZ_SHIFT 5u
#    define LPI2C_SCR_FILTDZ_WIDTH 1u
#    define LPI2C_SCR_FILTDZ(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCR_FILTDZ_SHIFT)) & LPI2C_SCR_FILTDZ_MASK)
/* SSR Bit Fields */
#    define LPI2C_SSR_TDF_MASK 0x1u
#    define LPI2C_SSR_TDF_SHIFT 0u
#    define LPI2C_SSR_TDF_WIDTH 1u
#    define LPI2C_SSR_TDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_TDF_SHIFT)) & LPI2C_SSR_TDF_MASK)
#    define LPI2C_SSR_RDF_MASK 0x2u
#    define LPI2C_SSR_RDF_SHIFT 1u
#    define LPI2C_SSR_RDF_WIDTH 1u
#    define LPI2C_SSR_RDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_RDF_SHIFT)) & LPI2C_SSR_RDF_MASK)
#    define LPI2C_SSR_AVF_MASK 0x4u
#    define LPI2C_SSR_AVF_SHIFT 2u
#    define LPI2C_SSR_AVF_WIDTH 1u
#    define LPI2C_SSR_AVF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_AVF_SHIFT)) & LPI2C_SSR_AVF_MASK)
#    define LPI2C_SSR_TAF_MASK 0x8u
#    define LPI2C_SSR_TAF_SHIFT 3u
#    define LPI2C_SSR_TAF_WIDTH 1u
#    define LPI2C_SSR_TAF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_TAF_SHIFT)) & LPI2C_SSR_TAF_MASK)
#    define LPI2C_SSR_RSF_MASK 0x100u
#    define LPI2C_SSR_RSF_SHIFT 8u
#    define LPI2C_SSR_RSF_WIDTH 1u
#    define LPI2C_SSR_RSF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_RSF_SHIFT)) & LPI2C_SSR_RSF_MASK)
#    define LPI2C_SSR_SDF_MASK 0x200u
#    define LPI2C_SSR_SDF_SHIFT 9u
#    define LPI2C_SSR_SDF_WIDTH 1u
#    define LPI2C_SSR_SDF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_SDF_SHIFT)) & LPI2C_SSR_SDF_MASK)
#    define LPI2C_SSR_BEF_MASK 0x400u
#    define LPI2C_SSR_BEF_SHIFT 10u
#    define LPI2C_SSR_BEF_WIDTH 1u
#    define LPI2C_SSR_BEF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_BEF_SHIFT)) & LPI2C_SSR_BEF_MASK)
#    define LPI2C_SSR_FEF_MASK 0x800u
#    define LPI2C_SSR_FEF_SHIFT 11u
#    define LPI2C_SSR_FEF_WIDTH 1u
#    define LPI2C_SSR_FEF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_FEF_SHIFT)) & LPI2C_SSR_FEF_MASK)
#    define LPI2C_SSR_AM0F_MASK 0x1000u
#    define LPI2C_SSR_AM0F_SHIFT 12u
#    define LPI2C_SSR_AM0F_WIDTH 1u
#    define LPI2C_SSR_AM0F(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_AM0F_SHIFT)) & LPI2C_SSR_AM0F_MASK)
#    define LPI2C_SSR_AM1F_MASK 0x2000u
#    define LPI2C_SSR_AM1F_SHIFT 13u
#    define LPI2C_SSR_AM1F_WIDTH 1u
#    define LPI2C_SSR_AM1F(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_AM1F_SHIFT)) & LPI2C_SSR_AM1F_MASK)
#    define LPI2C_SSR_GCF_MASK 0x4000u
#    define LPI2C_SSR_GCF_SHIFT 14u
#    define LPI2C_SSR_GCF_WIDTH 1u
#    define LPI2C_SSR_GCF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_GCF_SHIFT)) & LPI2C_SSR_GCF_MASK)
#    define LPI2C_SSR_SARF_MASK 0x8000u
#    define LPI2C_SSR_SARF_SHIFT 15u
#    define LPI2C_SSR_SARF_WIDTH 1u
#    define LPI2C_SSR_SARF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_SARF_SHIFT)) & LPI2C_SSR_SARF_MASK)
#    define LPI2C_SSR_SBF_MASK 0x1000000u
#    define LPI2C_SSR_SBF_SHIFT 24u
#    define LPI2C_SSR_SBF_WIDTH 1u
#    define LPI2C_SSR_SBF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_SBF_SHIFT)) & LPI2C_SSR_SBF_MASK)
#    define LPI2C_SSR_BBF_MASK 0x2000000u
#    define LPI2C_SSR_BBF_SHIFT 25u
#    define LPI2C_SSR_BBF_WIDTH 1u
#    define LPI2C_SSR_BBF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SSR_BBF_SHIFT)) & LPI2C_SSR_BBF_MASK)
/* SIER Bit Fields */
#    define LPI2C_SIER_TDIE_MASK 0x1u
#    define LPI2C_SIER_TDIE_SHIFT 0u
#    define LPI2C_SIER_TDIE_WIDTH 1u
#    define LPI2C_SIER_TDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_TDIE_SHIFT)) & LPI2C_SIER_TDIE_MASK)
#    define LPI2C_SIER_RDIE_MASK 0x2u
#    define LPI2C_SIER_RDIE_SHIFT 1u
#    define LPI2C_SIER_RDIE_WIDTH 1u
#    define LPI2C_SIER_RDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_RDIE_SHIFT)) & LPI2C_SIER_RDIE_MASK)
#    define LPI2C_SIER_AVIE_MASK 0x4u
#    define LPI2C_SIER_AVIE_SHIFT 2u
#    define LPI2C_SIER_AVIE_WIDTH 1u
#    define LPI2C_SIER_AVIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_AVIE_SHIFT)) & LPI2C_SIER_AVIE_MASK)
#    define LPI2C_SIER_TAIE_MASK 0x8u
#    define LPI2C_SIER_TAIE_SHIFT 3u
#    define LPI2C_SIER_TAIE_WIDTH 1u
#    define LPI2C_SIER_TAIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_TAIE_SHIFT)) & LPI2C_SIER_TAIE_MASK)
#    define LPI2C_SIER_RSIE_MASK 0x100u
#    define LPI2C_SIER_RSIE_SHIFT 8u
#    define LPI2C_SIER_RSIE_WIDTH 1u
#    define LPI2C_SIER_RSIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_RSIE_SHIFT)) & LPI2C_SIER_RSIE_MASK)
#    define LPI2C_SIER_SDIE_MASK 0x200u
#    define LPI2C_SIER_SDIE_SHIFT 9u
#    define LPI2C_SIER_SDIE_WIDTH 1u
#    define LPI2C_SIER_SDIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_SDIE_SHIFT)) & LPI2C_SIER_SDIE_MASK)
#    define LPI2C_SIER_BEIE_MASK 0x400u
#    define LPI2C_SIER_BEIE_SHIFT 10u
#    define LPI2C_SIER_BEIE_WIDTH 1u
#    define LPI2C_SIER_BEIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_BEIE_SHIFT)) & LPI2C_SIER_BEIE_MASK)
#    define LPI2C_SIER_FEIE_MASK 0x800u
#    define LPI2C_SIER_FEIE_SHIFT 11u
#    define LPI2C_SIER_FEIE_WIDTH 1u
#    define LPI2C_SIER_FEIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_FEIE_SHIFT)) & LPI2C_SIER_FEIE_MASK)
#    define LPI2C_SIER_AM0IE_MASK 0x1000u
#    define LPI2C_SIER_AM0IE_SHIFT 12u
#    define LPI2C_SIER_AM0IE_WIDTH 1u
#    define LPI2C_SIER_AM0IE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_AM0IE_SHIFT)) & LPI2C_SIER_AM0IE_MASK)
#    define LPI2C_SIER_AM1F_MASK 0x2000u
#    define LPI2C_SIER_AM1F_SHIFT 13u
#    define LPI2C_SIER_AM1F_WIDTH 1u
#    define LPI2C_SIER_AM1F(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_AM1F_SHIFT)) & LPI2C_SIER_AM1F_MASK)
#    define LPI2C_SIER_GCIE_MASK 0x4000u
#    define LPI2C_SIER_GCIE_SHIFT 14u
#    define LPI2C_SIER_GCIE_WIDTH 1u
#    define LPI2C_SIER_GCIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_GCIE_SHIFT)) & LPI2C_SIER_GCIE_MASK)
#    define LPI2C_SIER_SARIE_MASK 0x8000u
#    define LPI2C_SIER_SARIE_SHIFT 15u
#    define LPI2C_SIER_SARIE_WIDTH 1u
#    define LPI2C_SIER_SARIE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SIER_SARIE_SHIFT)) & LPI2C_SIER_SARIE_MASK)
/* SDER Bit Fields */
#    define LPI2C_SDER_TDDE_MASK 0x1u
#    define LPI2C_SDER_TDDE_SHIFT 0u
#    define LPI2C_SDER_TDDE_WIDTH 1u
#    define LPI2C_SDER_TDDE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SDER_TDDE_SHIFT)) & LPI2C_SDER_TDDE_MASK)
#    define LPI2C_SDER_RDDE_MASK 0x2u
#    define LPI2C_SDER_RDDE_SHIFT 1u
#    define LPI2C_SDER_RDDE_WIDTH 1u
#    define LPI2C_SDER_RDDE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SDER_RDDE_SHIFT)) & LPI2C_SDER_RDDE_MASK)
#    define LPI2C_SDER_AVDE_MASK 0x4u
#    define LPI2C_SDER_AVDE_SHIFT 2u
#    define LPI2C_SDER_AVDE_WIDTH 1u
#    define LPI2C_SDER_AVDE(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SDER_AVDE_SHIFT)) & LPI2C_SDER_AVDE_MASK)
/* SCFGR1 Bit Fields */
#    define LPI2C_SCFGR1_ADRSTALL_MASK 0x1u
#    define LPI2C_SCFGR1_ADRSTALL_SHIFT 0u
#    define LPI2C_SCFGR1_ADRSTALL_WIDTH 1u
#    define LPI2C_SCFGR1_ADRSTALL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_ADRSTALL_SHIFT)) & LPI2C_SCFGR1_ADRSTALL_MASK)
#    define LPI2C_SCFGR1_RXSTALL_MASK 0x2u
#    define LPI2C_SCFGR1_RXSTALL_SHIFT 1u
#    define LPI2C_SCFGR1_RXSTALL_WIDTH 1u
#    define LPI2C_SCFGR1_RXSTALL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_RXSTALL_SHIFT)) & LPI2C_SCFGR1_RXSTALL_MASK)
#    define LPI2C_SCFGR1_TXDSTALL_MASK 0x4u
#    define LPI2C_SCFGR1_TXDSTALL_SHIFT 2u
