OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define LPI2C_SCFGR1_TXDSTALL_WIDTH 1u
#    define LPI2C_SCFGR1_TXDSTALL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_TXDSTALL_SHIFT)) & LPI2C_SCFGR1_TXDSTALL_MASK)
#    define LPI2C_SCFGR1_ACKSTALL_MASK 0x8u
#    define LPI2C_SCFGR1_ACKSTALL_SHIFT 3u
#    define LPI2C_SCFGR1_ACKSTALL_WIDTH 1u
#    define LPI2C_SCFGR1_ACKSTALL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_ACKSTALL_SHIFT)) & LPI2C_SCFGR1_ACKSTALL_MASK)
#    define LPI2C_SCFGR1_GCEN_MASK 0x100u
#    define LPI2C_SCFGR1_GCEN_SHIFT 8u
#    define LPI2C_SCFGR1_GCEN_WIDTH 1u
#    define LPI2C_SCFGR1_GCEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_GCEN_SHIFT)) & LPI2C_SCFGR1_GCEN_MASK)
#    define LPI2C_SCFGR1_SAEN_MASK 0x200u
#    define LPI2C_SCFGR1_SAEN_SHIFT 9u
#    define LPI2C_SCFGR1_SAEN_WIDTH 1u
#    define LPI2C_SCFGR1_SAEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_SAEN_SHIFT)) & LPI2C_SCFGR1_SAEN_MASK)
#    define LPI2C_SCFGR1_TXCFG_MASK 0x400u
#    define LPI2C_SCFGR1_TXCFG_SHIFT 10u
#    define LPI2C_SCFGR1_TXCFG_WIDTH 1u
#    define LPI2C_SCFGR1_TXCFG(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_TXCFG_SHIFT)) & LPI2C_SCFGR1_TXCFG_MASK)
#    define LPI2C_SCFGR1_RXCFG_MASK 0x800u
#    define LPI2C_SCFGR1_RXCFG_SHIFT 11u
#    define LPI2C_SCFGR1_RXCFG_WIDTH 1u
#    define LPI2C_SCFGR1_RXCFG(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_RXCFG_SHIFT)) & LPI2C_SCFGR1_RXCFG_MASK)
#    define LPI2C_SCFGR1_IGNACK_MASK 0x1000u
#    define LPI2C_SCFGR1_IGNACK_SHIFT 12u
#    define LPI2C_SCFGR1_IGNACK_WIDTH 1u
#    define LPI2C_SCFGR1_IGNACK(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_IGNACK_SHIFT)) & LPI2C_SCFGR1_IGNACK_MASK)
#    define LPI2C_SCFGR1_HSMEN_MASK 0x2000u
#    define LPI2C_SCFGR1_HSMEN_SHIFT 13u
#    define LPI2C_SCFGR1_HSMEN_WIDTH 1u
#    define LPI2C_SCFGR1_HSMEN(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_HSMEN_SHIFT)) & LPI2C_SCFGR1_HSMEN_MASK)
#    define LPI2C_SCFGR1_ADDRCFG_MASK 0x70000u
#    define LPI2C_SCFGR1_ADDRCFG_SHIFT 16u
#    define LPI2C_SCFGR1_ADDRCFG_WIDTH 3u
#    define LPI2C_SCFGR1_ADDRCFG(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR1_ADDRCFG_SHIFT)) & LPI2C_SCFGR1_ADDRCFG_MASK)
/* SCFGR2 Bit Fields */
#    define LPI2C_SCFGR2_CLKHOLD_MASK 0xFu
#    define LPI2C_SCFGR2_CLKHOLD_SHIFT 0u
#    define LPI2C_SCFGR2_CLKHOLD_WIDTH 4u
#    define LPI2C_SCFGR2_CLKHOLD(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR2_CLKHOLD_SHIFT)) & LPI2C_SCFGR2_CLKHOLD_MASK)
#    define LPI2C_SCFGR2_DATAVD_MASK 0x3F00u
#    define LPI2C_SCFGR2_DATAVD_SHIFT 8u
#    define LPI2C_SCFGR2_DATAVD_WIDTH 6u
#    define LPI2C_SCFGR2_DATAVD(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR2_DATAVD_SHIFT)) & LPI2C_SCFGR2_DATAVD_MASK)
#    define LPI2C_SCFGR2_FILTSCL_MASK 0xF0000u
#    define LPI2C_SCFGR2_FILTSCL_SHIFT 16u
#    define LPI2C_SCFGR2_FILTSCL_WIDTH 4u
#    define LPI2C_SCFGR2_FILTSCL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR2_FILTSCL_SHIFT)) & LPI2C_SCFGR2_FILTSCL_MASK)
#    define LPI2C_SCFGR2_FILTSDA_MASK 0xF000000u
#    define LPI2C_SCFGR2_FILTSDA_SHIFT 24u
#    define LPI2C_SCFGR2_FILTSDA_WIDTH 4u
#    define LPI2C_SCFGR2_FILTSDA(x) \
        (((uint32_t)(((uint32_t)(x)) << LPI2C_SCFGR2_FILTSDA_SHIFT)) & LPI2C_SCFGR2_FILTSDA_MASK)
/* SAMR Bit Fields */
#    define LPI2C_SAMR_ADDR0_MASK 0x7FEu
#    define LPI2C_SAMR_ADDR0_SHIFT 1u
#    define LPI2C_SAMR_ADDR0_WIDTH 10u
#    define LPI2C_SAMR_ADDR0(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SAMR_ADDR0_SHIFT)) & LPI2C_SAMR_ADDR0_MASK)
#    define LPI2C_SAMR_ADDR1_MASK 0x7FE0000u
#    define LPI2C_SAMR_ADDR1_SHIFT 17u
#    define LPI2C_SAMR_ADDR1_WIDTH 10u
#    define LPI2C_SAMR_ADDR1(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SAMR_ADDR1_SHIFT)) & LPI2C_SAMR_ADDR1_MASK)
/* SASR Bit Fields */
#    define LPI2C_SASR_RADDR_MASK 0x7FFu
#    define LPI2C_SASR_RADDR_SHIFT 0u
#    define LPI2C_SASR_RADDR_WIDTH 11u
#    define LPI2C_SASR_RADDR(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SASR_RADDR_SHIFT)) & LPI2C_SASR_RADDR_MASK)
#    define LPI2C_SASR_ANV_MASK 0x4000u
#    define LPI2C_SASR_ANV_SHIFT 14u
#    define LPI2C_SASR_ANV_WIDTH 1u
#    define LPI2C_SASR_ANV(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SASR_ANV_SHIFT)) & LPI2C_SASR_ANV_MASK)
/* STAR Bit Fields */
#    define LPI2C_STAR_TXNACK_MASK 0x1u
#    define LPI2C_STAR_TXNACK_SHIFT 0u
#    define LPI2C_STAR_TXNACK_WIDTH 1u
#    define LPI2C_STAR_TXNACK(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_STAR_TXNACK_SHIFT)) & LPI2C_STAR_TXNACK_MASK)
/* STDR Bit Fields */
#    define LPI2C_STDR_DATA_MASK 0xFFu
#    define LPI2C_STDR_DATA_SHIFT 0u
#    define LPI2C_STDR_DATA_WIDTH 8u
#    define LPI2C_STDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_STDR_DATA_SHIFT)) & LPI2C_STDR_DATA_MASK)
/* SRDR Bit Fields */
#    define LPI2C_SRDR_DATA_MASK 0xFFu
#    define LPI2C_SRDR_DATA_SHIFT 0u
#    define LPI2C_SRDR_DATA_WIDTH 8u
#    define LPI2C_SRDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SRDR_DATA_SHIFT)) & LPI2C_SRDR_DATA_MASK)
#    define LPI2C_SRDR_RXEMPTY_MASK 0x4000u
#    define LPI2C_SRDR_RXEMPTY_SHIFT 14u
#    define LPI2C_SRDR_RXEMPTY_WIDTH 1u
#    define LPI2C_SRDR_RXEMPTY(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SRDR_RXEMPTY_SHIFT)) & LPI2C_SRDR_RXEMPTY_MASK)
#    define LPI2C_SRDR_SOF_MASK 0x8000u
#    define LPI2C_SRDR_SOF_SHIFT 15u
#    define LPI2C_SRDR_SOF_WIDTH 1u
#    define LPI2C_SRDR_SOF(x) (((uint32_t)(((uint32_t)(x)) << LPI2C_SRDR_SOF_SHIFT)) & LPI2C_SRDR_SOF_MASK)

/*!
 * @}
 */ /* end of group LPI2C_Register_Masks */

/*!
 * @}
 */ /* end of group LPI2C_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPIT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPIT_Peripheral_Access_Layer LPIT Peripheral Access Layer
 * @{
 */

/** LPIT - Size of Registers Arrays */
#    define LPIT_TMR_COUNT 4u

/** LPIT - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID;   /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM;   /**< Parameter Register, offset: 0x4 */
    __IO uint32_t MCR;    /**< Module Control Register, offset: 0x8 */
    __IO uint32_t MSR;    /**< Module Status Register, offset: 0xC */
    __IO uint32_t MIER;   /**< Module Interrupt Enable Register, offset: 0x10 */
    __IO uint32_t SETTEN; /**< Set Timer Enable Register, offset: 0x14 */
    __IO uint32_t CLRTEN; /**< Clear Timer Enable Register, offset: 0x18 */
    uint8_t       RESERVED_0[4];
    struct
    {                        /* offset: 0x20, array step: 0x10 */
        __IO uint32_t TVAL;  /**< Timer Value Register, array offset: 0x20, array step: 0x10 */
        __I uint32_t CVAL;   /**< Current Timer Value, array offset: 0x24, array step: 0x10 */
        __IO uint32_t TCTRL; /**< Timer Control Register, array offset: 0x28, array step: 0x10 */
        uint8_t       RESERVED_0[4];
    } TMR[LPIT_TMR_COUNT];
} LPIT_Type, *LPIT_MemMapPtr;

/** Number of instances of the LPIT module. */
#    define LPIT_INSTANCE_COUNT (1u)

/* LPIT - Peripheral instance base addresses */
/** Peripheral LPIT0 base address */
#    define LPIT0_BASE (0x40037000u)
/** Peripheral LPIT0 base pointer */
#    define LPIT0 ((LPIT_Type*) LPIT0_BASE)
/** Array initializer of LPIT peripheral base addresses */
#    define LPIT_BASE_ADDRS \
        {                   \
            LPIT0_BASE      \
        }
/** Array initializer of LPIT peripheral base pointers */
#    define LPIT_BASE_PTRS \
        {                  \
            LPIT0          \
        }
/** Number of interrupt vector arrays for the LPIT module. */
#    define LPIT_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the LPIT module. */
#    define LPIT_IRQS_CH_COUNT (4u)
/** Interrupt vectors for the LPIT peripheral type */
#    define LPIT_IRQS                                                      \
        {                                                                  \
            LPIT0_Ch0_IRQn, LPIT0_Ch1_IRQn, LPIT0_Ch2_IRQn, LPIT0_Ch3_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- LPIT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPIT_Register_Masks LPIT Register Masks
 * @{
 */

/* VERID Bit Fields */
#    define LPIT_VERID_FEATURE_MASK 0xFFFFu
#    define LPIT_VERID_FEATURE_SHIFT 0u
#    define LPIT_VERID_FEATURE_WIDTH 16u
#    define LPIT_VERID_FEATURE(x) (((uint32_t)(((uint32_t)(x)) << LPIT_VERID_FEATURE_SHIFT)) & LPIT_VERID_FEATURE_MASK)
#    define LPIT_VERID_MINOR_MASK 0xFF0000u
#    define LPIT_VERID_MINOR_SHIFT 16u
#    define LPIT_VERID_MINOR_WIDTH 8u
#    define LPIT_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << LPIT_VERID_MINOR_SHIFT)) & LPIT_VERID_MINOR_MASK)
#    define LPIT_VERID_MAJOR_MASK 0xFF000000u
#    define LPIT_VERID_MAJOR_SHIFT 24u
#    define LPIT_VERID_MAJOR_WIDTH 8u
#    define LPIT_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << LPIT_VERID_MAJOR_SHIFT)) & LPIT_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define LPIT_PARAM_CHANNEL_MASK 0xFFu
#    define LPIT_PARAM_CHANNEL_SHIFT 0u
#    define LPIT_PARAM_CHANNEL_WIDTH 8u
#    define LPIT_PARAM_CHANNEL(x) (((uint32_t)(((uint32_t)(x)) << LPIT_PARAM_CHANNEL_SHIFT)) & LPIT_PARAM_CHANNEL_MASK)
#    define LPIT_PARAM_EXT_TRIG_MASK 0xFF00u
#    define LPIT_PARAM_EXT_TRIG_SHIFT 8u
#    define LPIT_PARAM_EXT_TRIG_WIDTH 8u
#    define LPIT_PARAM_EXT_TRIG(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_PARAM_EXT_TRIG_SHIFT)) & LPIT_PARAM_EXT_TRIG_MASK)
/* MCR Bit Fields */
#    define LPIT_MCR_M_CEN_MASK 0x1u
#    define LPIT_MCR_M_CEN_SHIFT 0u
#    define LPIT_MCR_M_CEN_WIDTH 1u
#    define LPIT_MCR_M_CEN(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MCR_M_CEN_SHIFT)) & LPIT_MCR_M_CEN_MASK)
#    define LPIT_MCR_SW_RST_MASK 0x2u
#    define LPIT_MCR_SW_RST_SHIFT 1u
#    define LPIT_MCR_SW_RST_WIDTH 1u
#    define LPIT_MCR_SW_RST(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MCR_SW_RST_SHIFT)) & LPIT_MCR_SW_RST_MASK)
#    define LPIT_MCR_DOZE_EN_MASK 0x4u
#    define LPIT_MCR_DOZE_EN_SHIFT 2u
#    define LPIT_MCR_DOZE_EN_WIDTH 1u
#    define LPIT_MCR_DOZE_EN(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MCR_DOZE_EN_SHIFT)) & LPIT_MCR_DOZE_EN_MASK)
#    define LPIT_MCR_DBG_EN_MASK 0x8u
#    define LPIT_MCR_DBG_EN_SHIFT 3u
#    define LPIT_MCR_DBG_EN_WIDTH 1u
#    define LPIT_MCR_DBG_EN(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MCR_DBG_EN_SHIFT)) & LPIT_MCR_DBG_EN_MASK)
/* MSR Bit Fields */
#    define LPIT_MSR_TIF0_MASK 0x1u
#    define LPIT_MSR_TIF0_SHIFT 0u
#    define LPIT_MSR_TIF0_WIDTH 1u
#    define LPIT_MSR_TIF0(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MSR_TIF0_SHIFT)) & LPIT_MSR_TIF0_MASK)
#    define LPIT_MSR_TIF1_MASK 0x2u
#    define LPIT_MSR_TIF1_SHIFT 1u
#    define LPIT_MSR_TIF1_WIDTH 1u
#    define LPIT_MSR_TIF1(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MSR_TIF1_SHIFT)) & LPIT_MSR_TIF1_MASK)
#    define LPIT_MSR_TIF2_MASK 0x4u
#    define LPIT_MSR_TIF2_SHIFT 2u
#    define LPIT_MSR_TIF2_WIDTH 1u
#    define LPIT_MSR_TIF2(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MSR_TIF2_SHIFT)) & LPIT_MSR_TIF2_MASK)
#    define LPIT_MSR_TIF3_MASK 0x8u
#    define LPIT_MSR_TIF3_SHIFT 3u
#    define LPIT_MSR_TIF3_WIDTH 1u
#    define LPIT_MSR_TIF3(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MSR_TIF3_SHIFT)) & LPIT_MSR_TIF3_MASK)
/* MIER Bit Fields */
#    define LPIT_MIER_TIE0_MASK 0x1u
#    define LPIT_MIER_TIE0_SHIFT 0u
#    define LPIT_MIER_TIE0_WIDTH 1u
#    define LPIT_MIER_TIE0(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MIER_TIE0_SHIFT)) & LPIT_MIER_TIE0_MASK)
#    define LPIT_MIER_TIE1_MASK 0x2u
#    define LPIT_MIER_TIE1_SHIFT 1u
#    define LPIT_MIER_TIE1_WIDTH 1u
#    define LPIT_MIER_TIE1(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MIER_TIE1_SHIFT)) & LPIT_MIER_TIE1_MASK)
#    define LPIT_MIER_TIE2_MASK 0x4u
#    define LPIT_MIER_TIE2_SHIFT 2u
#    define LPIT_MIER_TIE2_WIDTH 1u
#    define LPIT_MIER_TIE2(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MIER_TIE2_SHIFT)) & LPIT_MIER_TIE2_MASK)
#    define LPIT_MIER_TIE3_MASK 0x8u
#    define LPIT_MIER_TIE3_SHIFT 3u
#    define LPIT_MIER_TIE3_WIDTH 1u
#    define LPIT_MIER_TIE3(x) (((uint32_t)(((uint32_t)(x)) << LPIT_MIER_TIE3_SHIFT)) & LPIT_MIER_TIE3_MASK)
/* SETTEN Bit Fields */
#    define LPIT_SETTEN_SET_T_EN_0_MASK 0x1u
#    define LPIT_SETTEN_SET_T_EN_0_SHIFT 0u
#    define LPIT_SETTEN_SET_T_EN_0_WIDTH 1u
#    define LPIT_SETTEN_SET_T_EN_0(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_SETTEN_SET_T_EN_0_SHIFT)) & LPIT_SETTEN_SET_T_EN_0_MASK)
#    define LPIT_SETTEN_SET_T_EN_1_MASK 0x2u
#    define LPIT_SETTEN_SET_T_EN_1_SHIFT 1u
#    define LPIT_SETTEN_SET_T_EN_1_WIDTH 1u
#    define LPIT_SETTEN_SET_T_EN_1(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_SETTEN_SET_T_EN_1_SHIFT)) & LPIT_SETTEN_SET_T_EN_1_MASK)
#    define LPIT_SETTEN_SET_T_EN_2_MASK 0x4u
#    define LPIT_SETTEN_SET_T_EN_2_SHIFT 2u
#    define LPIT_SETTEN_SET_T_EN_2_WIDTH 1u
#    define LPIT_SETTEN_SET_T_EN_2(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_SETTEN_SET_T_EN_2_SHIFT)) & LPIT_SETTEN_SET_T_EN_2_MASK)
#    define LPIT_SETTEN_SET_T_EN_3_MASK 0x8u
#    define LPIT_SETTEN_SET_T_EN_3_SHIFT 3u
#    define LPIT_SETTEN_SET_T_EN_3_WIDTH 1u
#    define LPIT_SETTEN_SET_T_EN_3(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_SETTEN_SET_T_EN_3_SHIFT)) & LPIT_SETTEN_SET_T_EN_3_MASK)
/* CLRTEN Bit Fields */
#    define LPIT_CLRTEN_CLR_T_EN_0_MASK 0x1u
#    define LPIT_CLRTEN_CLR_T_EN_0_SHIFT 0u
#    define LPIT_CLRTEN_CLR_T_EN_0_WIDTH 1u
#    define LPIT_CLRTEN_CLR_T_EN_0(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_CLRTEN_CLR_T_EN_0_SHIFT)) & LPIT_CLRTEN_CLR_T_EN_0_MASK)
#    define LPIT_CLRTEN_CLR_T_EN_1_MASK 0x2u
#    define LPIT_CLRTEN_CLR_T_EN_1_SHIFT 1u
#    define LPIT_CLRTEN_CLR_T_EN_1_WIDTH 1u
#    define LPIT_CLRTEN_CLR_T_EN_1(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_CLRTEN_CLR_T_EN_1_SHIFT)) & LPIT_CLRTEN_CLR_T_EN_1_MASK)
#    define LPIT_CLRTEN_CLR_T_EN_2_MASK 0x4u
#    define LPIT_CLRTEN_CLR_T_EN_2_SHIFT 2u
#    define LPIT_CLRTEN_CLR_T_EN_2_WIDTH 1u
#    define LPIT_CLRTEN_CLR_T_EN_2(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_CLRTEN_CLR_T_EN_2_SHIFT)) & LPIT_CLRTEN_CLR_T_EN_2_MASK)
#    define LPIT_CLRTEN_CLR_T_EN_3_MASK 0x8u
#    define LPIT_CLRTEN_CLR_T_EN_3_SHIFT 3u
#    define LPIT_CLRTEN_CLR_T_EN_3_WIDTH 1u
#    define LPIT_CLRTEN_CLR_T_EN_3(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_CLRTEN_CLR_T_EN_3_SHIFT)) & LPIT_CLRTEN_CLR_T_EN_3_MASK)
/* TMR_TVAL Bit Fields */
#    define LPIT_TMR_TVAL_TMR_VAL_MASK 0xFFFFFFFFu
#    define LPIT_TMR_TVAL_TMR_VAL_SHIFT 0u
#    define LPIT_TMR_TVAL_TMR_VAL_WIDTH 32u
#    define LPIT_TMR_TVAL_TMR_VAL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TVAL_TMR_VAL_SHIFT)) & LPIT_TMR_TVAL_TMR_VAL_MASK)
/* TMR_CVAL Bit Fields */
#    define LPIT_TMR_CVAL_TMR_CUR_VAL_MASK 0xFFFFFFFFu
#    define LPIT_TMR_CVAL_TMR_CUR_VAL_SHIFT 0u
#    define LPIT_TMR_CVAL_TMR_CUR_VAL_WIDTH 32u
#    define LPIT_TMR_CVAL_TMR_CUR_VAL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_CVAL_TMR_CUR_VAL_SHIFT)) & LPIT_TMR_CVAL_TMR_CUR_VAL_MASK)
/* TMR_TCTRL Bit Fields */
#    define LPIT_TMR_TCTRL_T_EN_MASK 0x1u
#    define LPIT_TMR_TCTRL_T_EN_SHIFT 0u
#    define LPIT_TMR_TCTRL_T_EN_WIDTH 1u
#    define LPIT_TMR_TCTRL_T_EN(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_T_EN_SHIFT)) & LPIT_TMR_TCTRL_T_EN_MASK)
#    define LPIT_TMR_TCTRL_CHAIN_MASK 0x2u
#    define LPIT_TMR_TCTRL_CHAIN_SHIFT 1u
#    define LPIT_TMR_TCTRL_CHAIN_WIDTH 1u
#    define LPIT_TMR_TCTRL_CHAIN(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_CHAIN_SHIFT)) & LPIT_TMR_TCTRL_CHAIN_MASK)
#    define LPIT_TMR_TCTRL_MODE_MASK 0xCu
#    define LPIT_TMR_TCTRL_MODE_SHIFT 2u
#    define LPIT_TMR_TCTRL_MODE_WIDTH 2u
#    define LPIT_TMR_TCTRL_MODE(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_MODE_SHIFT)) & LPIT_TMR_TCTRL_MODE_MASK)
#    define LPIT_TMR_TCTRL_TSOT_MASK 0x10000u
#    define LPIT_TMR_TCTRL_TSOT_SHIFT 16u
#    define LPIT_TMR_TCTRL_TSOT_WIDTH 1u
#    define LPIT_TMR_TCTRL_TSOT(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_TSOT_SHIFT)) & LPIT_TMR_TCTRL_TSOT_MASK)
#    define LPIT_TMR_TCTRL_TSOI_MASK 0x20000u
#    define LPIT_TMR_TCTRL_TSOI_SHIFT 17u
#    define LPIT_TMR_TCTRL_TSOI_WIDTH 1u
#    define LPIT_TMR_TCTRL_TSOI(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_TSOI_SHIFT)) & LPIT_TMR_TCTRL_TSOI_MASK)
#    define LPIT_TMR_TCTRL_TROT_MASK 0x40000u
#    define LPIT_TMR_TCTRL_TROT_SHIFT 18u
#    define LPIT_TMR_TCTRL_TROT_WIDTH 1u
#    define LPIT_TMR_TCTRL_TROT(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_TROT_SHIFT)) & LPIT_TMR_TCTRL_TROT_MASK)
#    define LPIT_TMR_TCTRL_TRG_SRC_MASK 0x800000u
#    define LPIT_TMR_TCTRL_TRG_SRC_SHIFT 23u
#    define LPIT_TMR_TCTRL_TRG_SRC_WIDTH 1u
#    define LPIT_TMR_TCTRL_TRG_SRC(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_TRG_SRC_SHIFT)) & LPIT_TMR_TCTRL_TRG_SRC_MASK)
#    define LPIT_TMR_TCTRL_TRG_SEL_MASK 0xF000000u
#    define LPIT_TMR_TCTRL_TRG_SEL_SHIFT 24u
#    define LPIT_TMR_TCTRL_TRG_SEL_WIDTH 4u
#    define LPIT_TMR_TCTRL_TRG_SEL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPIT_TMR_TCTRL_TRG_SEL_SHIFT)) & LPIT_TMR_TCTRL_TRG_SEL_MASK)

/*!
 * @}
 */ /* end of group LPIT_Register_Masks */

/*!
 * @}
 */ /* end of group LPIT_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Peripheral_Access_Layer LPSPI Peripheral Access Layer
 * @{
 */

/** LPSPI - Size of Registers Arrays */

/** LPSPI - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    uint8_t      RESERVED_0[8];
    __IO uint32_t CR;    /**< Control Register, offset: 0x10 */
    __IO uint32_t SR;    /**< Status Register, offset: 0x14 */
    __IO uint32_t IER;   /**< Interrupt Enable Register, offset: 0x18 */
    __IO uint32_t DER;   /**< DMA Enable Register, offset: 0x1C */
    __IO uint32_t CFGR0; /**< Configuration Register 0, offset: 0x20 */
    __IO uint32_t CFGR1; /**< Configuration Register 1, offset: 0x24 */
    uint8_t       RESERVED_1[8];
    __IO uint32_t DMR0; /**< Data Match Register 0, offset: 0x30 */
    __IO uint32_t DMR1; /**< Data Match Register 1, offset: 0x34 */
    uint8_t       RESERVED_2[8];
    __IO uint32_t CCR; /**< Clock Configuration Register, offset: 0x40 */
    uint8_t       RESERVED_3[20];
    __IO uint32_t FCR; /**< FIFO Control Register, offset: 0x58 */
    __I uint32_t FSR;  /**< FIFO Status Register, offset: 0x5C */
    __IO uint32_t TCR; /**< Transmit Command Register, offset: 0x60 */
    __O uint32_t TDR;  /**< Transmit Data Register, offset: 0x64 */
    uint8_t      RESERVED_4[8];
    __I uint32_t RSR; /**< Receive Status Register, offset: 0x70 */
    __I uint32_t RDR; /**< Receive Data Register, offset: 0x74 */
} LPSPI_Type, *LPSPI_MemMapPtr;

/** Number of instances of the LPSPI module. */
#    define LPSPI_INSTANCE_COUNT (3u)

/* LPSPI - Peripheral instance base addresses */
/** Peripheral LPSPI0 base address */
#    define LPSPI0_BASE (0x4002C000u)
/** Peripheral LPSPI0 base pointer */
#    define LPSPI0 ((LPSPI_Type*) LPSPI0_BASE)
/** Peripheral LPSPI1 base address */
#    define LPSPI1_BASE (0x4002D000u)
/** Peripheral LPSPI1 base pointer */
#    define LPSPI1 ((LPSPI_Type*) LPSPI1_BASE)
/** Peripheral LPSPI2 base address */
#    define LPSPI2_BASE (0x4002E000u)
/** Peripheral LPSPI2 base pointer */
#    define LPSPI2 ((LPSPI_Type*) LPSPI2_BASE)
/** Array initializer of LPSPI peripheral base addresses */
#    define LPSPI_BASE_ADDRS                      \
        {                                         \
            LPSPI0_BASE, LPSPI1_BASE, LPSPI2_BASE \
        }
/** Array initializer of LPSPI peripheral base pointers */
#    define LPSPI_BASE_PTRS        \
        {                          \
            LPSPI0, LPSPI1, LPSPI2 \
        }
/** Number of interrupt vector arrays for the LPSPI module. */
#    define LPSPI_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the LPSPI module. */
#    define LPSPI_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the LPSPI peripheral type */
#    define LPSPI_IRQS                            \
        {                                         \
            LPSPI0_IRQn, LPSPI1_IRQn, LPSPI2_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- LPSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPSPI_Register_Masks LPSPI Register Masks
 * @{
 */

