OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* VERID Bit Fields */
#    define LPSPI_VERID_FEATURE_MASK 0xFFFFu
#    define LPSPI_VERID_FEATURE_SHIFT 0u
#    define LPSPI_VERID_FEATURE_WIDTH 16u
#    define LPSPI_VERID_FEATURE(x) \
        (((uint32_t)(((uint32_t)(x)) << LPSPI_VERID_FEATURE_SHIFT)) & LPSPI_VERID_FEATURE_MASK)
#    define LPSPI_VERID_MINOR_MASK 0xFF0000u
#    define LPSPI_VERID_MINOR_SHIFT 16u
#    define LPSPI_VERID_MINOR_WIDTH 8u
#    define LPSPI_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_VERID_MINOR_SHIFT)) & LPSPI_VERID_MINOR_MASK)
#    define LPSPI_VERID_MAJOR_MASK 0xFF000000u
#    define LPSPI_VERID_MAJOR_SHIFT 24u
#    define LPSPI_VERID_MAJOR_WIDTH 8u
#    define LPSPI_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_VERID_MAJOR_SHIFT)) & LPSPI_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define LPSPI_PARAM_TXFIFO_MASK 0xFFu
#    define LPSPI_PARAM_TXFIFO_SHIFT 0u
#    define LPSPI_PARAM_TXFIFO_WIDTH 8u
#    define LPSPI_PARAM_TXFIFO(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_PARAM_TXFIFO_SHIFT)) & LPSPI_PARAM_TXFIFO_MASK)
#    define LPSPI_PARAM_RXFIFO_MASK 0xFF00u
#    define LPSPI_PARAM_RXFIFO_SHIFT 8u
#    define LPSPI_PARAM_RXFIFO_WIDTH 8u
#    define LPSPI_PARAM_RXFIFO(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_PARAM_RXFIFO_SHIFT)) & LPSPI_PARAM_RXFIFO_MASK)
/* CR Bit Fields */
#    define LPSPI_CR_MEN_MASK 0x1u
#    define LPSPI_CR_MEN_SHIFT 0u
#    define LPSPI_CR_MEN_WIDTH 1u
#    define LPSPI_CR_MEN(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_MEN_SHIFT)) & LPSPI_CR_MEN_MASK)
#    define LPSPI_CR_RST_MASK 0x2u
#    define LPSPI_CR_RST_SHIFT 1u
#    define LPSPI_CR_RST_WIDTH 1u
#    define LPSPI_CR_RST(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_RST_SHIFT)) & LPSPI_CR_RST_MASK)
#    define LPSPI_CR_DOZEN_MASK 0x4u
#    define LPSPI_CR_DOZEN_SHIFT 2u
#    define LPSPI_CR_DOZEN_WIDTH 1u
#    define LPSPI_CR_DOZEN(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_DOZEN_SHIFT)) & LPSPI_CR_DOZEN_MASK)
#    define LPSPI_CR_DBGEN_MASK 0x8u
#    define LPSPI_CR_DBGEN_SHIFT 3u
#    define LPSPI_CR_DBGEN_WIDTH 1u
#    define LPSPI_CR_DBGEN(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_DBGEN_SHIFT)) & LPSPI_CR_DBGEN_MASK)
#    define LPSPI_CR_RTF_MASK 0x100u
#    define LPSPI_CR_RTF_SHIFT 8u
#    define LPSPI_CR_RTF_WIDTH 1u
#    define LPSPI_CR_RTF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_RTF_SHIFT)) & LPSPI_CR_RTF_MASK)
#    define LPSPI_CR_RRF_MASK 0x200u
#    define LPSPI_CR_RRF_SHIFT 9u
#    define LPSPI_CR_RRF_WIDTH 1u
#    define LPSPI_CR_RRF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CR_RRF_SHIFT)) & LPSPI_CR_RRF_MASK)
/* SR Bit Fields */
#    define LPSPI_SR_TDF_MASK 0x1u
#    define LPSPI_SR_TDF_SHIFT 0u
#    define LPSPI_SR_TDF_WIDTH 1u
#    define LPSPI_SR_TDF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_TDF_SHIFT)) & LPSPI_SR_TDF_MASK)
#    define LPSPI_SR_RDF_MASK 0x2u
#    define LPSPI_SR_RDF_SHIFT 1u
#    define LPSPI_SR_RDF_WIDTH 1u
#    define LPSPI_SR_RDF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_RDF_SHIFT)) & LPSPI_SR_RDF_MASK)
#    define LPSPI_SR_WCF_MASK 0x100u
#    define LPSPI_SR_WCF_SHIFT 8u
#    define LPSPI_SR_WCF_WIDTH 1u
#    define LPSPI_SR_WCF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_WCF_SHIFT)) & LPSPI_SR_WCF_MASK)
#    define LPSPI_SR_FCF_MASK 0x200u
#    define LPSPI_SR_FCF_SHIFT 9u
#    define LPSPI_SR_FCF_WIDTH 1u
#    define LPSPI_SR_FCF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_FCF_SHIFT)) & LPSPI_SR_FCF_MASK)
#    define LPSPI_SR_TCF_MASK 0x400u
#    define LPSPI_SR_TCF_SHIFT 10u
#    define LPSPI_SR_TCF_WIDTH 1u
#    define LPSPI_SR_TCF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_TCF_SHIFT)) & LPSPI_SR_TCF_MASK)
#    define LPSPI_SR_TEF_MASK 0x800u
#    define LPSPI_SR_TEF_SHIFT 11u
#    define LPSPI_SR_TEF_WIDTH 1u
#    define LPSPI_SR_TEF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_TEF_SHIFT)) & LPSPI_SR_TEF_MASK)
#    define LPSPI_SR_REF_MASK 0x1000u
#    define LPSPI_SR_REF_SHIFT 12u
#    define LPSPI_SR_REF_WIDTH 1u
#    define LPSPI_SR_REF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_REF_SHIFT)) & LPSPI_SR_REF_MASK)
#    define LPSPI_SR_DMF_MASK 0x2000u
#    define LPSPI_SR_DMF_SHIFT 13u
#    define LPSPI_SR_DMF_WIDTH 1u
#    define LPSPI_SR_DMF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_DMF_SHIFT)) & LPSPI_SR_DMF_MASK)
#    define LPSPI_SR_MBF_MASK 0x1000000u
#    define LPSPI_SR_MBF_SHIFT 24u
#    define LPSPI_SR_MBF_WIDTH 1u
#    define LPSPI_SR_MBF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_SR_MBF_SHIFT)) & LPSPI_SR_MBF_MASK)
/* IER Bit Fields */
#    define LPSPI_IER_TDIE_MASK 0x1u
#    define LPSPI_IER_TDIE_SHIFT 0u
#    define LPSPI_IER_TDIE_WIDTH 1u
#    define LPSPI_IER_TDIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_TDIE_SHIFT)) & LPSPI_IER_TDIE_MASK)
#    define LPSPI_IER_RDIE_MASK 0x2u
#    define LPSPI_IER_RDIE_SHIFT 1u
#    define LPSPI_IER_RDIE_WIDTH 1u
#    define LPSPI_IER_RDIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_RDIE_SHIFT)) & LPSPI_IER_RDIE_MASK)
#    define LPSPI_IER_WCIE_MASK 0x100u
#    define LPSPI_IER_WCIE_SHIFT 8u
#    define LPSPI_IER_WCIE_WIDTH 1u
#    define LPSPI_IER_WCIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_WCIE_SHIFT)) & LPSPI_IER_WCIE_MASK)
#    define LPSPI_IER_FCIE_MASK 0x200u
#    define LPSPI_IER_FCIE_SHIFT 9u
#    define LPSPI_IER_FCIE_WIDTH 1u
#    define LPSPI_IER_FCIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_FCIE_SHIFT)) & LPSPI_IER_FCIE_MASK)
#    define LPSPI_IER_TCIE_MASK 0x400u
#    define LPSPI_IER_TCIE_SHIFT 10u
#    define LPSPI_IER_TCIE_WIDTH 1u
#    define LPSPI_IER_TCIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_TCIE_SHIFT)) & LPSPI_IER_TCIE_MASK)
#    define LPSPI_IER_TEIE_MASK 0x800u
#    define LPSPI_IER_TEIE_SHIFT 11u
#    define LPSPI_IER_TEIE_WIDTH 1u
#    define LPSPI_IER_TEIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_TEIE_SHIFT)) & LPSPI_IER_TEIE_MASK)
#    define LPSPI_IER_REIE_MASK 0x1000u
#    define LPSPI_IER_REIE_SHIFT 12u
#    define LPSPI_IER_REIE_WIDTH 1u
#    define LPSPI_IER_REIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_REIE_SHIFT)) & LPSPI_IER_REIE_MASK)
#    define LPSPI_IER_DMIE_MASK 0x2000u
#    define LPSPI_IER_DMIE_SHIFT 13u
#    define LPSPI_IER_DMIE_WIDTH 1u
#    define LPSPI_IER_DMIE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_IER_DMIE_SHIFT)) & LPSPI_IER_DMIE_MASK)
/* DER Bit Fields */
#    define LPSPI_DER_TDDE_MASK 0x1u
#    define LPSPI_DER_TDDE_SHIFT 0u
#    define LPSPI_DER_TDDE_WIDTH 1u
#    define LPSPI_DER_TDDE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_DER_TDDE_SHIFT)) & LPSPI_DER_TDDE_MASK)
#    define LPSPI_DER_RDDE_MASK 0x2u
#    define LPSPI_DER_RDDE_SHIFT 1u
#    define LPSPI_DER_RDDE_WIDTH 1u
#    define LPSPI_DER_RDDE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_DER_RDDE_SHIFT)) & LPSPI_DER_RDDE_MASK)
/* CFGR0 Bit Fields */
#    define LPSPI_CFGR0_HREN_MASK 0x1u
#    define LPSPI_CFGR0_HREN_SHIFT 0u
#    define LPSPI_CFGR0_HREN_WIDTH 1u
#    define LPSPI_CFGR0_HREN(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR0_HREN_SHIFT)) & LPSPI_CFGR0_HREN_MASK)
#    define LPSPI_CFGR0_HRPOL_MASK 0x2u
#    define LPSPI_CFGR0_HRPOL_SHIFT 1u
#    define LPSPI_CFGR0_HRPOL_WIDTH 1u
#    define LPSPI_CFGR0_HRPOL(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR0_HRPOL_SHIFT)) & LPSPI_CFGR0_HRPOL_MASK)
#    define LPSPI_CFGR0_HRSEL_MASK 0x4u
#    define LPSPI_CFGR0_HRSEL_SHIFT 2u
#    define LPSPI_CFGR0_HRSEL_WIDTH 1u
#    define LPSPI_CFGR0_HRSEL(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR0_HRSEL_SHIFT)) & LPSPI_CFGR0_HRSEL_MASK)
#    define LPSPI_CFGR0_CIRFIFO_MASK 0x100u
#    define LPSPI_CFGR0_CIRFIFO_SHIFT 8u
#    define LPSPI_CFGR0_CIRFIFO_WIDTH 1u
#    define LPSPI_CFGR0_CIRFIFO(x) \
        (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR0_CIRFIFO_SHIFT)) & LPSPI_CFGR0_CIRFIFO_MASK)
#    define LPSPI_CFGR0_RDMO_MASK 0x200u
#    define LPSPI_CFGR0_RDMO_SHIFT 9u
#    define LPSPI_CFGR0_RDMO_WIDTH 1u
#    define LPSPI_CFGR0_RDMO(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR0_RDMO_SHIFT)) & LPSPI_CFGR0_RDMO_MASK)
/* CFGR1 Bit Fields */
#    define LPSPI_CFGR1_MASTER_MASK 0x1u
#    define LPSPI_CFGR1_MASTER_SHIFT 0u
#    define LPSPI_CFGR1_MASTER_WIDTH 1u
#    define LPSPI_CFGR1_MASTER(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_MASTER_SHIFT)) & LPSPI_CFGR1_MASTER_MASK)
#    define LPSPI_CFGR1_SAMPLE_MASK 0x2u
#    define LPSPI_CFGR1_SAMPLE_SHIFT 1u
#    define LPSPI_CFGR1_SAMPLE_WIDTH 1u
#    define LPSPI_CFGR1_SAMPLE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_SAMPLE_SHIFT)) & LPSPI_CFGR1_SAMPLE_MASK)
#    define LPSPI_CFGR1_AUTOPCS_MASK 0x4u
#    define LPSPI_CFGR1_AUTOPCS_SHIFT 2u
#    define LPSPI_CFGR1_AUTOPCS_WIDTH 1u
#    define LPSPI_CFGR1_AUTOPCS(x) \
        (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_AUTOPCS_SHIFT)) & LPSPI_CFGR1_AUTOPCS_MASK)
#    define LPSPI_CFGR1_NOSTALL_MASK 0x8u
#    define LPSPI_CFGR1_NOSTALL_SHIFT 3u
#    define LPSPI_CFGR1_NOSTALL_WIDTH 1u
#    define LPSPI_CFGR1_NOSTALL(x) \
        (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_NOSTALL_SHIFT)) & LPSPI_CFGR1_NOSTALL_MASK)
#    define LPSPI_CFGR1_PCSPOL_MASK 0xF00u
#    define LPSPI_CFGR1_PCSPOL_SHIFT 8u
#    define LPSPI_CFGR1_PCSPOL_WIDTH 4u
#    define LPSPI_CFGR1_PCSPOL(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_PCSPOL_SHIFT)) & LPSPI_CFGR1_PCSPOL_MASK)
#    define LPSPI_CFGR1_MATCFG_MASK 0x70000u
#    define LPSPI_CFGR1_MATCFG_SHIFT 16u
#    define LPSPI_CFGR1_MATCFG_WIDTH 3u
#    define LPSPI_CFGR1_MATCFG(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_MATCFG_SHIFT)) & LPSPI_CFGR1_MATCFG_MASK)
#    define LPSPI_CFGR1_PINCFG_MASK 0x3000000u
#    define LPSPI_CFGR1_PINCFG_SHIFT 24u
#    define LPSPI_CFGR1_PINCFG_WIDTH 2u
#    define LPSPI_CFGR1_PINCFG(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_PINCFG_SHIFT)) & LPSPI_CFGR1_PINCFG_MASK)
#    define LPSPI_CFGR1_OUTCFG_MASK 0x4000000u
#    define LPSPI_CFGR1_OUTCFG_SHIFT 26u
#    define LPSPI_CFGR1_OUTCFG_WIDTH 1u
#    define LPSPI_CFGR1_OUTCFG(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_OUTCFG_SHIFT)) & LPSPI_CFGR1_OUTCFG_MASK)
#    define LPSPI_CFGR1_PCSCFG_MASK 0x8000000u
#    define LPSPI_CFGR1_PCSCFG_SHIFT 27u
#    define LPSPI_CFGR1_PCSCFG_WIDTH 1u
#    define LPSPI_CFGR1_PCSCFG(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CFGR1_PCSCFG_SHIFT)) & LPSPI_CFGR1_PCSCFG_MASK)
/* DMR0 Bit Fields */
#    define LPSPI_DMR0_MATCH0_MASK 0xFFFFFFFFu
#    define LPSPI_DMR0_MATCH0_SHIFT 0u
#    define LPSPI_DMR0_MATCH0_WIDTH 32u
#    define LPSPI_DMR0_MATCH0(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_DMR0_MATCH0_SHIFT)) & LPSPI_DMR0_MATCH0_MASK)
/* DMR1 Bit Fields */
#    define LPSPI_DMR1_MATCH1_MASK 0xFFFFFFFFu
#    define LPSPI_DMR1_MATCH1_SHIFT 0u
#    define LPSPI_DMR1_MATCH1_WIDTH 32u
#    define LPSPI_DMR1_MATCH1(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_DMR1_MATCH1_SHIFT)) & LPSPI_DMR1_MATCH1_MASK)
/* CCR Bit Fields */
#    define LPSPI_CCR_SCKDIV_MASK 0xFFu
#    define LPSPI_CCR_SCKDIV_SHIFT 0u
#    define LPSPI_CCR_SCKDIV_WIDTH 8u
#    define LPSPI_CCR_SCKDIV(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CCR_SCKDIV_SHIFT)) & LPSPI_CCR_SCKDIV_MASK)
#    define LPSPI_CCR_DBT_MASK 0xFF00u
#    define LPSPI_CCR_DBT_SHIFT 8u
#    define LPSPI_CCR_DBT_WIDTH 8u
#    define LPSPI_CCR_DBT(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CCR_DBT_SHIFT)) & LPSPI_CCR_DBT_MASK)
#    define LPSPI_CCR_PCSSCK_MASK 0xFF0000u
#    define LPSPI_CCR_PCSSCK_SHIFT 16u
#    define LPSPI_CCR_PCSSCK_WIDTH 8u
#    define LPSPI_CCR_PCSSCK(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CCR_PCSSCK_SHIFT)) & LPSPI_CCR_PCSSCK_MASK)
#    define LPSPI_CCR_SCKPCS_MASK 0xFF000000u
#    define LPSPI_CCR_SCKPCS_SHIFT 24u
#    define LPSPI_CCR_SCKPCS_WIDTH 8u
#    define LPSPI_CCR_SCKPCS(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_CCR_SCKPCS_SHIFT)) & LPSPI_CCR_SCKPCS_MASK)
/* FCR Bit Fields */
#    define LPSPI_FCR_TXWATER_MASK 0x3u
#    define LPSPI_FCR_TXWATER_SHIFT 0u
#    define LPSPI_FCR_TXWATER_WIDTH 2u
#    define LPSPI_FCR_TXWATER(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_FCR_TXWATER_SHIFT)) & LPSPI_FCR_TXWATER_MASK)
#    define LPSPI_FCR_RXWATER_MASK 0x30000u
#    define LPSPI_FCR_RXWATER_SHIFT 16u
#    define LPSPI_FCR_RXWATER_WIDTH 2u
#    define LPSPI_FCR_RXWATER(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_FCR_RXWATER_SHIFT)) & LPSPI_FCR_RXWATER_MASK)
/* FSR Bit Fields */
#    define LPSPI_FSR_TXCOUNT_MASK 0x7u
#    define LPSPI_FSR_TXCOUNT_SHIFT 0u
#    define LPSPI_FSR_TXCOUNT_WIDTH 3u
#    define LPSPI_FSR_TXCOUNT(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_FSR_TXCOUNT_SHIFT)) & LPSPI_FSR_TXCOUNT_MASK)
#    define LPSPI_FSR_RXCOUNT_MASK 0x70000u
#    define LPSPI_FSR_RXCOUNT_SHIFT 16u
#    define LPSPI_FSR_RXCOUNT_WIDTH 3u
#    define LPSPI_FSR_RXCOUNT(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_FSR_RXCOUNT_SHIFT)) & LPSPI_FSR_RXCOUNT_MASK)
/* TCR Bit Fields */
#    define LPSPI_TCR_FRAMESZ_MASK 0xFFFu
#    define LPSPI_TCR_FRAMESZ_SHIFT 0u
#    define LPSPI_TCR_FRAMESZ_WIDTH 12u
#    define LPSPI_TCR_FRAMESZ(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_FRAMESZ_SHIFT)) & LPSPI_TCR_FRAMESZ_MASK)
#    define LPSPI_TCR_WIDTH_MASK 0x30000u
#    define LPSPI_TCR_WIDTH_SHIFT 16u
#    define LPSPI_TCR_WIDTH_WIDTH 2u
#    define LPSPI_TCR_WIDTH(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_WIDTH_SHIFT)) & LPSPI_TCR_WIDTH_MASK)
#    define LPSPI_TCR_TXMSK_MASK 0x40000u
#    define LPSPI_TCR_TXMSK_SHIFT 18u
#    define LPSPI_TCR_TXMSK_WIDTH 1u
#    define LPSPI_TCR_TXMSK(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_TXMSK_SHIFT)) & LPSPI_TCR_TXMSK_MASK)
#    define LPSPI_TCR_RXMSK_MASK 0x80000u
#    define LPSPI_TCR_RXMSK_SHIFT 19u
#    define LPSPI_TCR_RXMSK_WIDTH 1u
#    define LPSPI_TCR_RXMSK(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_RXMSK_SHIFT)) & LPSPI_TCR_RXMSK_MASK)
#    define LPSPI_TCR_CONTC_MASK 0x100000u
#    define LPSPI_TCR_CONTC_SHIFT 20u
#    define LPSPI_TCR_CONTC_WIDTH 1u
#    define LPSPI_TCR_CONTC(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_CONTC_SHIFT)) & LPSPI_TCR_CONTC_MASK)
#    define LPSPI_TCR_CONT_MASK 0x200000u
#    define LPSPI_TCR_CONT_SHIFT 21u
#    define LPSPI_TCR_CONT_WIDTH 1u
#    define LPSPI_TCR_CONT(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_CONT_SHIFT)) & LPSPI_TCR_CONT_MASK)
#    define LPSPI_TCR_BYSW_MASK 0x400000u
#    define LPSPI_TCR_BYSW_SHIFT 22u
#    define LPSPI_TCR_BYSW_WIDTH 1u
#    define LPSPI_TCR_BYSW(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_BYSW_SHIFT)) & LPSPI_TCR_BYSW_MASK)
#    define LPSPI_TCR_LSBF_MASK 0x800000u
#    define LPSPI_TCR_LSBF_SHIFT 23u
#    define LPSPI_TCR_LSBF_WIDTH 1u
#    define LPSPI_TCR_LSBF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_LSBF_SHIFT)) & LPSPI_TCR_LSBF_MASK)
#    define LPSPI_TCR_PCS_MASK 0x3000000u
#    define LPSPI_TCR_PCS_SHIFT 24u
#    define LPSPI_TCR_PCS_WIDTH 2u
#    define LPSPI_TCR_PCS(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_PCS_SHIFT)) & LPSPI_TCR_PCS_MASK)
#    define LPSPI_TCR_PRESCALE_MASK 0x38000000u
#    define LPSPI_TCR_PRESCALE_SHIFT 27u
#    define LPSPI_TCR_PRESCALE_WIDTH 3u
#    define LPSPI_TCR_PRESCALE(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_PRESCALE_SHIFT)) & LPSPI_TCR_PRESCALE_MASK)
#    define LPSPI_TCR_CPHA_MASK 0x40000000u
#    define LPSPI_TCR_CPHA_SHIFT 30u
#    define LPSPI_TCR_CPHA_WIDTH 1u
#    define LPSPI_TCR_CPHA(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_CPHA_SHIFT)) & LPSPI_TCR_CPHA_MASK)
#    define LPSPI_TCR_CPOL_MASK 0x80000000u
#    define LPSPI_TCR_CPOL_SHIFT 31u
#    define LPSPI_TCR_CPOL_WIDTH 1u
#    define LPSPI_TCR_CPOL(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TCR_CPOL_SHIFT)) & LPSPI_TCR_CPOL_MASK)
/* TDR Bit Fields */
#    define LPSPI_TDR_DATA_MASK 0xFFFFFFFFu
#    define LPSPI_TDR_DATA_SHIFT 0u
#    define LPSPI_TDR_DATA_WIDTH 32u
#    define LPSPI_TDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_TDR_DATA_SHIFT)) & LPSPI_TDR_DATA_MASK)
/* RSR Bit Fields */
#    define LPSPI_RSR_SOF_MASK 0x1u
#    define LPSPI_RSR_SOF_SHIFT 0u
#    define LPSPI_RSR_SOF_WIDTH 1u
#    define LPSPI_RSR_SOF(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_RSR_SOF_SHIFT)) & LPSPI_RSR_SOF_MASK)
#    define LPSPI_RSR_RXEMPTY_MASK 0x2u
#    define LPSPI_RSR_RXEMPTY_SHIFT 1u
#    define LPSPI_RSR_RXEMPTY_WIDTH 1u
#    define LPSPI_RSR_RXEMPTY(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_RSR_RXEMPTY_SHIFT)) & LPSPI_RSR_RXEMPTY_MASK)
/* RDR Bit Fields */
#    define LPSPI_RDR_DATA_MASK 0xFFFFFFFFu
#    define LPSPI_RDR_DATA_SHIFT 0u
#    define LPSPI_RDR_DATA_WIDTH 32u
#    define LPSPI_RDR_DATA(x) (((uint32_t)(((uint32_t)(x)) << LPSPI_RDR_DATA_SHIFT)) & LPSPI_RDR_DATA_MASK)

/*!
 * @}
 */ /* end of group LPSPI_Register_Masks */

/*!
 * @}
 */ /* end of group LPSPI_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPTMR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPTMR_Peripheral_Access_Layer LPTMR Peripheral Access Layer
 * @{
 */

