OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** LPTMR - Size of Registers Arrays */

/** LPTMR - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CSR; /**< Low Power Timer Control Status Register, offset: 0x0 */
    __IO uint32_t PSR; /**< Low Power Timer Prescale Register, offset: 0x4 */
    __IO uint32_t CMR; /**< Low Power Timer Compare Register, offset: 0x8 */
    __IO uint32_t CNR; /**< Low Power Timer Counter Register, offset: 0xC */
} LPTMR_Type, *LPTMR_MemMapPtr;

/** Number of instances of the LPTMR module. */
#    define LPTMR_INSTANCE_COUNT (1u)

/* LPTMR - Peripheral instance base addresses */
/** Peripheral LPTMR0 base address */
#    define LPTMR0_BASE (0x40040000u)
/** Peripheral LPTMR0 base pointer */
#    define LPTMR0 ((LPTMR_Type*) LPTMR0_BASE)
/** Array initializer of LPTMR peripheral base addresses */
#    define LPTMR_BASE_ADDRS \
        {                    \
            LPTMR0_BASE      \
        }
/** Array initializer of LPTMR peripheral base pointers */
#    define LPTMR_BASE_PTRS \
        {                   \
            LPTMR0          \
        }
/** Number of interrupt vector arrays for the LPTMR module. */
#    define LPTMR_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the LPTMR module. */
#    define LPTMR_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the LPTMR peripheral type */
#    define LPTMR_IRQS  \
        {               \
            LPTMR0_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- LPTMR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPTMR_Register_Masks LPTMR Register Masks
 * @{
 */

/* CSR Bit Fields */
#    define LPTMR_CSR_TEN_MASK 0x1u
#    define LPTMR_CSR_TEN_SHIFT 0u
#    define LPTMR_CSR_TEN_WIDTH 1u
#    define LPTMR_CSR_TEN(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TEN_SHIFT)) & LPTMR_CSR_TEN_MASK)
#    define LPTMR_CSR_TMS_MASK 0x2u
#    define LPTMR_CSR_TMS_SHIFT 1u
#    define LPTMR_CSR_TMS_WIDTH 1u
#    define LPTMR_CSR_TMS(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TMS_SHIFT)) & LPTMR_CSR_TMS_MASK)
#    define LPTMR_CSR_TFC_MASK 0x4u
#    define LPTMR_CSR_TFC_SHIFT 2u
#    define LPTMR_CSR_TFC_WIDTH 1u
#    define LPTMR_CSR_TFC(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TFC_SHIFT)) & LPTMR_CSR_TFC_MASK)
#    define LPTMR_CSR_TPP_MASK 0x8u
#    define LPTMR_CSR_TPP_SHIFT 3u
#    define LPTMR_CSR_TPP_WIDTH 1u
#    define LPTMR_CSR_TPP(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TPP_SHIFT)) & LPTMR_CSR_TPP_MASK)
#    define LPTMR_CSR_TPS_MASK 0x30u
#    define LPTMR_CSR_TPS_SHIFT 4u
#    define LPTMR_CSR_TPS_WIDTH 2u
#    define LPTMR_CSR_TPS(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TPS_SHIFT)) & LPTMR_CSR_TPS_MASK)
#    define LPTMR_CSR_TIE_MASK 0x40u
#    define LPTMR_CSR_TIE_SHIFT 6u
#    define LPTMR_CSR_TIE_WIDTH 1u
#    define LPTMR_CSR_TIE(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TIE_SHIFT)) & LPTMR_CSR_TIE_MASK)
#    define LPTMR_CSR_TCF_MASK 0x80u
#    define LPTMR_CSR_TCF_SHIFT 7u
#    define LPTMR_CSR_TCF_WIDTH 1u
#    define LPTMR_CSR_TCF(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TCF_SHIFT)) & LPTMR_CSR_TCF_MASK)
#    define LPTMR_CSR_TDRE_MASK 0x100u
#    define LPTMR_CSR_TDRE_SHIFT 8u
#    define LPTMR_CSR_TDRE_WIDTH 1u
#    define LPTMR_CSR_TDRE(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CSR_TDRE_SHIFT)) & LPTMR_CSR_TDRE_MASK)
/* PSR Bit Fields */
#    define LPTMR_PSR_PCS_MASK 0x3u
#    define LPTMR_PSR_PCS_SHIFT 0u
#    define LPTMR_PSR_PCS_WIDTH 2u
#    define LPTMR_PSR_PCS(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_PSR_PCS_SHIFT)) & LPTMR_PSR_PCS_MASK)
#    define LPTMR_PSR_PBYP_MASK 0x4u
#    define LPTMR_PSR_PBYP_SHIFT 2u
#    define LPTMR_PSR_PBYP_WIDTH 1u
#    define LPTMR_PSR_PBYP(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_PSR_PBYP_SHIFT)) & LPTMR_PSR_PBYP_MASK)
#    define LPTMR_PSR_PRESCALE_MASK 0x78u
#    define LPTMR_PSR_PRESCALE_SHIFT 3u
#    define LPTMR_PSR_PRESCALE_WIDTH 4u
#    define LPTMR_PSR_PRESCALE(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_PSR_PRESCALE_SHIFT)) & LPTMR_PSR_PRESCALE_MASK)
/* CMR Bit Fields */
#    define LPTMR_CMR_COMPARE_MASK 0xFFFFu
#    define LPTMR_CMR_COMPARE_SHIFT 0u
#    define LPTMR_CMR_COMPARE_WIDTH 16u
#    define LPTMR_CMR_COMPARE(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CMR_COMPARE_SHIFT)) & LPTMR_CMR_COMPARE_MASK)
/* CNR Bit Fields */
#    define LPTMR_CNR_COUNTER_MASK 0xFFFFu
#    define LPTMR_CNR_COUNTER_SHIFT 0u
#    define LPTMR_CNR_COUNTER_WIDTH 16u
#    define LPTMR_CNR_COUNTER(x) (((uint32_t)(((uint32_t)(x)) << LPTMR_CNR_COUNTER_SHIFT)) & LPTMR_CNR_COUNTER_MASK)

/*!
 * @}
 */ /* end of group LPTMR_Register_Masks */

/*!
 * @}
 */ /* end of group LPTMR_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- LPUART Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Peripheral_Access_Layer LPUART Peripheral Access Layer
 * @{
 */

/** LPUART - Size of Registers Arrays */

/** LPUART - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID;   /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM;   /**< Parameter Register, offset: 0x4 */
    __IO uint32_t GLOBAL; /**< LPUART Global Register, offset: 0x8 */
    __IO uint32_t PINCFG; /**< LPUART Pin Configuration Register, offset: 0xC */
    __IO uint32_t BAUD;   /**< LPUART Baud Rate Register, offset: 0x10 */
    __IO uint32_t STAT;   /**< LPUART Status Register, offset: 0x14 */
    __IO uint32_t CTRL;   /**< LPUART Control Register, offset: 0x18 */
    __IO uint32_t DATA;   /**< LPUART Data Register, offset: 0x1C */
    __IO uint32_t MATCH;  /**< LPUART Match Address Register, offset: 0x20 */
    __IO uint32_t MODIR;  /**< LPUART Modem IrDA Register, offset: 0x24 */
    __IO uint32_t FIFO;   /**< LPUART FIFO Register, offset: 0x28 */
    __IO uint32_t WATER;  /**< LPUART Watermark Register, offset: 0x2C */
} LPUART_Type, *LPUART_MemMapPtr;

/** Number of instances of the LPUART module. */
#    define LPUART_INSTANCE_COUNT (3u)

/* LPUART - Peripheral instance base addresses */
/** Peripheral LPUART0 base address */
#    define LPUART0_BASE (0x4006A000u)
/** Peripheral LPUART0 base pointer */
#    define LPUART0 ((LPUART_Type*) LPUART0_BASE)
/** Peripheral LPUART1 base address */
#    define LPUART1_BASE (0x4006B000u)
/** Peripheral LPUART1 base pointer */
#    define LPUART1 ((LPUART_Type*) LPUART1_BASE)
/** Peripheral LPUART2 base address */
#    define LPUART2_BASE (0x4006C000u)
/** Peripheral LPUART2 base pointer */
#    define LPUART2 ((LPUART_Type*) LPUART2_BASE)
/** Array initializer of LPUART peripheral base addresses */
#    define LPUART_BASE_ADDRS                        \
        {                                            \
            LPUART0_BASE, LPUART1_BASE, LPUART2_BASE \
        }
/** Array initializer of LPUART peripheral base pointers */
#    define LPUART_BASE_PTRS          \
        {                             \
            LPUART0, LPUART1, LPUART2 \
        }
/** Number of interrupt vector arrays for the LPUART module. */
#    define LPUART_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the RX_TX type of LPUART module. */
#    define LPUART_RX_TX_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the LPUART peripheral type */
#    define LPUART_RX_TX_IRQS                                       \
        {                                                           \
            LPUART0_RxTx_IRQn, LPUART1_RxTx_IRQn, LPUART2_RxTx_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- LPUART Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPUART_Register_Masks LPUART Register Masks
 * @{
 */

