OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define LPUART_FIFO_RXIDEN_MASK 0x1C00u
#    define LPUART_FIFO_RXIDEN_SHIFT 10u
#    define LPUART_FIFO_RXIDEN_WIDTH 3u
#    define LPUART_FIFO_RXIDEN(x) (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_RXIDEN_SHIFT)) & LPUART_FIFO_RXIDEN_MASK)
#    define LPUART_FIFO_RXFLUSH_MASK 0x4000u
#    define LPUART_FIFO_RXFLUSH_SHIFT 14u
#    define LPUART_FIFO_RXFLUSH_WIDTH 1u
#    define LPUART_FIFO_RXFLUSH(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_RXFLUSH_SHIFT)) & LPUART_FIFO_RXFLUSH_MASK)
#    define LPUART_FIFO_TXFLUSH_MASK 0x8000u
#    define LPUART_FIFO_TXFLUSH_SHIFT 15u
#    define LPUART_FIFO_TXFLUSH_WIDTH 1u
#    define LPUART_FIFO_TXFLUSH(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_TXFLUSH_SHIFT)) & LPUART_FIFO_TXFLUSH_MASK)
#    define LPUART_FIFO_RXUF_MASK 0x10000u
#    define LPUART_FIFO_RXUF_SHIFT 16u
#    define LPUART_FIFO_RXUF_WIDTH 1u
#    define LPUART_FIFO_RXUF(x) (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_RXUF_SHIFT)) & LPUART_FIFO_RXUF_MASK)
#    define LPUART_FIFO_TXOF_MASK 0x20000u
#    define LPUART_FIFO_TXOF_SHIFT 17u
#    define LPUART_FIFO_TXOF_WIDTH 1u
#    define LPUART_FIFO_TXOF(x) (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_TXOF_SHIFT)) & LPUART_FIFO_TXOF_MASK)
#    define LPUART_FIFO_RXEMPT_MASK 0x400000u
#    define LPUART_FIFO_RXEMPT_SHIFT 22u
#    define LPUART_FIFO_RXEMPT_WIDTH 1u
#    define LPUART_FIFO_RXEMPT(x) (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_RXEMPT_SHIFT)) & LPUART_FIFO_RXEMPT_MASK)
#    define LPUART_FIFO_TXEMPT_MASK 0x800000u
#    define LPUART_FIFO_TXEMPT_SHIFT 23u
#    define LPUART_FIFO_TXEMPT_WIDTH 1u
#    define LPUART_FIFO_TXEMPT(x) (((uint32_t)(((uint32_t)(x)) << LPUART_FIFO_TXEMPT_SHIFT)) & LPUART_FIFO_TXEMPT_MASK)
/* WATER Bit Fields */
#    define LPUART_WATER_TXWATER_MASK 0x3u
#    define LPUART_WATER_TXWATER_SHIFT 0u
#    define LPUART_WATER_TXWATER_WIDTH 2u
#    define LPUART_WATER_TXWATER(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_TXWATER_SHIFT)) & LPUART_WATER_TXWATER_MASK)
#    define LPUART_WATER_TXCOUNT_MASK 0x700u
#    define LPUART_WATER_TXCOUNT_SHIFT 8u
#    define LPUART_WATER_TXCOUNT_WIDTH 3u
#    define LPUART_WATER_TXCOUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_TXCOUNT_SHIFT)) & LPUART_WATER_TXCOUNT_MASK)
#    define LPUART_WATER_RXWATER_MASK 0x30000u
#    define LPUART_WATER_RXWATER_SHIFT 16u
#    define LPUART_WATER_RXWATER_WIDTH 2u
#    define LPUART_WATER_RXWATER(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_RXWATER_SHIFT)) & LPUART_WATER_RXWATER_MASK)
#    define LPUART_WATER_RXCOUNT_MASK 0x7000000u
#    define LPUART_WATER_RXCOUNT_SHIFT 24u
#    define LPUART_WATER_RXCOUNT_WIDTH 3u
#    define LPUART_WATER_RXCOUNT(x) \
        (((uint32_t)(((uint32_t)(x)) << LPUART_WATER_RXCOUNT_SHIFT)) & LPUART_WATER_RXCOUNT_MASK)

/*!
 * @}
 */ /* end of group LPUART_Register_Masks */

/*!
 * @}
 */ /* end of group LPUART_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- MCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Peripheral_Access_Layer MCM Peripheral Access Layer
 * @{
 */

/** MCM - Size of Registers Arrays */
#    define MCM_LMDR_COUNT 2u

/** MCM - Register Layout Typedef */
typedef struct
{
    uint8_t RESERVED_0[8];
    __I uint16_t PLASC; /**< Crossbar Switch (AXBS) Slave Configuration, offset: 0x8 */
    __I uint16_t PLAMC; /**< Crossbar Switch (AXBS) Master Configuration, offset: 0xA */
    __IO uint32_t CPCR; /**< Core Platform Control Register, offset: 0xC */
    __IO uint32_t ISCR; /**< Interrupt Status and Control Register, offset: 0x10 */
    uint8_t       RESERVED_1[28];
    __IO uint32_t PID; /**< Process ID Register, offset: 0x30 */
    uint8_t       RESERVED_2[12];
    __IO uint32_t CPO; /**< Compute Operation Control Register, offset: 0x40 */
    uint8_t       RESERVED_3[956];
    __IO uint32_t LMDR[MCM_LMDR_COUNT]; /**< Local Memory Descriptor Register, array offset: 0x400, array step: 0x4 */
    __IO uint32_t LMDR2;                /**< Local Memory Descriptor Register2, offset: 0x408 */
    uint8_t       RESERVED_4[116];
    __IO uint32_t LMPECR; /**< LMEM Parity and ECC Control Register, offset: 0x480 */
    uint8_t       RESERVED_5[4];
    __IO uint32_t LMPEIR; /**< LMEM Parity and ECC Interrupt Register, offset: 0x488 */
    uint8_t       RESERVED_6[4];
    __I uint32_t LMFAR;  /**< LMEM Fault Address Register, offset: 0x490 */
    __I uint32_t LMFATR; /**< LMEM Fault Attribute Register, offset: 0x494 */
    uint8_t      RESERVED_7[8];
    __I uint32_t LMFDHR; /**< LMEM Fault Data High Register, offset: 0x4A0 */
    __I uint32_t LMFDLR; /**< LMEM Fault Data Low Register, offset: 0x4A4 */
} MCM_Type, *MCM_MemMapPtr;

/** Number of instances of the MCM module. */
#    define MCM_INSTANCE_COUNT (1u)

/* MCM - Peripheral instance base addresses */
/** Peripheral MCM base address */
#    define MCM_BASE (0xE0080000u)
/** Peripheral MCM base pointer */
#    define MCM ((MCM_Type*) MCM_BASE)
/** Array initializer of MCM peripheral base addresses */
#    define MCM_BASE_ADDRS \
        {                  \
            MCM_BASE       \
        }
/** Array initializer of MCM peripheral base pointers */
#    define MCM_BASE_PTRS \
        {                 \
            MCM           \
        }
/** Number of interrupt vector arrays for the MCM module. */
#    define MCM_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the MCM module. */
#    define MCM_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the MCM peripheral type */
#    define MCM_IRQS \
        {            \
            MCM_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- MCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Masks MCM Register Masks
 * @{
 */

/* PLASC Bit Fields */
#    define MCM_PLASC_ASC_MASK 0xFFu
#    define MCM_PLASC_ASC_SHIFT 0u
#    define MCM_PLASC_ASC_WIDTH 8u
#    define MCM_PLASC_ASC(x) (((uint16_t)(((uint16_t)(x)) << MCM_PLASC_ASC_SHIFT)) & MCM_PLASC_ASC_MASK)
/* PLAMC Bit Fields */
#    define MCM_PLAMC_AMC_MASK 0xFFu
#    define MCM_PLAMC_AMC_SHIFT 0u
#    define MCM_PLAMC_AMC_WIDTH 8u
#    define MCM_PLAMC_AMC(x) (((uint16_t)(((uint16_t)(x)) << MCM_PLAMC_AMC_SHIFT)) & MCM_PLAMC_AMC_MASK)
/* CPCR Bit Fields */
#    define MCM_CPCR_HLT_FSM_ST_MASK 0x3u
#    define MCM_CPCR_HLT_FSM_ST_SHIFT 0u
#    define MCM_CPCR_HLT_FSM_ST_WIDTH 2u
#    define MCM_CPCR_HLT_FSM_ST(x) \
        (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_HLT_FSM_ST_SHIFT)) & MCM_CPCR_HLT_FSM_ST_MASK)
#    define MCM_CPCR_AXBS_HLT_REQ_MASK 0x4u
#    define MCM_CPCR_AXBS_HLT_REQ_SHIFT 2u
#    define MCM_CPCR_AXBS_HLT_REQ_WIDTH 1u
#    define MCM_CPCR_AXBS_HLT_REQ(x) \
        (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_AXBS_HLT_REQ_SHIFT)) & MCM_CPCR_AXBS_HLT_REQ_MASK)
#    define MCM_CPCR_AXBS_HLTD_MASK 0x8u
#    define MCM_CPCR_AXBS_HLTD_SHIFT 3u
#    define MCM_CPCR_AXBS_HLTD_WIDTH 1u
#    define MCM_CPCR_AXBS_HLTD(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_AXBS_HLTD_SHIFT)) & MCM_CPCR_AXBS_HLTD_MASK)
#    define MCM_CPCR_FMC_PF_IDLE_MASK 0x10u
#    define MCM_CPCR_FMC_PF_IDLE_SHIFT 4u
#    define MCM_CPCR_FMC_PF_IDLE_WIDTH 1u
#    define MCM_CPCR_FMC_PF_IDLE(x) \
        (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_FMC_PF_IDLE_SHIFT)) & MCM_CPCR_FMC_PF_IDLE_MASK)
#    define MCM_CPCR_PBRIDGE_IDLE_MASK 0x40u
#    define MCM_CPCR_PBRIDGE_IDLE_SHIFT 6u
#    define MCM_CPCR_PBRIDGE_IDLE_WIDTH 1u
#    define MCM_CPCR_PBRIDGE_IDLE(x) \
        (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_PBRIDGE_IDLE_SHIFT)) & MCM_CPCR_PBRIDGE_IDLE_MASK)
#    define MCM_CPCR_CBRR_MASK 0x200u
#    define MCM_CPCR_CBRR_SHIFT 9u
#    define MCM_CPCR_CBRR_WIDTH 1u
#    define MCM_CPCR_CBRR(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_CBRR_SHIFT)) & MCM_CPCR_CBRR_MASK)
#    define MCM_CPCR_SRAMUAP_MASK 0x3000000u
#    define MCM_CPCR_SRAMUAP_SHIFT 24u
#    define MCM_CPCR_SRAMUAP_WIDTH 2u
#    define MCM_CPCR_SRAMUAP(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_SRAMUAP_SHIFT)) & MCM_CPCR_SRAMUAP_MASK)
#    define MCM_CPCR_SRAMUWP_MASK 0x4000000u
#    define MCM_CPCR_SRAMUWP_SHIFT 26u
#    define MCM_CPCR_SRAMUWP_WIDTH 1u
#    define MCM_CPCR_SRAMUWP(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_SRAMUWP_SHIFT)) & MCM_CPCR_SRAMUWP_MASK)
#    define MCM_CPCR_SRAMLAP_MASK 0x30000000u
#    define MCM_CPCR_SRAMLAP_SHIFT 28u
#    define MCM_CPCR_SRAMLAP_WIDTH 2u
#    define MCM_CPCR_SRAMLAP(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_SRAMLAP_SHIFT)) & MCM_CPCR_SRAMLAP_MASK)
#    define MCM_CPCR_SRAMLWP_MASK 0x40000000u
#    define MCM_CPCR_SRAMLWP_SHIFT 30u
#    define MCM_CPCR_SRAMLWP_WIDTH 1u
#    define MCM_CPCR_SRAMLWP(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPCR_SRAMLWP_SHIFT)) & MCM_CPCR_SRAMLWP_MASK)
/* ISCR Bit Fields */
#    define MCM_ISCR_FIOC_MASK 0x100u
#    define MCM_ISCR_FIOC_SHIFT 8u
#    define MCM_ISCR_FIOC_WIDTH 1u
#    define MCM_ISCR_FIOC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIOC_SHIFT)) & MCM_ISCR_FIOC_MASK)
#    define MCM_ISCR_FDZC_MASK 0x200u
#    define MCM_ISCR_FDZC_SHIFT 9u
#    define MCM_ISCR_FDZC_WIDTH 1u
#    define MCM_ISCR_FDZC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FDZC_SHIFT)) & MCM_ISCR_FDZC_MASK)
#    define MCM_ISCR_FOFC_MASK 0x400u
#    define MCM_ISCR_FOFC_SHIFT 10u
#    define MCM_ISCR_FOFC_WIDTH 1u
#    define MCM_ISCR_FOFC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FOFC_SHIFT)) & MCM_ISCR_FOFC_MASK)
#    define MCM_ISCR_FUFC_MASK 0x800u
#    define MCM_ISCR_FUFC_SHIFT 11u
#    define MCM_ISCR_FUFC_WIDTH 1u
#    define MCM_ISCR_FUFC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FUFC_SHIFT)) & MCM_ISCR_FUFC_MASK)
#    define MCM_ISCR_FIXC_MASK 0x1000u
#    define MCM_ISCR_FIXC_SHIFT 12u
#    define MCM_ISCR_FIXC_WIDTH 1u
#    define MCM_ISCR_FIXC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIXC_SHIFT)) & MCM_ISCR_FIXC_MASK)
#    define MCM_ISCR_FIDC_MASK 0x8000u
#    define MCM_ISCR_FIDC_SHIFT 15u
#    define MCM_ISCR_FIDC_WIDTH 1u
#    define MCM_ISCR_FIDC(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIDC_SHIFT)) & MCM_ISCR_FIDC_MASK)
#    define MCM_ISCR_FIOCE_MASK 0x1000000u
#    define MCM_ISCR_FIOCE_SHIFT 24u
#    define MCM_ISCR_FIOCE_WIDTH 1u
#    define MCM_ISCR_FIOCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIOCE_SHIFT)) & MCM_ISCR_FIOCE_MASK)
#    define MCM_ISCR_FDZCE_MASK 0x2000000u
#    define MCM_ISCR_FDZCE_SHIFT 25u
#    define MCM_ISCR_FDZCE_WIDTH 1u
#    define MCM_ISCR_FDZCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FDZCE_SHIFT)) & MCM_ISCR_FDZCE_MASK)
#    define MCM_ISCR_FOFCE_MASK 0x4000000u
#    define MCM_ISCR_FOFCE_SHIFT 26u
#    define MCM_ISCR_FOFCE_WIDTH 1u
#    define MCM_ISCR_FOFCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FOFCE_SHIFT)) & MCM_ISCR_FOFCE_MASK)
#    define MCM_ISCR_FUFCE_MASK 0x8000000u
#    define MCM_ISCR_FUFCE_SHIFT 27u
#    define MCM_ISCR_FUFCE_WIDTH 1u
#    define MCM_ISCR_FUFCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FUFCE_SHIFT)) & MCM_ISCR_FUFCE_MASK)
#    define MCM_ISCR_FIXCE_MASK 0x10000000u
#    define MCM_ISCR_FIXCE_SHIFT 28u
#    define MCM_ISCR_FIXCE_WIDTH 1u
#    define MCM_ISCR_FIXCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIXCE_SHIFT)) & MCM_ISCR_FIXCE_MASK)
#    define MCM_ISCR_FIDCE_MASK 0x80000000u
#    define MCM_ISCR_FIDCE_SHIFT 31u
#    define MCM_ISCR_FIDCE_WIDTH 1u
#    define MCM_ISCR_FIDCE(x) (((uint32_t)(((uint32_t)(x)) << MCM_ISCR_FIDCE_SHIFT)) & MCM_ISCR_FIDCE_MASK)
/* PID Bit Fields */
#    define MCM_PID_PID_MASK 0xFFu
#    define MCM_PID_PID_SHIFT 0u
#    define MCM_PID_PID_WIDTH 8u
#    define MCM_PID_PID(x) (((uint32_t)(((uint32_t)(x)) << MCM_PID_PID_SHIFT)) & MCM_PID_PID_MASK)
/* CPO Bit Fields */
#    define MCM_CPO_CPOREQ_MASK 0x1u
#    define MCM_CPO_CPOREQ_SHIFT 0u
#    define MCM_CPO_CPOREQ_WIDTH 1u
#    define MCM_CPO_CPOREQ(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPO_CPOREQ_SHIFT)) & MCM_CPO_CPOREQ_MASK)
#    define MCM_CPO_CPOACK_MASK 0x2u
#    define MCM_CPO_CPOACK_SHIFT 1u
#    define MCM_CPO_CPOACK_WIDTH 1u
#    define MCM_CPO_CPOACK(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPO_CPOACK_SHIFT)) & MCM_CPO_CPOACK_MASK)
#    define MCM_CPO_CPOWOI_MASK 0x4u
#    define MCM_CPO_CPOWOI_SHIFT 2u
#    define MCM_CPO_CPOWOI_WIDTH 1u
#    define MCM_CPO_CPOWOI(x) (((uint32_t)(((uint32_t)(x)) << MCM_CPO_CPOWOI_SHIFT)) & MCM_CPO_CPOWOI_MASK)
/* LMDR Bit Fields */
#    define MCM_LMDR_CF0_MASK 0xFu
#    define MCM_LMDR_CF0_SHIFT 0u
#    define MCM_LMDR_CF0_WIDTH 4u
#    define MCM_LMDR_CF0(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_CF0_SHIFT)) & MCM_LMDR_CF0_MASK)
#    define MCM_LMDR_CF1_MASK 0xF0u
#    define MCM_LMDR_CF1_SHIFT 4u
#    define MCM_LMDR_CF1_WIDTH 4u
#    define MCM_LMDR_CF1(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_CF1_SHIFT)) & MCM_LMDR_CF1_MASK)
#    define MCM_LMDR_MT_MASK 0xE000u
#    define MCM_LMDR_MT_SHIFT 13u
#    define MCM_LMDR_MT_WIDTH 3u
#    define MCM_LMDR_MT(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_MT_SHIFT)) & MCM_LMDR_MT_MASK)
#    define MCM_LMDR_LOCK_MASK 0x10000u
#    define MCM_LMDR_LOCK_SHIFT 16u
#    define MCM_LMDR_LOCK_WIDTH 1u
#    define MCM_LMDR_LOCK(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_LOCK_SHIFT)) & MCM_LMDR_LOCK_MASK)
#    define MCM_LMDR_DPW_MASK 0xE0000u
#    define MCM_LMDR_DPW_SHIFT 17u
#    define MCM_LMDR_DPW_WIDTH 3u
#    define MCM_LMDR_DPW(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_DPW_SHIFT)) & MCM_LMDR_DPW_MASK)
#    define MCM_LMDR_WY_MASK 0xF00000u
#    define MCM_LMDR_WY_SHIFT 20u
#    define MCM_LMDR_WY_WIDTH 4u
#    define MCM_LMDR_WY(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_WY_SHIFT)) & MCM_LMDR_WY_MASK)
#    define MCM_LMDR_LMSZ_MASK 0xF000000u
#    define MCM_LMDR_LMSZ_SHIFT 24u
#    define MCM_LMDR_LMSZ_WIDTH 4u
#    define MCM_LMDR_LMSZ(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_LMSZ_SHIFT)) & MCM_LMDR_LMSZ_MASK)
#    define MCM_LMDR_LMSZH_MASK 0x10000000u
#    define MCM_LMDR_LMSZH_SHIFT 28u
#    define MCM_LMDR_LMSZH_WIDTH 1u
#    define MCM_LMDR_LMSZH(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_LMSZH_SHIFT)) & MCM_LMDR_LMSZH_MASK)
#    define MCM_LMDR_V_MASK 0x80000000u
#    define MCM_LMDR_V_SHIFT 31u
#    define MCM_LMDR_V_WIDTH 1u
#    define MCM_LMDR_V(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR_V_SHIFT)) & MCM_LMDR_V_MASK)
/* LMDR2 Bit Fields */
#    define MCM_LMDR2_CF1_MASK 0xF0u
#    define MCM_LMDR2_CF1_SHIFT 4u
#    define MCM_LMDR2_CF1_WIDTH 4u
#    define MCM_LMDR2_CF1(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_CF1_SHIFT)) & MCM_LMDR2_CF1_MASK)
#    define MCM_LMDR2_MT_MASK 0xE000u
#    define MCM_LMDR2_MT_SHIFT 13u
#    define MCM_LMDR2_MT_WIDTH 3u
#    define MCM_LMDR2_MT(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_MT_SHIFT)) & MCM_LMDR2_MT_MASK)
#    define MCM_LMDR2_LOCK_MASK 0x10000u
#    define MCM_LMDR2_LOCK_SHIFT 16u
#    define MCM_LMDR2_LOCK_WIDTH 1u
#    define MCM_LMDR2_LOCK(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_LOCK_SHIFT)) & MCM_LMDR2_LOCK_MASK)
#    define MCM_LMDR2_DPW_MASK 0xE0000u
#    define MCM_LMDR2_DPW_SHIFT 17u
#    define MCM_LMDR2_DPW_WIDTH 3u
#    define MCM_LMDR2_DPW(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_DPW_SHIFT)) & MCM_LMDR2_DPW_MASK)
#    define MCM_LMDR2_WY_MASK 0xF00000u
#    define MCM_LMDR2_WY_SHIFT 20u
#    define MCM_LMDR2_WY_WIDTH 4u
#    define MCM_LMDR2_WY(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_WY_SHIFT)) & MCM_LMDR2_WY_MASK)
#    define MCM_LMDR2_LMSZ_MASK 0xF000000u
#    define MCM_LMDR2_LMSZ_SHIFT 24u
#    define MCM_LMDR2_LMSZ_WIDTH 4u
#    define MCM_LMDR2_LMSZ(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_LMSZ_SHIFT)) & MCM_LMDR2_LMSZ_MASK)
#    define MCM_LMDR2_LMSZH_MASK 0x10000000u
#    define MCM_LMDR2_LMSZH_SHIFT 28u
#    define MCM_LMDR2_LMSZH_WIDTH 1u
#    define MCM_LMDR2_LMSZH(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_LMSZH_SHIFT)) & MCM_LMDR2_LMSZH_MASK)
#    define MCM_LMDR2_V_MASK 0x80000000u
#    define MCM_LMDR2_V_SHIFT 31u
#    define MCM_LMDR2_V_WIDTH 1u
#    define MCM_LMDR2_V(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMDR2_V_SHIFT)) & MCM_LMDR2_V_MASK)
/* LMPECR Bit Fields */
#    define MCM_LMPECR_ERNCR_MASK 0x1u
#    define MCM_LMPECR_ERNCR_SHIFT 0u
#    define MCM_LMPECR_ERNCR_WIDTH 1u
#    define MCM_LMPECR_ERNCR(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPECR_ERNCR_SHIFT)) & MCM_LMPECR_ERNCR_MASK)
#    define MCM_LMPECR_ER1BR_MASK 0x100u
#    define MCM_LMPECR_ER1BR_SHIFT 8u
#    define MCM_LMPECR_ER1BR_WIDTH 1u
#    define MCM_LMPECR_ER1BR(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPECR_ER1BR_SHIFT)) & MCM_LMPECR_ER1BR_MASK)
#    define MCM_LMPECR_ECPR_MASK 0x100000u
#    define MCM_LMPECR_ECPR_SHIFT 20u
#    define MCM_LMPECR_ECPR_WIDTH 1u
#    define MCM_LMPECR_ECPR(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPECR_ECPR_SHIFT)) & MCM_LMPECR_ECPR_MASK)
/* LMPEIR Bit Fields */
#    define MCM_LMPEIR_ENC_MASK 0xFFu
#    define MCM_LMPEIR_ENC_SHIFT 0u
#    define MCM_LMPEIR_ENC_WIDTH 8u
#    define MCM_LMPEIR_ENC(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPEIR_ENC_SHIFT)) & MCM_LMPEIR_ENC_MASK)
#    define MCM_LMPEIR_E1B_MASK 0xFF00u
#    define MCM_LMPEIR_E1B_SHIFT 8u
#    define MCM_LMPEIR_E1B_WIDTH 8u
#    define MCM_LMPEIR_E1B(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPEIR_E1B_SHIFT)) & MCM_LMPEIR_E1B_MASK)
#    define MCM_LMPEIR_PE_MASK 0xFF0000u
#    define MCM_LMPEIR_PE_SHIFT 16u
#    define MCM_LMPEIR_PE_WIDTH 8u
#    define MCM_LMPEIR_PE(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPEIR_PE_SHIFT)) & MCM_LMPEIR_PE_MASK)
#    define MCM_LMPEIR_PEELOC_MASK 0x1F000000u
#    define MCM_LMPEIR_PEELOC_SHIFT 24u
#    define MCM_LMPEIR_PEELOC_WIDTH 5u
#    define MCM_LMPEIR_PEELOC(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPEIR_PEELOC_SHIFT)) & MCM_LMPEIR_PEELOC_MASK)
#    define MCM_LMPEIR_V_MASK 0x80000000u
#    define MCM_LMPEIR_V_SHIFT 31u
#    define MCM_LMPEIR_V_WIDTH 1u
#    define MCM_LMPEIR_V(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMPEIR_V_SHIFT)) & MCM_LMPEIR_V_MASK)
/* LMFAR Bit Fields */
#    define MCM_LMFAR_EFADD_MASK 0xFFFFFFFFu
#    define MCM_LMFAR_EFADD_SHIFT 0u
#    define MCM_LMFAR_EFADD_WIDTH 32u
#    define MCM_LMFAR_EFADD(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFAR_EFADD_SHIFT)) & MCM_LMFAR_EFADD_MASK)
/* LMFATR Bit Fields */
#    define MCM_LMFATR_PEFPRT_MASK 0xFu
#    define MCM_LMFATR_PEFPRT_SHIFT 0u
#    define MCM_LMFATR_PEFPRT_WIDTH 4u
#    define MCM_LMFATR_PEFPRT(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFATR_PEFPRT_SHIFT)) & MCM_LMFATR_PEFPRT_MASK)
#    define MCM_LMFATR_PEFSIZE_MASK 0x70u
#    define MCM_LMFATR_PEFSIZE_SHIFT 4u
#    define MCM_LMFATR_PEFSIZE_WIDTH 3u
#    define MCM_LMFATR_PEFSIZE(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFATR_PEFSIZE_SHIFT)) & MCM_LMFATR_PEFSIZE_MASK)
#    define MCM_LMFATR_PEFW_MASK 0x80u
#    define MCM_LMFATR_PEFW_SHIFT 7u
#    define MCM_LMFATR_PEFW_WIDTH 1u
#    define MCM_LMFATR_PEFW(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFATR_PEFW_SHIFT)) & MCM_LMFATR_PEFW_MASK)
#    define MCM_LMFATR_PEFMST_MASK 0xFF00u
#    define MCM_LMFATR_PEFMST_SHIFT 8u
#    define MCM_LMFATR_PEFMST_WIDTH 8u
#    define MCM_LMFATR_PEFMST(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFATR_PEFMST_SHIFT)) & MCM_LMFATR_PEFMST_MASK)
#    define MCM_LMFATR_OVR_MASK 0x80000000u
#    define MCM_LMFATR_OVR_SHIFT 31u
#    define MCM_LMFATR_OVR_WIDTH 1u
#    define MCM_LMFATR_OVR(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFATR_OVR_SHIFT)) & MCM_LMFATR_OVR_MASK)
/* LMFDHR Bit Fields */
#    define MCM_LMFDHR_PEFDH_MASK 0xFFFFFFFFu
#    define MCM_LMFDHR_PEFDH_SHIFT 0u
#    define MCM_LMFDHR_PEFDH_WIDTH 32u
#    define MCM_LMFDHR_PEFDH(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFDHR_PEFDH_SHIFT)) & MCM_LMFDHR_PEFDH_MASK)
/* LMFDLR Bit Fields */
#    define MCM_LMFDLR_PEFDL_MASK 0xFFFFFFFFu
#    define MCM_LMFDLR_PEFDL_SHIFT 0u
#    define MCM_LMFDLR_PEFDL_WIDTH 32u
#    define MCM_LMFDLR_PEFDL(x) (((uint32_t)(((uint32_t)(x)) << MCM_LMFDLR_PEFDL_SHIFT)) & MCM_LMFDLR_PEFDL_MASK)

/*!
 * @}
 */ /* end of group MCM_Register_Masks */

/*!
 * @}
 */ /* end of group MCM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- MPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Peripheral_Access_Layer MPU Peripheral Access Layer
 * @{
 */

/** MPU - Size of Registers Arrays */
#    define MPU_EAR_EDR_COUNT 5u
#    define MPU_RGD_COUNT 16u
#    define MPU_RGDAAC_COUNT 16u

/** MPU - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CESR; /**< Control/Error Status Register, offset: 0x0 */
    uint8_t       RESERVED_0[12];
    struct
    {                     /* offset: 0x10, array step: 0x8 */
        __I uint32_t EAR; /**< Error Address Register, slave port
                             0..Error Address Register, slave port
                             4, array offset: 0x10, array step: 0x8 */
        __I uint32_t EDR; /**< Error Detail Register, slave port
                             0..Error Detail Register, slave port
                             4, array offset: 0x14, array step: 0x8 */
    } EAR_EDR[MPU_EAR_EDR_COUNT];
    uint8_t RESERVED_1[968];
    struct
    {                        /* offset: 0x400, array step: 0x10 */
        __IO uint32_t WORD0; /**< Region Descriptor 0, Word 0..Region Descriptor 15, Word 0, array offset: 0x400, array
                                step: 0x10 */
        __IO uint32_t WORD1; /**< Region Descriptor 0, Word 1..Region Descriptor 15, Word 1, array offset: 0x404, array
                                step: 0x10 */
        __IO uint32_t WORD2; /**< Region Descriptor 0, Word 2..Region Descriptor 15, Word 2, array offset: 0x408, array
                                step: 0x10 */
        __IO uint32_t WORD3; /**< Region Descriptor 0, Word 3..Region Descriptor 15, Word 3, array offset: 0x40C, array
                                step: 0x10 */
    } RGD[MPU_RGD_COUNT];
    uint8_t RESERVED_2[768];
    __IO uint32_t RGDAAC[MPU_RGDAAC_COUNT]; /**< Region Descriptor Alternate Access Control
                                                 0..Region Descriptor Alternate Access Control
                                                 15, array offset: 0x800, array step: 0x4 */
} MPU_Type, *MPU_MemMapPtr;

