OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** Number of instances of the MPU module. */
#    define MPU_INSTANCE_COUNT (1u)

/* MPU - Peripheral instance base addresses */
/** Peripheral MPU base address */
#    define MPU_BASE (0x4000D000u)
/** Peripheral MPU base pointer */
#    define MPU ((MPU_Type*) MPU_BASE)
/** Array initializer of MPU peripheral base addresses */
#    define MPU_BASE_ADDRS \
        {                  \
            MPU_BASE       \
        }
/** Array initializer of MPU peripheral base pointers */
#    define MPU_BASE_PTRS \
        {                 \
            MPU           \
        }

/* ----------------------------------------------------------------------------
   -- MPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Register_Masks MPU Register Masks
 * @{
 */

/* CESR Bit Fields */
#    define MPU_CESR_VLD_MASK 0x1u
#    define MPU_CESR_VLD_SHIFT 0u
#    define MPU_CESR_VLD_WIDTH 1u
#    define MPU_CESR_VLD(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_VLD_SHIFT)) & MPU_CESR_VLD_MASK)
#    define MPU_CESR_NRGD_MASK 0xF00u
#    define MPU_CESR_NRGD_SHIFT 8u
#    define MPU_CESR_NRGD_WIDTH 4u
#    define MPU_CESR_NRGD(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_NRGD_SHIFT)) & MPU_CESR_NRGD_MASK)
#    define MPU_CESR_NSP_MASK 0xF000u
#    define MPU_CESR_NSP_SHIFT 12u
#    define MPU_CESR_NSP_WIDTH 4u
#    define MPU_CESR_NSP(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_NSP_SHIFT)) & MPU_CESR_NSP_MASK)
#    define MPU_CESR_HRL_MASK 0xF0000u
#    define MPU_CESR_HRL_SHIFT 16u
#    define MPU_CESR_HRL_WIDTH 4u
#    define MPU_CESR_HRL(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_HRL_SHIFT)) & MPU_CESR_HRL_MASK)
#    define MPU_CESR_SPERR4_MASK 0x8000000u
#    define MPU_CESR_SPERR4_SHIFT 27u
#    define MPU_CESR_SPERR4_WIDTH 1u
#    define MPU_CESR_SPERR4(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_SPERR4_SHIFT)) & MPU_CESR_SPERR4_MASK)
#    define MPU_CESR_SPERR3_MASK 0x10000000u
#    define MPU_CESR_SPERR3_SHIFT 28u
#    define MPU_CESR_SPERR3_WIDTH 1u
#    define MPU_CESR_SPERR3(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_SPERR3_SHIFT)) & MPU_CESR_SPERR3_MASK)
#    define MPU_CESR_SPERR2_MASK 0x20000000u
#    define MPU_CESR_SPERR2_SHIFT 29u
#    define MPU_CESR_SPERR2_WIDTH 1u
#    define MPU_CESR_SPERR2(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_SPERR2_SHIFT)) & MPU_CESR_SPERR2_MASK)
#    define MPU_CESR_SPERR1_MASK 0x40000000u
#    define MPU_CESR_SPERR1_SHIFT 30u
#    define MPU_CESR_SPERR1_WIDTH 1u
#    define MPU_CESR_SPERR1(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_SPERR1_SHIFT)) & MPU_CESR_SPERR1_MASK)
#    define MPU_CESR_SPERR0_MASK 0x80000000u
#    define MPU_CESR_SPERR0_SHIFT 31u
#    define MPU_CESR_SPERR0_WIDTH 1u
#    define MPU_CESR_SPERR0(x) (((uint32_t)(((uint32_t)(x)) << MPU_CESR_SPERR0_SHIFT)) & MPU_CESR_SPERR0_MASK)
/* EAR Bit Fields */
#    define MPU_EAR_EADDR_MASK 0xFFFFFFFFu
#    define MPU_EAR_EADDR_SHIFT 0u
#    define MPU_EAR_EADDR_WIDTH 32u
#    define MPU_EAR_EADDR(x) (((uint32_t)(((uint32_t)(x)) << MPU_EAR_EADDR_SHIFT)) & MPU_EAR_EADDR_MASK)
/* EDR Bit Fields */
#    define MPU_EDR_ERW_MASK 0x1u
#    define MPU_EDR_ERW_SHIFT 0u
#    define MPU_EDR_ERW_WIDTH 1u
#    define MPU_EDR_ERW(x) (((uint32_t)(((uint32_t)(x)) << MPU_EDR_ERW_SHIFT)) & MPU_EDR_ERW_MASK)
#    define MPU_EDR_EATTR_MASK 0xEu
#    define MPU_EDR_EATTR_SHIFT 1u
#    define MPU_EDR_EATTR_WIDTH 3u
#    define MPU_EDR_EATTR(x) (((uint32_t)(((uint32_t)(x)) << MPU_EDR_EATTR_SHIFT)) & MPU_EDR_EATTR_MASK)
#    define MPU_EDR_EMN_MASK 0xF0u
#    define MPU_EDR_EMN_SHIFT 4u
#    define MPU_EDR_EMN_WIDTH 4u
#    define MPU_EDR_EMN(x) (((uint32_t)(((uint32_t)(x)) << MPU_EDR_EMN_SHIFT)) & MPU_EDR_EMN_MASK)
#    define MPU_EDR_EPID_MASK 0xFF00u
#    define MPU_EDR_EPID_SHIFT 8u
#    define MPU_EDR_EPID_WIDTH 8u
#    define MPU_EDR_EPID(x) (((uint32_t)(((uint32_t)(x)) << MPU_EDR_EPID_SHIFT)) & MPU_EDR_EPID_MASK)
#    define MPU_EDR_EACD_MASK 0xFFFF0000u
#    define MPU_EDR_EACD_SHIFT 16u
#    define MPU_EDR_EACD_WIDTH 16u
#    define MPU_EDR_EACD(x) (((uint32_t)(((uint32_t)(x)) << MPU_EDR_EACD_SHIFT)) & MPU_EDR_EACD_MASK)
/* RGD_WORD0 Bit Fields */
#    define MPU_RGD_WORD0_SRTADDR_MASK 0xFFFFFFE0u
#    define MPU_RGD_WORD0_SRTADDR_SHIFT 5u
#    define MPU_RGD_WORD0_SRTADDR_WIDTH 27u
#    define MPU_RGD_WORD0_SRTADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD0_SRTADDR_SHIFT)) & MPU_RGD_WORD0_SRTADDR_MASK)
/* RGD_WORD1 Bit Fields */
#    define MPU_RGD_WORD1_ENDADDR_MASK 0xFFFFFFE0u
#    define MPU_RGD_WORD1_ENDADDR_SHIFT 5u
#    define MPU_RGD_WORD1_ENDADDR_WIDTH 27u
#    define MPU_RGD_WORD1_ENDADDR(x) \
        (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD1_ENDADDR_SHIFT)) & MPU_RGD_WORD1_ENDADDR_MASK)
/* RGD_WORD2 Bit Fields */
#    define MPU_RGD_WORD2_M0UM_MASK 0x7u
#    define MPU_RGD_WORD2_M0UM_SHIFT 0u
#    define MPU_RGD_WORD2_M0UM_WIDTH 3u
#    define MPU_RGD_WORD2_M0UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M0UM_SHIFT)) & MPU_RGD_WORD2_M0UM_MASK)
#    define MPU_RGD_WORD2_M0SM_MASK 0x18u
#    define MPU_RGD_WORD2_M0SM_SHIFT 3u
#    define MPU_RGD_WORD2_M0SM_WIDTH 2u
#    define MPU_RGD_WORD2_M0SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M0SM_SHIFT)) & MPU_RGD_WORD2_M0SM_MASK)
#    define MPU_RGD_WORD2_M0PE_MASK 0x20u
#    define MPU_RGD_WORD2_M0PE_SHIFT 5u
#    define MPU_RGD_WORD2_M0PE_WIDTH 1u
#    define MPU_RGD_WORD2_M0PE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M0PE_SHIFT)) & MPU_RGD_WORD2_M0PE_MASK)
#    define MPU_RGD_WORD2_M1UM_MASK 0x1C0u
#    define MPU_RGD_WORD2_M1UM_SHIFT 6u
#    define MPU_RGD_WORD2_M1UM_WIDTH 3u
#    define MPU_RGD_WORD2_M1UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M1UM_SHIFT)) & MPU_RGD_WORD2_M1UM_MASK)
#    define MPU_RGD_WORD2_M1SM_MASK 0x600u
#    define MPU_RGD_WORD2_M1SM_SHIFT 9u
#    define MPU_RGD_WORD2_M1SM_WIDTH 2u
#    define MPU_RGD_WORD2_M1SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M1SM_SHIFT)) & MPU_RGD_WORD2_M1SM_MASK)
#    define MPU_RGD_WORD2_M1PE_MASK 0x800u
#    define MPU_RGD_WORD2_M1PE_SHIFT 11u
#    define MPU_RGD_WORD2_M1PE_WIDTH 1u
#    define MPU_RGD_WORD2_M1PE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M1PE_SHIFT)) & MPU_RGD_WORD2_M1PE_MASK)
#    define MPU_RGD_WORD2_M2UM_MASK 0x7000u
#    define MPU_RGD_WORD2_M2UM_SHIFT 12u
#    define MPU_RGD_WORD2_M2UM_WIDTH 3u
#    define MPU_RGD_WORD2_M2UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M2UM_SHIFT)) & MPU_RGD_WORD2_M2UM_MASK)
#    define MPU_RGD_WORD2_M2SM_MASK 0x18000u
#    define MPU_RGD_WORD2_M2SM_SHIFT 15u
#    define MPU_RGD_WORD2_M2SM_WIDTH 2u
#    define MPU_RGD_WORD2_M2SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M2SM_SHIFT)) & MPU_RGD_WORD2_M2SM_MASK)
#    define MPU_RGD_WORD2_M3UM_MASK 0x1C0000u
#    define MPU_RGD_WORD2_M3UM_SHIFT 18u
#    define MPU_RGD_WORD2_M3UM_WIDTH 3u
#    define MPU_RGD_WORD2_M3UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M3UM_SHIFT)) & MPU_RGD_WORD2_M3UM_MASK)
#    define MPU_RGD_WORD2_M3SM_MASK 0x600000u
#    define MPU_RGD_WORD2_M3SM_SHIFT 21u
#    define MPU_RGD_WORD2_M3SM_WIDTH 2u
#    define MPU_RGD_WORD2_M3SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M3SM_SHIFT)) & MPU_RGD_WORD2_M3SM_MASK)
#    define MPU_RGD_WORD2_M4WE_MASK 0x1000000u
#    define MPU_RGD_WORD2_M4WE_SHIFT 24u
#    define MPU_RGD_WORD2_M4WE_WIDTH 1u
#    define MPU_RGD_WORD2_M4WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M4WE_SHIFT)) & MPU_RGD_WORD2_M4WE_MASK)
#    define MPU_RGD_WORD2_M4RE_MASK 0x2000000u
#    define MPU_RGD_WORD2_M4RE_SHIFT 25u
#    define MPU_RGD_WORD2_M4RE_WIDTH 1u
#    define MPU_RGD_WORD2_M4RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M4RE_SHIFT)) & MPU_RGD_WORD2_M4RE_MASK)
#    define MPU_RGD_WORD2_M5WE_MASK 0x4000000u
#    define MPU_RGD_WORD2_M5WE_SHIFT 26u
#    define MPU_RGD_WORD2_M5WE_WIDTH 1u
#    define MPU_RGD_WORD2_M5WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M5WE_SHIFT)) & MPU_RGD_WORD2_M5WE_MASK)
#    define MPU_RGD_WORD2_M5RE_MASK 0x8000000u
#    define MPU_RGD_WORD2_M5RE_SHIFT 27u
#    define MPU_RGD_WORD2_M5RE_WIDTH 1u
#    define MPU_RGD_WORD2_M5RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M5RE_SHIFT)) & MPU_RGD_WORD2_M5RE_MASK)
#    define MPU_RGD_WORD2_M6WE_MASK 0x10000000u
#    define MPU_RGD_WORD2_M6WE_SHIFT 28u
#    define MPU_RGD_WORD2_M6WE_WIDTH 1u
#    define MPU_RGD_WORD2_M6WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M6WE_SHIFT)) & MPU_RGD_WORD2_M6WE_MASK)
#    define MPU_RGD_WORD2_M6RE_MASK 0x20000000u
#    define MPU_RGD_WORD2_M6RE_SHIFT 29u
#    define MPU_RGD_WORD2_M6RE_WIDTH 1u
#    define MPU_RGD_WORD2_M6RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M6RE_SHIFT)) & MPU_RGD_WORD2_M6RE_MASK)
#    define MPU_RGD_WORD2_M7WE_MASK 0x40000000u
#    define MPU_RGD_WORD2_M7WE_SHIFT 30u
#    define MPU_RGD_WORD2_M7WE_WIDTH 1u
#    define MPU_RGD_WORD2_M7WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M7WE_SHIFT)) & MPU_RGD_WORD2_M7WE_MASK)
#    define MPU_RGD_WORD2_M7RE_MASK 0x80000000u
#    define MPU_RGD_WORD2_M7RE_SHIFT 31u
#    define MPU_RGD_WORD2_M7RE_WIDTH 1u
#    define MPU_RGD_WORD2_M7RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD2_M7RE_SHIFT)) & MPU_RGD_WORD2_M7RE_MASK)
/* RGD_WORD3 Bit Fields */
#    define MPU_RGD_WORD3_VLD_MASK 0x1u
#    define MPU_RGD_WORD3_VLD_SHIFT 0u
#    define MPU_RGD_WORD3_VLD_WIDTH 1u
#    define MPU_RGD_WORD3_VLD(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD3_VLD_SHIFT)) & MPU_RGD_WORD3_VLD_MASK)
#    define MPU_RGD_WORD3_PIDMASK_MASK 0xFF0000u
#    define MPU_RGD_WORD3_PIDMASK_SHIFT 16u
#    define MPU_RGD_WORD3_PIDMASK_WIDTH 8u
#    define MPU_RGD_WORD3_PIDMASK(x) \
        (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD3_PIDMASK_SHIFT)) & MPU_RGD_WORD3_PIDMASK_MASK)
#    define MPU_RGD_WORD3_PID_MASK 0xFF000000u
#    define MPU_RGD_WORD3_PID_SHIFT 24u
#    define MPU_RGD_WORD3_PID_WIDTH 8u
#    define MPU_RGD_WORD3_PID(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGD_WORD3_PID_SHIFT)) & MPU_RGD_WORD3_PID_MASK)
/* RGDAAC Bit Fields */
#    define MPU_RGDAAC_M0UM_MASK 0x7u
#    define MPU_RGDAAC_M0UM_SHIFT 0u
#    define MPU_RGDAAC_M0UM_WIDTH 3u
#    define MPU_RGDAAC_M0UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M0UM_SHIFT)) & MPU_RGDAAC_M0UM_MASK)
#    define MPU_RGDAAC_M0SM_MASK 0x18u
#    define MPU_RGDAAC_M0SM_SHIFT 3u
#    define MPU_RGDAAC_M0SM_WIDTH 2u
#    define MPU_RGDAAC_M0SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M0SM_SHIFT)) & MPU_RGDAAC_M0SM_MASK)
#    define MPU_RGDAAC_M0PE_MASK 0x20u
#    define MPU_RGDAAC_M0PE_SHIFT 5u
#    define MPU_RGDAAC_M0PE_WIDTH 1u
#    define MPU_RGDAAC_M0PE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M0PE_SHIFT)) & MPU_RGDAAC_M0PE_MASK)
#    define MPU_RGDAAC_M1UM_MASK 0x1C0u
#    define MPU_RGDAAC_M1UM_SHIFT 6u
#    define MPU_RGDAAC_M1UM_WIDTH 3u
#    define MPU_RGDAAC_M1UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M1UM_SHIFT)) & MPU_RGDAAC_M1UM_MASK)
#    define MPU_RGDAAC_M1SM_MASK 0x600u
#    define MPU_RGDAAC_M1SM_SHIFT 9u
#    define MPU_RGDAAC_M1SM_WIDTH 2u
#    define MPU_RGDAAC_M1SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M1SM_SHIFT)) & MPU_RGDAAC_M1SM_MASK)
#    define MPU_RGDAAC_M1PE_MASK 0x800u
#    define MPU_RGDAAC_M1PE_SHIFT 11u
#    define MPU_RGDAAC_M1PE_WIDTH 1u
#    define MPU_RGDAAC_M1PE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M1PE_SHIFT)) & MPU_RGDAAC_M1PE_MASK)
#    define MPU_RGDAAC_M2UM_MASK 0x7000u
#    define MPU_RGDAAC_M2UM_SHIFT 12u
#    define MPU_RGDAAC_M2UM_WIDTH 3u
#    define MPU_RGDAAC_M2UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M2UM_SHIFT)) & MPU_RGDAAC_M2UM_MASK)
#    define MPU_RGDAAC_M2SM_MASK 0x18000u
#    define MPU_RGDAAC_M2SM_SHIFT 15u
#    define MPU_RGDAAC_M2SM_WIDTH 2u
#    define MPU_RGDAAC_M2SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M2SM_SHIFT)) & MPU_RGDAAC_M2SM_MASK)
#    define MPU_RGDAAC_M3UM_MASK 0x1C0000u
#    define MPU_RGDAAC_M3UM_SHIFT 18u
#    define MPU_RGDAAC_M3UM_WIDTH 3u
#    define MPU_RGDAAC_M3UM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M3UM_SHIFT)) & MPU_RGDAAC_M3UM_MASK)
#    define MPU_RGDAAC_M3SM_MASK 0x600000u
#    define MPU_RGDAAC_M3SM_SHIFT 21u
#    define MPU_RGDAAC_M3SM_WIDTH 2u
#    define MPU_RGDAAC_M3SM(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M3SM_SHIFT)) & MPU_RGDAAC_M3SM_MASK)
#    define MPU_RGDAAC_M4WE_MASK 0x1000000u
#    define MPU_RGDAAC_M4WE_SHIFT 24u
#    define MPU_RGDAAC_M4WE_WIDTH 1u
#    define MPU_RGDAAC_M4WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M4WE_SHIFT)) & MPU_RGDAAC_M4WE_MASK)
#    define MPU_RGDAAC_M4RE_MASK 0x2000000u
#    define MPU_RGDAAC_M4RE_SHIFT 25u
#    define MPU_RGDAAC_M4RE_WIDTH 1u
#    define MPU_RGDAAC_M4RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M4RE_SHIFT)) & MPU_RGDAAC_M4RE_MASK)
#    define MPU_RGDAAC_M5WE_MASK 0x4000000u
#    define MPU_RGDAAC_M5WE_SHIFT 26u
#    define MPU_RGDAAC_M5WE_WIDTH 1u
#    define MPU_RGDAAC_M5WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M5WE_SHIFT)) & MPU_RGDAAC_M5WE_MASK)
#    define MPU_RGDAAC_M5RE_MASK 0x8000000u
#    define MPU_RGDAAC_M5RE_SHIFT 27u
#    define MPU_RGDAAC_M5RE_WIDTH 1u
#    define MPU_RGDAAC_M5RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M5RE_SHIFT)) & MPU_RGDAAC_M5RE_MASK)
#    define MPU_RGDAAC_M6WE_MASK 0x10000000u
#    define MPU_RGDAAC_M6WE_SHIFT 28u
#    define MPU_RGDAAC_M6WE_WIDTH 1u
#    define MPU_RGDAAC_M6WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M6WE_SHIFT)) & MPU_RGDAAC_M6WE_MASK)
#    define MPU_RGDAAC_M6RE_MASK 0x20000000u
#    define MPU_RGDAAC_M6RE_SHIFT 29u
#    define MPU_RGDAAC_M6RE_WIDTH 1u
#    define MPU_RGDAAC_M6RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M6RE_SHIFT)) & MPU_RGDAAC_M6RE_MASK)
#    define MPU_RGDAAC_M7WE_MASK 0x40000000u
#    define MPU_RGDAAC_M7WE_SHIFT 30u
#    define MPU_RGDAAC_M7WE_WIDTH 1u
#    define MPU_RGDAAC_M7WE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M7WE_SHIFT)) & MPU_RGDAAC_M7WE_MASK)
#    define MPU_RGDAAC_M7RE_MASK 0x80000000u
#    define MPU_RGDAAC_M7RE_SHIFT 31u
#    define MPU_RGDAAC_M7RE_WIDTH 1u
#    define MPU_RGDAAC_M7RE(x) (((uint32_t)(((uint32_t)(x)) << MPU_RGDAAC_M7RE_SHIFT)) & MPU_RGDAAC_M7RE_MASK)

/*!
 * @}
 */ /* end of group MPU_Register_Masks */

/*!
 * @}
 */ /* end of group MPU_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- MSCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Peripheral_Access_Layer MSCM Peripheral Access Layer
 * @{
 */

/** MSCM - Size of Registers Arrays */
#    define MSCM_OCMDR_COUNT 4u

/** MSCM - Register Layout Typedef */
typedef struct
{
    __I uint32_t CPxTYPE;   /**< Processor X Type Register, offset: 0x0 */
    __I uint32_t CPxNUM;    /**< Processor X Number Register, offset: 0x4 */
    __I uint32_t CPxMASTER; /**< Processor X Master Register, offset: 0x8 */
    __I uint32_t CPxCOUNT;  /**< Processor X Count Register, offset: 0xC */
    __I uint32_t CPxCFG0;   /**< Processor X Configuration Register 0, offset: 0x10 */
    __I uint32_t CPxCFG1;   /**< Processor X Configuration Register 1, offset: 0x14 */
    __I uint32_t CPxCFG2;   /**< Processor X Configuration Register 2, offset: 0x18 */
    __I uint32_t CPxCFG3;   /**< Processor X Configuration Register 3, offset: 0x1C */
    __I uint32_t CP0TYPE;   /**< Processor 0 Type Register, offset: 0x20 */
    __I uint32_t CP0NUM;    /**< Processor 0 Number Register, offset: 0x24 */
    __I uint32_t CP0MASTER; /**< Processor 0 Master Register, offset: 0x28 */
    __I uint32_t CP0COUNT;  /**< Processor 0 Count Register, offset: 0x2C */
    __I uint32_t CP0CFG0;   /**< Processor 0 Configuration Register 0, offset: 0x30 */
    __I uint32_t CP0CFG1;   /**< Processor 0 Configuration Register 1, offset: 0x34 */
    __I uint32_t CP0CFG2;   /**< Processor 0 Configuration Register 2, offset: 0x38 */
    __I uint32_t CP0CFG3;   /**< Processor 0 Configuration Register 3, offset: 0x3C */
    uint8_t      RESERVED_0[960];
    __IO         uint32_t
                 OCMDR[MSCM_OCMDR_COUNT]; /**< On-Chip Memory Descriptor Register, array offset: 0x400, array step: 0x4 */
} MSCM_Type, *MSCM_MemMapPtr;

/** Number of instances of the MSCM module. */
#    define MSCM_INSTANCE_COUNT (1u)

/* MSCM - Peripheral instance base addresses */
/** Peripheral MSCM base address */
#    define MSCM_BASE (0x40001000u)
/** Peripheral MSCM base pointer */
#    define MSCM ((MSCM_Type*) MSCM_BASE)
/** Array initializer of MSCM peripheral base addresses */
#    define MSCM_BASE_ADDRS \
        {                   \
            MSCM_BASE       \
        }
/** Array initializer of MSCM peripheral base pointers */
#    define MSCM_BASE_PTRS \
        {                  \
            MSCM           \
        }

/* ----------------------------------------------------------------------------
   -- MSCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCM_Register_Masks MSCM Register Masks
 * @{
 */

