OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* CPxTYPE Bit Fields */
#    define MSCM_CPxTYPE_RYPZ_MASK 0xFFu
#    define MSCM_CPxTYPE_RYPZ_SHIFT 0u
#    define MSCM_CPxTYPE_RYPZ_WIDTH 8u
#    define MSCM_CPxTYPE_RYPZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxTYPE_RYPZ_SHIFT)) & MSCM_CPxTYPE_RYPZ_MASK)
#    define MSCM_CPxTYPE_PERSONALITY_MASK 0xFFFFFF00u
#    define MSCM_CPxTYPE_PERSONALITY_SHIFT 8u
#    define MSCM_CPxTYPE_PERSONALITY_WIDTH 24u
#    define MSCM_CPxTYPE_PERSONALITY(x) \
        (((uint32_t)(((uint32_t)(x)) << MSCM_CPxTYPE_PERSONALITY_SHIFT)) & MSCM_CPxTYPE_PERSONALITY_MASK)
/* CPxNUM Bit Fields */
#    define MSCM_CPxNUM_CPN_MASK 0x1u
#    define MSCM_CPxNUM_CPN_SHIFT 0u
#    define MSCM_CPxNUM_CPN_WIDTH 1u
#    define MSCM_CPxNUM_CPN(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxNUM_CPN_SHIFT)) & MSCM_CPxNUM_CPN_MASK)
/* CPxMASTER Bit Fields */
#    define MSCM_CPxMASTER_PPMN_MASK 0x3Fu
#    define MSCM_CPxMASTER_PPMN_SHIFT 0u
#    define MSCM_CPxMASTER_PPMN_WIDTH 6u
#    define MSCM_CPxMASTER_PPMN(x) \
        (((uint32_t)(((uint32_t)(x)) << MSCM_CPxMASTER_PPMN_SHIFT)) & MSCM_CPxMASTER_PPMN_MASK)
/* CPxCOUNT Bit Fields */
#    define MSCM_CPxCOUNT_PCNT_MASK 0x3u
#    define MSCM_CPxCOUNT_PCNT_SHIFT 0u
#    define MSCM_CPxCOUNT_PCNT_WIDTH 2u
#    define MSCM_CPxCOUNT_PCNT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCOUNT_PCNT_SHIFT)) & MSCM_CPxCOUNT_PCNT_MASK)
/* CPxCFG0 Bit Fields */
#    define MSCM_CPxCFG0_DCWY_MASK 0xFFu
#    define MSCM_CPxCFG0_DCWY_SHIFT 0u
#    define MSCM_CPxCFG0_DCWY_WIDTH 8u
#    define MSCM_CPxCFG0_DCWY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_DCWY_SHIFT)) & MSCM_CPxCFG0_DCWY_MASK)
#    define MSCM_CPxCFG0_DCSZ_MASK 0xFF00u
#    define MSCM_CPxCFG0_DCSZ_SHIFT 8u
#    define MSCM_CPxCFG0_DCSZ_WIDTH 8u
#    define MSCM_CPxCFG0_DCSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_DCSZ_SHIFT)) & MSCM_CPxCFG0_DCSZ_MASK)
#    define MSCM_CPxCFG0_ICWY_MASK 0xFF0000u
#    define MSCM_CPxCFG0_ICWY_SHIFT 16u
#    define MSCM_CPxCFG0_ICWY_WIDTH 8u
#    define MSCM_CPxCFG0_ICWY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_ICWY_SHIFT)) & MSCM_CPxCFG0_ICWY_MASK)
#    define MSCM_CPxCFG0_ICSZ_MASK 0xFF000000u
#    define MSCM_CPxCFG0_ICSZ_SHIFT 24u
#    define MSCM_CPxCFG0_ICSZ_WIDTH 8u
#    define MSCM_CPxCFG0_ICSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG0_ICSZ_SHIFT)) & MSCM_CPxCFG0_ICSZ_MASK)
/* CPxCFG1 Bit Fields */
#    define MSCM_CPxCFG1_L2WY_MASK 0xFF0000u
#    define MSCM_CPxCFG1_L2WY_SHIFT 16u
#    define MSCM_CPxCFG1_L2WY_WIDTH 8u
#    define MSCM_CPxCFG1_L2WY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG1_L2WY_SHIFT)) & MSCM_CPxCFG1_L2WY_MASK)
#    define MSCM_CPxCFG1_L2SZ_MASK 0xFF000000u
#    define MSCM_CPxCFG1_L2SZ_SHIFT 24u
#    define MSCM_CPxCFG1_L2SZ_WIDTH 8u
#    define MSCM_CPxCFG1_L2SZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG1_L2SZ_SHIFT)) & MSCM_CPxCFG1_L2SZ_MASK)
/* CPxCFG2 Bit Fields */
#    define MSCM_CPxCFG2_TMUSZ_MASK 0xFF00u
#    define MSCM_CPxCFG2_TMUSZ_SHIFT 8u
#    define MSCM_CPxCFG2_TMUSZ_WIDTH 8u
#    define MSCM_CPxCFG2_TMUSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG2_TMUSZ_SHIFT)) & MSCM_CPxCFG2_TMUSZ_MASK)
#    define MSCM_CPxCFG2_TMLSZ_MASK 0xFF000000u
#    define MSCM_CPxCFG2_TMLSZ_SHIFT 24u
#    define MSCM_CPxCFG2_TMLSZ_WIDTH 8u
#    define MSCM_CPxCFG2_TMLSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG2_TMLSZ_SHIFT)) & MSCM_CPxCFG2_TMLSZ_MASK)
/* CPxCFG3 Bit Fields */
#    define MSCM_CPxCFG3_FPU_MASK 0x1u
#    define MSCM_CPxCFG3_FPU_SHIFT 0u
#    define MSCM_CPxCFG3_FPU_WIDTH 1u
#    define MSCM_CPxCFG3_FPU(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_FPU_SHIFT)) & MSCM_CPxCFG3_FPU_MASK)
#    define MSCM_CPxCFG3_SIMD_MASK 0x2u
#    define MSCM_CPxCFG3_SIMD_SHIFT 1u
#    define MSCM_CPxCFG3_SIMD_WIDTH 1u
#    define MSCM_CPxCFG3_SIMD(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_SIMD_SHIFT)) & MSCM_CPxCFG3_SIMD_MASK)
#    define MSCM_CPxCFG3_JAZ_MASK 0x4u
#    define MSCM_CPxCFG3_JAZ_SHIFT 2u
#    define MSCM_CPxCFG3_JAZ_WIDTH 1u
#    define MSCM_CPxCFG3_JAZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_JAZ_SHIFT)) & MSCM_CPxCFG3_JAZ_MASK)
#    define MSCM_CPxCFG3_MMU_MASK 0x8u
#    define MSCM_CPxCFG3_MMU_SHIFT 3u
#    define MSCM_CPxCFG3_MMU_WIDTH 1u
#    define MSCM_CPxCFG3_MMU(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_MMU_SHIFT)) & MSCM_CPxCFG3_MMU_MASK)
#    define MSCM_CPxCFG3_TZ_MASK 0x10u
#    define MSCM_CPxCFG3_TZ_SHIFT 4u
#    define MSCM_CPxCFG3_TZ_WIDTH 1u
#    define MSCM_CPxCFG3_TZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_TZ_SHIFT)) & MSCM_CPxCFG3_TZ_MASK)
#    define MSCM_CPxCFG3_CMP_MASK 0x20u
#    define MSCM_CPxCFG3_CMP_SHIFT 5u
#    define MSCM_CPxCFG3_CMP_WIDTH 1u
#    define MSCM_CPxCFG3_CMP(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_CMP_SHIFT)) & MSCM_CPxCFG3_CMP_MASK)
#    define MSCM_CPxCFG3_BB_MASK 0x40u
#    define MSCM_CPxCFG3_BB_SHIFT 6u
#    define MSCM_CPxCFG3_BB_WIDTH 1u
#    define MSCM_CPxCFG3_BB(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_BB_SHIFT)) & MSCM_CPxCFG3_BB_MASK)
#    define MSCM_CPxCFG3_SBP_MASK 0x300u
#    define MSCM_CPxCFG3_SBP_SHIFT 8u
#    define MSCM_CPxCFG3_SBP_WIDTH 2u
#    define MSCM_CPxCFG3_SBP(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CPxCFG3_SBP_SHIFT)) & MSCM_CPxCFG3_SBP_MASK)
/* CP0TYPE Bit Fields */
#    define MSCM_CP0TYPE_RYPZ_MASK 0xFFu
#    define MSCM_CP0TYPE_RYPZ_SHIFT 0u
#    define MSCM_CP0TYPE_RYPZ_WIDTH 8u
#    define MSCM_CP0TYPE_RYPZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0TYPE_RYPZ_SHIFT)) & MSCM_CP0TYPE_RYPZ_MASK)
#    define MSCM_CP0TYPE_PERSONALITY_MASK 0xFFFFFF00u
#    define MSCM_CP0TYPE_PERSONALITY_SHIFT 8u
#    define MSCM_CP0TYPE_PERSONALITY_WIDTH 24u
#    define MSCM_CP0TYPE_PERSONALITY(x) \
        (((uint32_t)(((uint32_t)(x)) << MSCM_CP0TYPE_PERSONALITY_SHIFT)) & MSCM_CP0TYPE_PERSONALITY_MASK)
/* CP0NUM Bit Fields */
#    define MSCM_CP0NUM_CPN_MASK 0x1u
#    define MSCM_CP0NUM_CPN_SHIFT 0u
#    define MSCM_CP0NUM_CPN_WIDTH 1u
#    define MSCM_CP0NUM_CPN(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0NUM_CPN_SHIFT)) & MSCM_CP0NUM_CPN_MASK)
/* CP0MASTER Bit Fields */
#    define MSCM_CP0MASTER_PPMN_MASK 0x3Fu
#    define MSCM_CP0MASTER_PPMN_SHIFT 0u
#    define MSCM_CP0MASTER_PPMN_WIDTH 6u
#    define MSCM_CP0MASTER_PPMN(x) \
        (((uint32_t)(((uint32_t)(x)) << MSCM_CP0MASTER_PPMN_SHIFT)) & MSCM_CP0MASTER_PPMN_MASK)
/* CP0COUNT Bit Fields */
#    define MSCM_CP0COUNT_PCNT_MASK 0x3u
#    define MSCM_CP0COUNT_PCNT_SHIFT 0u
#    define MSCM_CP0COUNT_PCNT_WIDTH 2u
#    define MSCM_CP0COUNT_PCNT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0COUNT_PCNT_SHIFT)) & MSCM_CP0COUNT_PCNT_MASK)
/* CP0CFG0 Bit Fields */
#    define MSCM_CP0CFG0_DCWY_MASK 0xFFu
#    define MSCM_CP0CFG0_DCWY_SHIFT 0u
#    define MSCM_CP0CFG0_DCWY_WIDTH 8u
#    define MSCM_CP0CFG0_DCWY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG0_DCWY_SHIFT)) & MSCM_CP0CFG0_DCWY_MASK)
#    define MSCM_CP0CFG0_DCSZ_MASK 0xFF00u
#    define MSCM_CP0CFG0_DCSZ_SHIFT 8u
#    define MSCM_CP0CFG0_DCSZ_WIDTH 8u
#    define MSCM_CP0CFG0_DCSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG0_DCSZ_SHIFT)) & MSCM_CP0CFG0_DCSZ_MASK)
#    define MSCM_CP0CFG0_ICWY_MASK 0xFF0000u
#    define MSCM_CP0CFG0_ICWY_SHIFT 16u
#    define MSCM_CP0CFG0_ICWY_WIDTH 8u
#    define MSCM_CP0CFG0_ICWY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG0_ICWY_SHIFT)) & MSCM_CP0CFG0_ICWY_MASK)
#    define MSCM_CP0CFG0_ICSZ_MASK 0xFF000000u
#    define MSCM_CP0CFG0_ICSZ_SHIFT 24u
#    define MSCM_CP0CFG0_ICSZ_WIDTH 8u
#    define MSCM_CP0CFG0_ICSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG0_ICSZ_SHIFT)) & MSCM_CP0CFG0_ICSZ_MASK)
/* CP0CFG1 Bit Fields */
#    define MSCM_CP0CFG1_L2WY_MASK 0xFF0000u
#    define MSCM_CP0CFG1_L2WY_SHIFT 16u
#    define MSCM_CP0CFG1_L2WY_WIDTH 8u
#    define MSCM_CP0CFG1_L2WY(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG1_L2WY_SHIFT)) & MSCM_CP0CFG1_L2WY_MASK)
#    define MSCM_CP0CFG1_L2SZ_MASK 0xFF000000u
#    define MSCM_CP0CFG1_L2SZ_SHIFT 24u
#    define MSCM_CP0CFG1_L2SZ_WIDTH 8u
#    define MSCM_CP0CFG1_L2SZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG1_L2SZ_SHIFT)) & MSCM_CP0CFG1_L2SZ_MASK)
/* CP0CFG2 Bit Fields */
#    define MSCM_CP0CFG2_TMUSZ_MASK 0xFF00u
#    define MSCM_CP0CFG2_TMUSZ_SHIFT 8u
#    define MSCM_CP0CFG2_TMUSZ_WIDTH 8u
#    define MSCM_CP0CFG2_TMUSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_TMUSZ_SHIFT)) & MSCM_CP0CFG2_TMUSZ_MASK)
#    define MSCM_CP0CFG2_TMLSZ_MASK 0xFF000000u
#    define MSCM_CP0CFG2_TMLSZ_SHIFT 24u
#    define MSCM_CP0CFG2_TMLSZ_WIDTH 8u
#    define MSCM_CP0CFG2_TMLSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG2_TMLSZ_SHIFT)) & MSCM_CP0CFG2_TMLSZ_MASK)
/* CP0CFG3 Bit Fields */
#    define MSCM_CP0CFG3_FPU_MASK 0x1u
#    define MSCM_CP0CFG3_FPU_SHIFT 0u
#    define MSCM_CP0CFG3_FPU_WIDTH 1u
#    define MSCM_CP0CFG3_FPU(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_FPU_SHIFT)) & MSCM_CP0CFG3_FPU_MASK)
#    define MSCM_CP0CFG3_SIMD_MASK 0x2u
#    define MSCM_CP0CFG3_SIMD_SHIFT 1u
#    define MSCM_CP0CFG3_SIMD_WIDTH 1u
#    define MSCM_CP0CFG3_SIMD(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_SIMD_SHIFT)) & MSCM_CP0CFG3_SIMD_MASK)
#    define MSCM_CP0CFG3_JAZ_MASK 0x4u
#    define MSCM_CP0CFG3_JAZ_SHIFT 2u
#    define MSCM_CP0CFG3_JAZ_WIDTH 1u
#    define MSCM_CP0CFG3_JAZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_JAZ_SHIFT)) & MSCM_CP0CFG3_JAZ_MASK)
#    define MSCM_CP0CFG3_MMU_MASK 0x8u
#    define MSCM_CP0CFG3_MMU_SHIFT 3u
#    define MSCM_CP0CFG3_MMU_WIDTH 1u
#    define MSCM_CP0CFG3_MMU(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_MMU_SHIFT)) & MSCM_CP0CFG3_MMU_MASK)
#    define MSCM_CP0CFG3_TZ_MASK 0x10u
#    define MSCM_CP0CFG3_TZ_SHIFT 4u
#    define MSCM_CP0CFG3_TZ_WIDTH 1u
#    define MSCM_CP0CFG3_TZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_TZ_SHIFT)) & MSCM_CP0CFG3_TZ_MASK)
#    define MSCM_CP0CFG3_CMP_MASK 0x20u
#    define MSCM_CP0CFG3_CMP_SHIFT 5u
#    define MSCM_CP0CFG3_CMP_WIDTH 1u
#    define MSCM_CP0CFG3_CMP(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_CMP_SHIFT)) & MSCM_CP0CFG3_CMP_MASK)
#    define MSCM_CP0CFG3_BB_MASK 0x40u
#    define MSCM_CP0CFG3_BB_SHIFT 6u
#    define MSCM_CP0CFG3_BB_WIDTH 1u
#    define MSCM_CP0CFG3_BB(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_BB_SHIFT)) & MSCM_CP0CFG3_BB_MASK)
#    define MSCM_CP0CFG3_SBP_MASK 0x300u
#    define MSCM_CP0CFG3_SBP_SHIFT 8u
#    define MSCM_CP0CFG3_SBP_WIDTH 2u
#    define MSCM_CP0CFG3_SBP(x) (((uint32_t)(((uint32_t)(x)) << MSCM_CP0CFG3_SBP_SHIFT)) & MSCM_CP0CFG3_SBP_MASK)
/* OCMDR Bit Fields */
#    define MSCM_OCMDR_OCM0_MASK 0xFu
#    define MSCM_OCMDR_OCM0_SHIFT 0u
#    define MSCM_OCMDR_OCM0_WIDTH 4u
#    define MSCM_OCMDR_OCM0(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCM0_SHIFT)) & MSCM_OCMDR_OCM0_MASK)
#    define MSCM_OCMDR_OCM1_MASK 0xF0u
#    define MSCM_OCMDR_OCM1_SHIFT 4u
#    define MSCM_OCMDR_OCM1_WIDTH 4u
#    define MSCM_OCMDR_OCM1(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCM1_SHIFT)) & MSCM_OCMDR_OCM1_MASK)
#    define MSCM_OCMDR_OCM2_MASK 0xF00u
#    define MSCM_OCMDR_OCM2_SHIFT 8u
#    define MSCM_OCMDR_OCM2_WIDTH 4u
#    define MSCM_OCMDR_OCM2(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCM2_SHIFT)) & MSCM_OCMDR_OCM2_MASK)
#    define MSCM_OCMDR_OCMPU_MASK 0x1000u
#    define MSCM_OCMDR_OCMPU_SHIFT 12u
#    define MSCM_OCMDR_OCMPU_WIDTH 1u
#    define MSCM_OCMDR_OCMPU(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMPU_SHIFT)) & MSCM_OCMDR_OCMPU_MASK)
#    define MSCM_OCMDR_OCMT_MASK 0xE000u
#    define MSCM_OCMDR_OCMT_SHIFT 13u
#    define MSCM_OCMDR_OCMT_WIDTH 3u
#    define MSCM_OCMDR_OCMT(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMT_SHIFT)) & MSCM_OCMDR_OCMT_MASK)
#    define MSCM_OCMDR_RO_MASK 0x10000u
#    define MSCM_OCMDR_RO_SHIFT 16u
#    define MSCM_OCMDR_RO_WIDTH 1u
#    define MSCM_OCMDR_RO(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_RO_SHIFT)) & MSCM_OCMDR_RO_MASK)
#    define MSCM_OCMDR_OCMW_MASK 0xE0000u
#    define MSCM_OCMDR_OCMW_SHIFT 17u
#    define MSCM_OCMDR_OCMW_WIDTH 3u
#    define MSCM_OCMDR_OCMW(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMW_SHIFT)) & MSCM_OCMDR_OCMW_MASK)
#    define MSCM_OCMDR_OCMSZ_MASK 0xF000000u
#    define MSCM_OCMDR_OCMSZ_SHIFT 24u
#    define MSCM_OCMDR_OCMSZ_WIDTH 4u
#    define MSCM_OCMDR_OCMSZ(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMSZ_SHIFT)) & MSCM_OCMDR_OCMSZ_MASK)
#    define MSCM_OCMDR_OCMSZH_MASK 0x10000000u
#    define MSCM_OCMDR_OCMSZH_SHIFT 28u
#    define MSCM_OCMDR_OCMSZH_WIDTH 1u
#    define MSCM_OCMDR_OCMSZH(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_OCMSZH_SHIFT)) & MSCM_OCMDR_OCMSZH_MASK)
#    define MSCM_OCMDR_V_MASK 0x80000000u
#    define MSCM_OCMDR_V_SHIFT 31u
#    define MSCM_OCMDR_V_WIDTH 1u
#    define MSCM_OCMDR_V(x) (((uint32_t)(((uint32_t)(x)) << MSCM_OCMDR_V_SHIFT)) & MSCM_OCMDR_V_MASK)

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- PCC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCC_Peripheral_Access_Layer PCC Peripheral Access Layer
 * @{
 */

/** PCC - Size of Registers Arrays */
#    define PCC_PCCn_COUNT 122u

/** PCC - Register Layout Typedef */
typedef struct
{
    __IO uint32_t
         PCCn[PCC_PCCn_COUNT]; /**< PCC Reserved Register 0..PCC ENET Register, array offset: 0x0, array step: 0x4 */
} PCC_Type, *PCC_MemMapPtr;

/** Number of instances of the PCC module. */
#    define PCC_INSTANCE_COUNT (1u)

/* PCC - Peripheral instance base addresses */
/** Peripheral PCC base address */
#    define PCC_BASE (0x40065000u)
/** Peripheral PCC base pointer */
#    define PCC ((PCC_Type*) PCC_BASE)
/** Array initializer of PCC peripheral base addresses */
#    define PCC_BASE_ADDRS \
        {                  \
            PCC_BASE       \
        }
/** Array initializer of PCC peripheral base pointers */
#    define PCC_BASE_PTRS \
        {                 \
            PCC           \
        }

