OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* PCC index offsets */
#    define PCC_FTFC_INDEX 32
#    define PCC_DMAMUX_INDEX 33
#    define PCC_FlexCAN0_INDEX 36
#    define PCC_FlexCAN1_INDEX 37
#    define PCC_FTM3_INDEX 38
#    define PCC_ADC1_INDEX 39
#    define PCC_FlexCAN2_INDEX 43
#    define PCC_LPSPI0_INDEX 44
#    define PCC_LPSPI1_INDEX 45
#    define PCC_LPSPI2_INDEX 46
#    define PCC_PDB1_INDEX 49
#    define PCC_CRC_INDEX 50
#    define PCC_PDB0_INDEX 54
#    define PCC_LPIT_INDEX 55
#    define PCC_FTM0_INDEX 56
#    define PCC_FTM1_INDEX 57
#    define PCC_FTM2_INDEX 58
#    define PCC_ADC0_INDEX 59
#    define PCC_RTC_INDEX 61
#    define PCC_LPTMR0_INDEX 64
#    define PCC_PORTA_INDEX 73
#    define PCC_PORTB_INDEX 74
#    define PCC_PORTC_INDEX 75
#    define PCC_PORTD_INDEX 76
#    define PCC_PORTE_INDEX 77
#    define PCC_SAI0_INDEX 84
#    define PCC_SAI1_INDEX 85
#    define PCC_FlexIO_INDEX 90
#    define PCC_EWM_INDEX 97
#    define PCC_LPI2C0_INDEX 102
#    define PCC_LPI2C1_INDEX 103
#    define PCC_LPUART0_INDEX 106
#    define PCC_LPUART1_INDEX 107
#    define PCC_LPUART2_INDEX 108
#    define PCC_FTM4_INDEX 110
#    define PCC_FTM5_INDEX 111
#    define PCC_FTM6_INDEX 112
#    define PCC_FTM7_INDEX 113
#    define PCC_CMP0_INDEX 115
#    define PCC_QSPI_INDEX 118
#    define PCC_ENET_INDEX 121

/* ----------------------------------------------------------------------------
   -- PCC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCC_Register_Masks PCC Register Masks
 * @{
 */

/* PCCn Bit Fields */
#    define PCC_PCCn_PCD_MASK 0x7u
#    define PCC_PCCn_PCD_SHIFT 0u
#    define PCC_PCCn_PCD_WIDTH 3u
#    define PCC_PCCn_PCD(x) (((uint32_t)(((uint32_t)(x)) << PCC_PCCn_PCD_SHIFT)) & PCC_PCCn_PCD_MASK)
#    define PCC_PCCn_FRAC_MASK 0x8u
#    define PCC_PCCn_FRAC_SHIFT 3u
#    define PCC_PCCn_FRAC_WIDTH 1u
#    define PCC_PCCn_FRAC(x) (((uint32_t)(((uint32_t)(x)) << PCC_PCCn_FRAC_SHIFT)) & PCC_PCCn_FRAC_MASK)
#    define PCC_PCCn_PCS_MASK 0x7000000u
#    define PCC_PCCn_PCS_SHIFT 24u
#    define PCC_PCCn_PCS_WIDTH 3u
#    define PCC_PCCn_PCS(x) (((uint32_t)(((uint32_t)(x)) << PCC_PCCn_PCS_SHIFT)) & PCC_PCCn_PCS_MASK)
#    define PCC_PCCn_CGC_MASK 0x40000000u
#    define PCC_PCCn_CGC_SHIFT 30u
#    define PCC_PCCn_CGC_WIDTH 1u
#    define PCC_PCCn_CGC(x) (((uint32_t)(((uint32_t)(x)) << PCC_PCCn_CGC_SHIFT)) & PCC_PCCn_CGC_MASK)
#    define PCC_PCCn_PR_MASK 0x80000000u
#    define PCC_PCCn_PR_SHIFT 31u
#    define PCC_PCCn_PR_WIDTH 1u
#    define PCC_PCCn_PR(x) (((uint32_t)(((uint32_t)(x)) << PCC_PCCn_PR_SHIFT)) & PCC_PCCn_PR_MASK)

/*!
 * @}
 */ /* end of group PCC_Register_Masks */

/*!
 * @}
 */ /* end of group PCC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- PDB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PDB_Peripheral_Access_Layer PDB Peripheral Access Layer
 * @{
 */

/** PDB - Size of Registers Arrays */
#    define PDB_CH_COUNT 4u
#    define PDB_DLY_COUNT 8u
#    define PDB_POnDLY_COUNT 1u

/** PDB - Register Layout Typedef */
typedef struct
{
    __IO uint32_t SC;   /**< Status and Control register, offset: 0x0 */
    __IO uint32_t MOD;  /**< Modulus register, offset: 0x4 */
    __I uint32_t CNT;   /**< Counter register, offset: 0x8 */
    __IO uint32_t IDLY; /**< Interrupt Delay register, offset: 0xC */
    struct
    {                                     /* offset: 0x10, array step: 0x28 */
        __IO uint32_t C1;                 /**< Channel n Control register 1, array offset: 0x10, array step: 0x28 */
        __IO uint32_t S;                  /**< Channel n Status register, array offset: 0x14, array step: 0x28 */
        __IO uint32_t DLY[PDB_DLY_COUNT]; /**< Channel n Delay 0 register..Channel n Delay 7 register, array offset:
                                             0x18, array step: index*0x28, index2*0x4 */
    } CH[PDB_CH_COUNT];
    uint8_t RESERVED_0[224];
    __IO uint32_t POEN; /**< Pulse-Out n Enable register, offset: 0x190 */
    union
    {                        /* offset: 0x194, array step: 0x4 */
        __IO uint32_t PODLY; /**< Pulse-Out n Delay register, array offset: 0x194, array step: 0x4 */
        struct
        {                       /* offset: 0x194, array step: 0x4 */
            __IO uint16_t DLY2; /**< PDB1_DLY2 register...PDB0_DLY2 register., array offset: 0x194, array step: 0x4 */
            __IO uint16_t DLY1; /**< PDB1_DLY1 register...PDB0_DLY1 register., array offset: 0x196, array step: 0x4 */
        } ACCESS16BIT;
    } POnDLY[PDB_POnDLY_COUNT];
} PDB_Type, *PDB_MemMapPtr;

/** Number of instances of the PDB module. */
#    define PDB_INSTANCE_COUNT (2u)

/* PDB - Peripheral instance base addresses */
/** Peripheral PDB0 base address */
#    define PDB0_BASE (0x40036000u)
/** Peripheral PDB0 base pointer */
#    define PDB0 ((PDB_Type*) PDB0_BASE)
/** Peripheral PDB1 base address */
#    define PDB1_BASE (0x40031000u)
/** Peripheral PDB1 base pointer */
#    define PDB1 ((PDB_Type*) PDB1_BASE)
/** Array initializer of PDB peripheral base addresses */
#    define PDB_BASE_ADDRS       \
        {                        \
            PDB0_BASE, PDB1_BASE \
        }
/** Array initializer of PDB peripheral base pointers */
#    define PDB_BASE_PTRS \
        {                 \
            PDB0, PDB1    \
        }
/** Number of interrupt vector arrays for the PDB module. */
#    define PDB_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the PDB module. */
#    define PDB_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the PDB peripheral type */
#    define PDB_IRQS             \
        {                        \
            PDB0_IRQn, PDB1_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- PDB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PDB_Register_Masks PDB Register Masks
 * @{
 */

/* SC Bit Fields */
#    define PDB_SC_LDOK_MASK 0x1u
#    define PDB_SC_LDOK_SHIFT 0u
#    define PDB_SC_LDOK_WIDTH 1u
#    define PDB_SC_LDOK(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_LDOK_SHIFT)) & PDB_SC_LDOK_MASK)
#    define PDB_SC_CONT_MASK 0x2u
#    define PDB_SC_CONT_SHIFT 1u
#    define PDB_SC_CONT_WIDTH 1u
#    define PDB_SC_CONT(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_CONT_SHIFT)) & PDB_SC_CONT_MASK)
#    define PDB_SC_MULT_MASK 0xCu
#    define PDB_SC_MULT_SHIFT 2u
#    define PDB_SC_MULT_WIDTH 2u
#    define PDB_SC_MULT(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_MULT_SHIFT)) & PDB_SC_MULT_MASK)
#    define PDB_SC_PDBIE_MASK 0x20u
#    define PDB_SC_PDBIE_SHIFT 5u
#    define PDB_SC_PDBIE_WIDTH 1u
#    define PDB_SC_PDBIE(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_PDBIE_SHIFT)) & PDB_SC_PDBIE_MASK)
#    define PDB_SC_PDBIF_MASK 0x40u
#    define PDB_SC_PDBIF_SHIFT 6u
#    define PDB_SC_PDBIF_WIDTH 1u
#    define PDB_SC_PDBIF(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_PDBIF_SHIFT)) & PDB_SC_PDBIF_MASK)
#    define PDB_SC_PDBEN_MASK 0x80u
#    define PDB_SC_PDBEN_SHIFT 7u
#    define PDB_SC_PDBEN_WIDTH 1u
#    define PDB_SC_PDBEN(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_PDBEN_SHIFT)) & PDB_SC_PDBEN_MASK)
#    define PDB_SC_TRGSEL_MASK 0xF00u
#    define PDB_SC_TRGSEL_SHIFT 8u
#    define PDB_SC_TRGSEL_WIDTH 4u
#    define PDB_SC_TRGSEL(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_TRGSEL_SHIFT)) & PDB_SC_TRGSEL_MASK)
#    define PDB_SC_PRESCALER_MASK 0x7000u
#    define PDB_SC_PRESCALER_SHIFT 12u
#    define PDB_SC_PRESCALER_WIDTH 3u
#    define PDB_SC_PRESCALER(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_PRESCALER_SHIFT)) & PDB_SC_PRESCALER_MASK)
#    define PDB_SC_DMAEN_MASK 0x8000u
#    define PDB_SC_DMAEN_SHIFT 15u
#    define PDB_SC_DMAEN_WIDTH 1u
#    define PDB_SC_DMAEN(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_DMAEN_SHIFT)) & PDB_SC_DMAEN_MASK)
#    define PDB_SC_SWTRIG_MASK 0x10000u
#    define PDB_SC_SWTRIG_SHIFT 16u
#    define PDB_SC_SWTRIG_WIDTH 1u
#    define PDB_SC_SWTRIG(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_SWTRIG_SHIFT)) & PDB_SC_SWTRIG_MASK)
#    define PDB_SC_PDBEIE_MASK 0x20000u
#    define PDB_SC_PDBEIE_SHIFT 17u
#    define PDB_SC_PDBEIE_WIDTH 1u
#    define PDB_SC_PDBEIE(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_PDBEIE_SHIFT)) & PDB_SC_PDBEIE_MASK)
#    define PDB_SC_LDMOD_MASK 0xC0000u
#    define PDB_SC_LDMOD_SHIFT 18u
#    define PDB_SC_LDMOD_WIDTH 2u
#    define PDB_SC_LDMOD(x) (((uint32_t)(((uint32_t)(x)) << PDB_SC_LDMOD_SHIFT)) & PDB_SC_LDMOD_MASK)
/* MOD Bit Fields */
#    define PDB_MOD_MOD_MASK 0xFFFFu
#    define PDB_MOD_MOD_SHIFT 0u
#    define PDB_MOD_MOD_WIDTH 16u
#    define PDB_MOD_MOD(x) (((uint32_t)(((uint32_t)(x)) << PDB_MOD_MOD_SHIFT)) & PDB_MOD_MOD_MASK)
/* CNT Bit Fields */
#    define PDB_CNT_CNT_MASK 0xFFFFu
#    define PDB_CNT_CNT_SHIFT 0u
#    define PDB_CNT_CNT_WIDTH 16u
#    define PDB_CNT_CNT(x) (((uint32_t)(((uint32_t)(x)) << PDB_CNT_CNT_SHIFT)) & PDB_CNT_CNT_MASK)
/* IDLY Bit Fields */
#    define PDB_IDLY_IDLY_MASK 0xFFFFu
#    define PDB_IDLY_IDLY_SHIFT 0u
#    define PDB_IDLY_IDLY_WIDTH 16u
#    define PDB_IDLY_IDLY(x) (((uint32_t)(((uint32_t)(x)) << PDB_IDLY_IDLY_SHIFT)) & PDB_IDLY_IDLY_MASK)
/* C1 Bit Fields */
#    define PDB_C1_EN_MASK 0xFFu
#    define PDB_C1_EN_SHIFT 0u
#    define PDB_C1_EN_WIDTH 8u
#    define PDB_C1_EN(x) (((uint32_t)(((uint32_t)(x)) << PDB_C1_EN_SHIFT)) & PDB_C1_EN_MASK)
#    define PDB_C1_TOS_MASK 0xFF00u
#    define PDB_C1_TOS_SHIFT 8u
#    define PDB_C1_TOS_WIDTH 8u
#    define PDB_C1_TOS(x) (((uint32_t)(((uint32_t)(x)) << PDB_C1_TOS_SHIFT)) & PDB_C1_TOS_MASK)
#    define PDB_C1_BB_MASK 0xFF0000u
#    define PDB_C1_BB_SHIFT 16u
#    define PDB_C1_BB_WIDTH 8u
#    define PDB_C1_BB(x) (((uint32_t)(((uint32_t)(x)) << PDB_C1_BB_SHIFT)) & PDB_C1_BB_MASK)
/* S Bit Fields */
#    define PDB_S_ERR_MASK 0xFFu
#    define PDB_S_ERR_SHIFT 0u
#    define PDB_S_ERR_WIDTH 8u
#    define PDB_S_ERR(x) (((uint32_t)(((uint32_t)(x)) << PDB_S_ERR_SHIFT)) & PDB_S_ERR_MASK)
#    define PDB_S_CF_MASK 0xFF0000u
#    define PDB_S_CF_SHIFT 16u
#    define PDB_S_CF_WIDTH 8u
#    define PDB_S_CF(x) (((uint32_t)(((uint32_t)(x)) << PDB_S_CF_SHIFT)) & PDB_S_CF_MASK)
/* DLY Bit Fields */
#    define PDB_DLY_DLY_MASK 0xFFFFu
#    define PDB_DLY_DLY_SHIFT 0u
#    define PDB_DLY_DLY_WIDTH 16u
#    define PDB_DLY_DLY(x) (((uint32_t)(((uint32_t)(x)) << PDB_DLY_DLY_SHIFT)) & PDB_DLY_DLY_MASK)
/* POEN Bit Fields */
#    define PDB_POEN_POEN_MASK 0xFFu
#    define PDB_POEN_POEN_SHIFT 0u
#    define PDB_POEN_POEN_WIDTH 8u
#    define PDB_POEN_POEN(x) (((uint32_t)(((uint32_t)(x)) << PDB_POEN_POEN_SHIFT)) & PDB_POEN_POEN_MASK)
/* POnDLY_PODLY Bit Fields */
#    define PDB_POnDLY_PODLY_DLY2_MASK 0xFFFFu
#    define PDB_POnDLY_PODLY_DLY2_SHIFT 0u
#    define PDB_POnDLY_PODLY_DLY2_WIDTH 16u
#    define PDB_POnDLY_PODLY_DLY2(x) \
        (((uint32_t)(((uint32_t)(x)) << PDB_POnDLY_PODLY_DLY2_SHIFT)) & PDB_POnDLY_PODLY_DLY2_MASK)
#    define PDB_POnDLY_PODLY_DLY1_MASK 0xFFFF0000u
#    define PDB_POnDLY_PODLY_DLY1_SHIFT 16u
#    define PDB_POnDLY_PODLY_DLY1_WIDTH 16u
#    define PDB_POnDLY_PODLY_DLY1(x) \
        (((uint32_t)(((uint32_t)(x)) << PDB_POnDLY_PODLY_DLY1_SHIFT)) & PDB_POnDLY_PODLY_DLY1_MASK)
/* POnDLY_ACCESS16BIT_DLY2 Bit Fields */
#    define PDB_POnDLY_ACCESS16BIT_DLY2_DLY2_MASK 0xFFFFu
#    define PDB_POnDLY_ACCESS16BIT_DLY2_DLY2_SHIFT 0u
#    define PDB_POnDLY_ACCESS16BIT_DLY2_DLY2_WIDTH 16u
#    define PDB_POnDLY_ACCESS16BIT_DLY2_DLY2(x)                                    \
        (((uint16_t)(((uint16_t)(x)) << PDB_POnDLY_ACCESS16BIT_DLY2_DLY2_SHIFT)) & \
         PDB_POnDLY_ACCESS16BIT_DLY2_DLY2_MASK)
/* POnDLY_ACCESS16BIT_DLY1 Bit Fields */
#    define PDB_POnDLY_ACCESS16BIT_DLY1_DLY1_MASK 0xFFFFu
#    define PDB_POnDLY_ACCESS16BIT_DLY1_DLY1_SHIFT 0u
#    define PDB_POnDLY_ACCESS16BIT_DLY1_DLY1_WIDTH 16u
#    define PDB_POnDLY_ACCESS16BIT_DLY1_DLY1(x)                                    \
        (((uint16_t)(((uint16_t)(x)) << PDB_POnDLY_ACCESS16BIT_DLY1_DLY1_SHIFT)) & \
         PDB_POnDLY_ACCESS16BIT_DLY1_DLY1_MASK)

/*!
 * @}
 */ /* end of group PDB_Register_Masks */

/*!
 * @}
 */ /* end of group PDB_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Peripheral_Access_Layer PMC Peripheral Access Layer
 * @{
 */

