OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** PMC - Size of Registers Arrays */

/** PMC - Register Layout Typedef */
typedef struct
{
    __IO uint8_t LVDSC1; /**< Low Voltage Detect Status and Control 1 Register, offset: 0x0 */
    __IO uint8_t LVDSC2; /**< Low Voltage Detect Status and Control 2 Register, offset: 0x1 */
    __IO uint8_t REGSC;  /**< Regulator Status and Control Register, offset: 0x2 */
    uint8_t      RESERVED_0[1];
    __IO uint8_t LPOTRIM; /**< Low Power Oscillator Trim Register, offset: 0x4 */
} PMC_Type, *PMC_MemMapPtr;

/** Number of instances of the PMC module. */
#    define PMC_INSTANCE_COUNT (1u)

/* PMC - Peripheral instance base addresses */
/** Peripheral PMC base address */
#    define PMC_BASE (0x4007D000u)
/** Peripheral PMC base pointer */
#    define PMC ((PMC_Type*) PMC_BASE)
/** Array initializer of PMC peripheral base addresses */
#    define PMC_BASE_ADDRS \
        {                  \
            PMC_BASE       \
        }
/** Array initializer of PMC peripheral base pointers */
#    define PMC_BASE_PTRS \
        {                 \
            PMC           \
        }
/** Number of interrupt vector arrays for the PMC module. */
#    define PMC_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the PMC module. */
#    define PMC_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the PMC peripheral type */
#    define PMC_IRQS     \
        {                \
            LVD_LVW_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Register_Masks PMC Register Masks
 * @{
 */

/* LVDSC1 Bit Fields */
#    define PMC_LVDSC1_LVDRE_MASK 0x10u
#    define PMC_LVDSC1_LVDRE_SHIFT 4u
#    define PMC_LVDSC1_LVDRE_WIDTH 1u
#    define PMC_LVDSC1_LVDRE(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC1_LVDRE_SHIFT)) & PMC_LVDSC1_LVDRE_MASK)
#    define PMC_LVDSC1_LVDIE_MASK 0x20u
#    define PMC_LVDSC1_LVDIE_SHIFT 5u
#    define PMC_LVDSC1_LVDIE_WIDTH 1u
#    define PMC_LVDSC1_LVDIE(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC1_LVDIE_SHIFT)) & PMC_LVDSC1_LVDIE_MASK)
#    define PMC_LVDSC1_LVDACK_MASK 0x40u
#    define PMC_LVDSC1_LVDACK_SHIFT 6u
#    define PMC_LVDSC1_LVDACK_WIDTH 1u
#    define PMC_LVDSC1_LVDACK(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC1_LVDACK_SHIFT)) & PMC_LVDSC1_LVDACK_MASK)
#    define PMC_LVDSC1_LVDF_MASK 0x80u
#    define PMC_LVDSC1_LVDF_SHIFT 7u
#    define PMC_LVDSC1_LVDF_WIDTH 1u
#    define PMC_LVDSC1_LVDF(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC1_LVDF_SHIFT)) & PMC_LVDSC1_LVDF_MASK)
/* LVDSC2 Bit Fields */
#    define PMC_LVDSC2_LVWIE_MASK 0x20u
#    define PMC_LVDSC2_LVWIE_SHIFT 5u
#    define PMC_LVDSC2_LVWIE_WIDTH 1u
#    define PMC_LVDSC2_LVWIE(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC2_LVWIE_SHIFT)) & PMC_LVDSC2_LVWIE_MASK)
#    define PMC_LVDSC2_LVWACK_MASK 0x40u
#    define PMC_LVDSC2_LVWACK_SHIFT 6u
#    define PMC_LVDSC2_LVWACK_WIDTH 1u
#    define PMC_LVDSC2_LVWACK(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC2_LVWACK_SHIFT)) & PMC_LVDSC2_LVWACK_MASK)
#    define PMC_LVDSC2_LVWF_MASK 0x80u
#    define PMC_LVDSC2_LVWF_SHIFT 7u
#    define PMC_LVDSC2_LVWF_WIDTH 1u
#    define PMC_LVDSC2_LVWF(x) (((uint8_t)(((uint8_t)(x)) << PMC_LVDSC2_LVWF_SHIFT)) & PMC_LVDSC2_LVWF_MASK)
/* REGSC Bit Fields */
#    define PMC_REGSC_BIASEN_MASK 0x1u
#    define PMC_REGSC_BIASEN_SHIFT 0u
#    define PMC_REGSC_BIASEN_WIDTH 1u
#    define PMC_REGSC_BIASEN(x) (((uint8_t)(((uint8_t)(x)) << PMC_REGSC_BIASEN_SHIFT)) & PMC_REGSC_BIASEN_MASK)
#    define PMC_REGSC_CLKBIASDIS_MASK 0x2u
#    define PMC_REGSC_CLKBIASDIS_SHIFT 1u
#    define PMC_REGSC_CLKBIASDIS_WIDTH 1u
#    define PMC_REGSC_CLKBIASDIS(x) \
        (((uint8_t)(((uint8_t)(x)) << PMC_REGSC_CLKBIASDIS_SHIFT)) & PMC_REGSC_CLKBIASDIS_MASK)
#    define PMC_REGSC_REGFPM_MASK 0x4u
#    define PMC_REGSC_REGFPM_SHIFT 2u
#    define PMC_REGSC_REGFPM_WIDTH 1u
#    define PMC_REGSC_REGFPM(x) (((uint8_t)(((uint8_t)(x)) << PMC_REGSC_REGFPM_SHIFT)) & PMC_REGSC_REGFPM_MASK)
#    define PMC_REGSC_LPOSTAT_MASK 0x40u
#    define PMC_REGSC_LPOSTAT_SHIFT 6u
#    define PMC_REGSC_LPOSTAT_WIDTH 1u
#    define PMC_REGSC_LPOSTAT(x) (((uint8_t)(((uint8_t)(x)) << PMC_REGSC_LPOSTAT_SHIFT)) & PMC_REGSC_LPOSTAT_MASK)
#    define PMC_REGSC_LPODIS_MASK 0x80u
#    define PMC_REGSC_LPODIS_SHIFT 7u
#    define PMC_REGSC_LPODIS_WIDTH 1u
#    define PMC_REGSC_LPODIS(x) (((uint8_t)(((uint8_t)(x)) << PMC_REGSC_LPODIS_SHIFT)) & PMC_REGSC_LPODIS_MASK)
/* LPOTRIM Bit Fields */
#    define PMC_LPOTRIM_LPOTRIM_MASK 0x1Fu
#    define PMC_LPOTRIM_LPOTRIM_SHIFT 0u
#    define PMC_LPOTRIM_LPOTRIM_WIDTH 5u
#    define PMC_LPOTRIM_LPOTRIM(x) (((uint8_t)(((uint8_t)(x)) << PMC_LPOTRIM_LPOTRIM_SHIFT)) & PMC_LPOTRIM_LPOTRIM_MASK)

/*!
 * @}
 */ /* end of group PMC_Register_Masks */

/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- PORT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PORT_Peripheral_Access_Layer PORT Peripheral Access Layer
 * @{
 */

/** PORT - Size of Registers Arrays */
#    define PORT_PCR_COUNT 32u

/** PORT - Register Layout Typedef */
typedef struct
{
    __IO uint32_t PCR[PORT_PCR_COUNT]; /**< Pin Control Register n, array offset: 0x0, array step: 0x4 */
    __O uint32_t GPCLR;                /**< Global Pin Control Low Register, offset: 0x80 */
    __O uint32_t GPCHR;                /**< Global Pin Control High Register, offset: 0x84 */
    uint8_t      RESERVED_0[24];
    __IO uint32_t ISFR; /**< Interrupt Status Flag Register, offset: 0xA0 */
    uint8_t       RESERVED_1[28];
    __IO uint32_t DFER; /**< Digital Filter Enable Register, offset: 0xC0 */
    __IO uint32_t DFCR; /**< Digital Filter Clock Register, offset: 0xC4 */
    __IO uint32_t DFWR; /**< Digital Filter Width Register, offset: 0xC8 */
} PORT_Type, *PORT_MemMapPtr;

/** Number of instances of the PORT module. */
#    define PORT_INSTANCE_COUNT (5u)

