OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* PORT - Peripheral instance base addresses */
/** Peripheral PORTA base address */
#    define PORTA_BASE (0x40049000u)
/** Peripheral PORTA base pointer */
#    define PORTA ((PORT_Type*) PORTA_BASE)
/** Peripheral PORTB base address */
#    define PORTB_BASE (0x4004A000u)
/** Peripheral PORTB base pointer */
#    define PORTB ((PORT_Type*) PORTB_BASE)
/** Peripheral PORTC base address */
#    define PORTC_BASE (0x4004B000u)
/** Peripheral PORTC base pointer */
#    define PORTC ((PORT_Type*) PORTC_BASE)
/** Peripheral PORTD base address */
#    define PORTD_BASE (0x4004C000u)
/** Peripheral PORTD base pointer */
#    define PORTD ((PORT_Type*) PORTD_BASE)
/** Peripheral PORTE base address */
#    define PORTE_BASE (0x4004D000u)
/** Peripheral PORTE base pointer */
#    define PORTE ((PORT_Type*) PORTE_BASE)
/** Array initializer of PORT peripheral base addresses */
#    define PORT_BASE_ADDRS                                            \
        {                                                              \
            PORTA_BASE, PORTB_BASE, PORTC_BASE, PORTD_BASE, PORTE_BASE \
        }
/** Array initializer of PORT peripheral base pointers */
#    define PORT_BASE_PTRS                    \
        {                                     \
            PORTA, PORTB, PORTC, PORTD, PORTE \
        }
/** Number of interrupt vector arrays for the PORT module. */
#    define PORT_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the PORT module. */
#    define PORT_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the PORT peripheral type */
#    define PORT_IRQS                                                  \
        {                                                              \
            PORTA_IRQn, PORTB_IRQn, PORTC_IRQn, PORTD_IRQn, PORTE_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- PORT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PORT_Register_Masks PORT Register Masks
 * @{
 */

/* PCR Bit Fields */
#    define PORT_PCR_PS_MASK 0x1u
#    define PORT_PCR_PS_SHIFT 0u
#    define PORT_PCR_PS_WIDTH 1u
#    define PORT_PCR_PS(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_PS_SHIFT)) & PORT_PCR_PS_MASK)
#    define PORT_PCR_PE_MASK 0x2u
#    define PORT_PCR_PE_SHIFT 1u
#    define PORT_PCR_PE_WIDTH 1u
#    define PORT_PCR_PE(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_PE_SHIFT)) & PORT_PCR_PE_MASK)
#    define PORT_PCR_PFE_MASK 0x10u
#    define PORT_PCR_PFE_SHIFT 4u
#    define PORT_PCR_PFE_WIDTH 1u
#    define PORT_PCR_PFE(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_PFE_SHIFT)) & PORT_PCR_PFE_MASK)
#    define PORT_PCR_DSE_MASK 0x40u
#    define PORT_PCR_DSE_SHIFT 6u
#    define PORT_PCR_DSE_WIDTH 1u
#    define PORT_PCR_DSE(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_DSE_SHIFT)) & PORT_PCR_DSE_MASK)
#    define PORT_PCR_MUX_MASK 0x700u
#    define PORT_PCR_MUX_SHIFT 8u
#    define PORT_PCR_MUX_WIDTH 3u
#    define PORT_PCR_MUX(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_MUX_SHIFT)) & PORT_PCR_MUX_MASK)
#    define PORT_PCR_LK_MASK 0x8000u
#    define PORT_PCR_LK_SHIFT 15u
#    define PORT_PCR_LK_WIDTH 1u
#    define PORT_PCR_LK(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_LK_SHIFT)) & PORT_PCR_LK_MASK)
#    define PORT_PCR_IRQC_MASK 0xF0000u
#    define PORT_PCR_IRQC_SHIFT 16u
#    define PORT_PCR_IRQC_WIDTH 4u
#    define PORT_PCR_IRQC(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_IRQC_SHIFT)) & PORT_PCR_IRQC_MASK)
#    define PORT_PCR_ISF_MASK 0x1000000u
#    define PORT_PCR_ISF_SHIFT 24u
#    define PORT_PCR_ISF_WIDTH 1u
#    define PORT_PCR_ISF(x) (((uint32_t)(((uint32_t)(x)) << PORT_PCR_ISF_SHIFT)) & PORT_PCR_ISF_MASK)
/* GPCLR Bit Fields */
#    define PORT_GPCLR_GPWD_MASK 0xFFFFu
#    define PORT_GPCLR_GPWD_SHIFT 0u
#    define PORT_GPCLR_GPWD_WIDTH 16u
#    define PORT_GPCLR_GPWD(x) (((uint32_t)(((uint32_t)(x)) << PORT_GPCLR_GPWD_SHIFT)) & PORT_GPCLR_GPWD_MASK)
#    define PORT_GPCLR_GPWE_MASK 0xFFFF0000u
#    define PORT_GPCLR_GPWE_SHIFT 16u
#    define PORT_GPCLR_GPWE_WIDTH 16u
#    define PORT_GPCLR_GPWE(x) (((uint32_t)(((uint32_t)(x)) << PORT_GPCLR_GPWE_SHIFT)) & PORT_GPCLR_GPWE_MASK)
/* GPCHR Bit Fields */
#    define PORT_GPCHR_GPWD_MASK 0xFFFFu
#    define PORT_GPCHR_GPWD_SHIFT 0u
#    define PORT_GPCHR_GPWD_WIDTH 16u
#    define PORT_GPCHR_GPWD(x) (((uint32_t)(((uint32_t)(x)) << PORT_GPCHR_GPWD_SHIFT)) & PORT_GPCHR_GPWD_MASK)
#    define PORT_GPCHR_GPWE_MASK 0xFFFF0000u
#    define PORT_GPCHR_GPWE_SHIFT 16u
#    define PORT_GPCHR_GPWE_WIDTH 16u
#    define PORT_GPCHR_GPWE(x) (((uint32_t)(((uint32_t)(x)) << PORT_GPCHR_GPWE_SHIFT)) & PORT_GPCHR_GPWE_MASK)
/* ISFR Bit Fields */
#    define PORT_ISFR_ISF_MASK 0xFFFFFFFFu
#    define PORT_ISFR_ISF_SHIFT 0u
#    define PORT_ISFR_ISF_WIDTH 32u
#    define PORT_ISFR_ISF(x) (((uint32_t)(((uint32_t)(x)) << PORT_ISFR_ISF_SHIFT)) & PORT_ISFR_ISF_MASK)
/* DFER Bit Fields */
#    define PORT_DFER_DFE_MASK 0xFFFFFFFFu
#    define PORT_DFER_DFE_SHIFT 0u
#    define PORT_DFER_DFE_WIDTH 32u
#    define PORT_DFER_DFE(x) (((uint32_t)(((uint32_t)(x)) << PORT_DFER_DFE_SHIFT)) & PORT_DFER_DFE_MASK)
/* DFCR Bit Fields */
#    define PORT_DFCR_CS_MASK 0x1u
#    define PORT_DFCR_CS_SHIFT 0u
#    define PORT_DFCR_CS_WIDTH 1u
#    define PORT_DFCR_CS(x) (((uint32_t)(((uint32_t)(x)) << PORT_DFCR_CS_SHIFT)) & PORT_DFCR_CS_MASK)
/* DFWR Bit Fields */
#    define PORT_DFWR_FILT_MASK 0x1Fu
#    define PORT_DFWR_FILT_SHIFT 0u
#    define PORT_DFWR_FILT_WIDTH 5u
#    define PORT_DFWR_FILT(x) (((uint32_t)(((uint32_t)(x)) << PORT_DFWR_FILT_SHIFT)) & PORT_DFWR_FILT_MASK)

/*!
 * @}
 */ /* end of group PORT_Register_Masks */

/*!
 * @}
 */ /* end of group PORT_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- QuadSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup QuadSPI_Peripheral_Access_Layer QuadSPI Peripheral Access Layer
 * @{
 */

/** QuadSPI - Size of Registers Arrays */
#    define QuadSPI_RBDR_COUNT 32u
#    define QuadSPI_LUT_COUNT 64u

