OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** QuadSPI - Register Layout Typedef */
typedef struct
{
    __IO uint32_t MCR; /**< Module Configuration Register, offset: 0x0 */
    uint8_t       RESERVED_0[4];
    __IO uint32_t IPCR;    /**< IP Configuration Register, offset: 0x8 */
    __IO uint32_t FLSHCR;  /**< Flash Configuration Register, offset: 0xC */
    __IO uint32_t BUF0CR;  /**< Buffer0 Configuration Register, offset: 0x10 */
    __IO uint32_t BUF1CR;  /**< Buffer1 Configuration Register, offset: 0x14 */
    __IO uint32_t BUF2CR;  /**< Buffer2 Configuration Register, offset: 0x18 */
    __IO uint32_t BUF3CR;  /**< Buffer3 Configuration Register, offset: 0x1C */
    __IO uint32_t BFGENCR; /**< Buffer Generic Configuration Register, offset: 0x20 */
    __IO uint32_t SOCCR;   /**< SOC Configuration Register, offset: 0x24 */
    uint8_t       RESERVED_1[8];
    __IO uint32_t BUF0IND; /**< Buffer0 Top Index Register, offset: 0x30 */
    __IO uint32_t BUF1IND; /**< Buffer1 Top Index Register, offset: 0x34 */
    __IO uint32_t BUF2IND; /**< Buffer2 Top Index Register, offset: 0x38 */
    uint8_t       RESERVED_2[196];
    __IO uint32_t SFAR;  /**< Serial Flash Address Register, offset: 0x100 */
    __IO uint32_t SFACR; /**< Serial Flash Address Configuration Register, offset: 0x104 */
    __IO uint32_t SMPR;  /**< Sampling Register, offset: 0x108 */
    __I uint32_t RBSR;   /**< RX Buffer Status Register, offset: 0x10C */
    __IO uint32_t RBCT;  /**< RX Buffer Control Register, offset: 0x110 */
    uint8_t       RESERVED_3[60];
    __I uint32_t TBSR;     /**< TX Buffer Status Register, offset: 0x150 */
    __IO uint32_t TBDR;    /**< TX Buffer Data Register, offset: 0x154 */
    __IO uint32_t TBCT;    /**< Tx Buffer Control Register, offset: 0x158 */
    __I uint32_t SR;       /**< Status Register, offset: 0x15C */
    __IO uint32_t FR;      /**< Flag Register, offset: 0x160 */
    __IO uint32_t RSER;    /**< Interrupt and DMA Request Select and Enable Register, offset: 0x164 */
    __I uint32_t SPNDST;   /**< Sequence Suspend Status Register, offset: 0x168 */
    __IO uint32_t SPTRCLR; /**< Sequence Pointer Clear Register, offset: 0x16C */
    uint8_t       RESERVED_4[16];
    __IO uint32_t SFA1AD; /**< Serial Flash A1 Top Address, offset: 0x180 */
    __IO uint32_t SFA2AD; /**< Serial Flash A2 Top Address, offset: 0x184 */
    __IO uint32_t SFB1AD; /**< Serial Flash B1 Top Address, offset: 0x188 */
    __IO uint32_t SFB2AD; /**< Serial Flash B2 Top Address, offset: 0x18C */
    uint8_t       RESERVED_5[112];
    __I uint32_t RBDR[QuadSPI_RBDR_COUNT]; /**< RX Buffer Data Register, array offset: 0x200, array step: 0x4 */
    uint8_t      RESERVED_6[128];
    __IO uint32_t LUTKEY; /**< LUT Key Register, offset: 0x300 */
    __IO uint32_t LCKCR;  /**< LUT Lock Configuration Register, offset: 0x304 */
    uint8_t       RESERVED_7[8];
    __IO uint32_t LUT[QuadSPI_LUT_COUNT]; /**< Look-up Table register, array offset: 0x310, array step: 0x4 */
} QuadSPI_Type, *QuadSPI_MemMapPtr;

/** Number of instances of the QuadSPI module. */
#    define QuadSPI_INSTANCE_COUNT (1u)

/* QuadSPI - Peripheral instance base addresses */
/** Peripheral QuadSPI base address */
#    define QuadSPI_BASE (0x40076000u)
/** Peripheral QuadSPI base pointer */
#    define QuadSPI ((QuadSPI_Type*) QuadSPI_BASE)
/** Array initializer of QuadSPI peripheral base addresses */
#    define QuadSPI_BASE_ADDRS \
        {                      \
            QuadSPI_BASE       \
        }
/** Array initializer of QuadSPI peripheral base pointers */
#    define QuadSPI_BASE_PTRS \
        {                     \
            QuadSPI           \
        }
/** Number of interrupt vector arrays for the QuadSPI module. */
#    define QuadSPI_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the QuadSPI module. */
#    define QuadSPI_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the QuadSPI peripheral type */
#    define QuadSPI_IRQS \
        {                \
            QSPI_IRQn    \
        }

/* ----------------------------------------------------------------------------
   -- QuadSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup QuadSPI_Register_Masks QuadSPI Register Masks
 * @{
 */

/* MCR Bit Fields */
#    define QuadSPI_MCR_SWRSTSD_MASK 0x1u
#    define QuadSPI_MCR_SWRSTSD_SHIFT 0u
#    define QuadSPI_MCR_SWRSTSD_WIDTH 1u
#    define QuadSPI_MCR_SWRSTSD(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_SWRSTSD_SHIFT)) & QuadSPI_MCR_SWRSTSD_MASK)
#    define QuadSPI_MCR_SWRSTHD_MASK 0x2u
#    define QuadSPI_MCR_SWRSTHD_SHIFT 1u
#    define QuadSPI_MCR_SWRSTHD_WIDTH 1u
#    define QuadSPI_MCR_SWRSTHD(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_SWRSTHD_SHIFT)) & QuadSPI_MCR_SWRSTHD_MASK)
#    define QuadSPI_MCR_END_CFG_MASK 0xCu
#    define QuadSPI_MCR_END_CFG_SHIFT 2u
#    define QuadSPI_MCR_END_CFG_WIDTH 2u
#    define QuadSPI_MCR_END_CFG(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_END_CFG_SHIFT)) & QuadSPI_MCR_END_CFG_MASK)
#    define QuadSPI_MCR_DQS_OUT_EN_MASK 0x10u
#    define QuadSPI_MCR_DQS_OUT_EN_SHIFT 4u
#    define QuadSPI_MCR_DQS_OUT_EN_WIDTH 1u
#    define QuadSPI_MCR_DQS_OUT_EN(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_DQS_OUT_EN_SHIFT)) & QuadSPI_MCR_DQS_OUT_EN_MASK)
#    define QuadSPI_MCR_DQS_LAT_EN_MASK 0x20u
#    define QuadSPI_MCR_DQS_LAT_EN_SHIFT 5u
#    define QuadSPI_MCR_DQS_LAT_EN_WIDTH 1u
#    define QuadSPI_MCR_DQS_LAT_EN(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_DQS_LAT_EN_SHIFT)) & QuadSPI_MCR_DQS_LAT_EN_MASK)
#    define QuadSPI_MCR_DQS_EN_MASK 0x40u
#    define QuadSPI_MCR_DQS_EN_SHIFT 6u
#    define QuadSPI_MCR_DQS_EN_WIDTH 1u
#    define QuadSPI_MCR_DQS_EN(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_DQS_EN_SHIFT)) & QuadSPI_MCR_DQS_EN_MASK)
#    define QuadSPI_MCR_DDR_EN_MASK 0x80u
#    define QuadSPI_MCR_DDR_EN_SHIFT 7u
#    define QuadSPI_MCR_DDR_EN_WIDTH 1u
#    define QuadSPI_MCR_DDR_EN(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_DDR_EN_SHIFT)) & QuadSPI_MCR_DDR_EN_MASK)
#    define QuadSPI_MCR_VAR_LAT_EN_MASK 0x100u
#    define QuadSPI_MCR_VAR_LAT_EN_SHIFT 8u
#    define QuadSPI_MCR_VAR_LAT_EN_WIDTH 1u
#    define QuadSPI_MCR_VAR_LAT_EN(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_VAR_LAT_EN_SHIFT)) & QuadSPI_MCR_VAR_LAT_EN_MASK)
#    define QuadSPI_MCR_CLR_RXF_MASK 0x400u
#    define QuadSPI_MCR_CLR_RXF_SHIFT 10u
#    define QuadSPI_MCR_CLR_RXF_WIDTH 1u
#    define QuadSPI_MCR_CLR_RXF(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_CLR_RXF_SHIFT)) & QuadSPI_MCR_CLR_RXF_MASK)
#    define QuadSPI_MCR_CLR_TXF_MASK 0x800u
#    define QuadSPI_MCR_CLR_TXF_SHIFT 11u
#    define QuadSPI_MCR_CLR_TXF_WIDTH 1u
#    define QuadSPI_MCR_CLR_TXF(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_CLR_TXF_SHIFT)) & QuadSPI_MCR_CLR_TXF_MASK)
#    define QuadSPI_MCR_MDIS_MASK 0x4000u
#    define QuadSPI_MCR_MDIS_SHIFT 14u
#    define QuadSPI_MCR_MDIS_WIDTH 1u
#    define QuadSPI_MCR_MDIS(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_MDIS_SHIFT)) & QuadSPI_MCR_MDIS_MASK)
#    define QuadSPI_MCR_DOZE_MASK 0x8000u
#    define QuadSPI_MCR_DOZE_SHIFT 15u
#    define QuadSPI_MCR_DOZE_WIDTH 1u
#    define QuadSPI_MCR_DOZE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_DOZE_SHIFT)) & QuadSPI_MCR_DOZE_MASK)
#    define QuadSPI_MCR_ISD2FA_MASK 0x10000u
#    define QuadSPI_MCR_ISD2FA_SHIFT 16u
#    define QuadSPI_MCR_ISD2FA_WIDTH 1u
#    define QuadSPI_MCR_ISD2FA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_ISD2FA_SHIFT)) & QuadSPI_MCR_ISD2FA_MASK)
#    define QuadSPI_MCR_ISD3FA_MASK 0x20000u
#    define QuadSPI_MCR_ISD3FA_SHIFT 17u
#    define QuadSPI_MCR_ISD3FA_WIDTH 1u
#    define QuadSPI_MCR_ISD3FA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_ISD3FA_SHIFT)) & QuadSPI_MCR_ISD3FA_MASK)
#    define QuadSPI_MCR_ISD2FB_MASK 0x40000u
#    define QuadSPI_MCR_ISD2FB_SHIFT 18u
#    define QuadSPI_MCR_ISD2FB_WIDTH 1u
#    define QuadSPI_MCR_ISD2FB(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_ISD2FB_SHIFT)) & QuadSPI_MCR_ISD2FB_MASK)
#    define QuadSPI_MCR_ISD3FB_MASK 0x80000u
#    define QuadSPI_MCR_ISD3FB_SHIFT 19u
#    define QuadSPI_MCR_ISD3FB_WIDTH 1u
#    define QuadSPI_MCR_ISD3FB(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_ISD3FB_SHIFT)) & QuadSPI_MCR_ISD3FB_MASK)
#    define QuadSPI_MCR_SCLKCFG_MASK 0xFF000000u
#    define QuadSPI_MCR_SCLKCFG_SHIFT 24u
#    define QuadSPI_MCR_SCLKCFG_WIDTH 8u
#    define QuadSPI_MCR_SCLKCFG(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_MCR_SCLKCFG_SHIFT)) & QuadSPI_MCR_SCLKCFG_MASK)
/* IPCR Bit Fields */
#    define QuadSPI_IPCR_IDATSZ_MASK 0xFFFFu
#    define QuadSPI_IPCR_IDATSZ_SHIFT 0u
#    define QuadSPI_IPCR_IDATSZ_WIDTH 16u
#    define QuadSPI_IPCR_IDATSZ(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPCR_IDATSZ_SHIFT)) & QuadSPI_IPCR_IDATSZ_MASK)
#    define QuadSPI_IPCR_SEQID_MASK 0xF000000u
#    define QuadSPI_IPCR_SEQID_SHIFT 24u
#    define QuadSPI_IPCR_SEQID_WIDTH 4u
#    define QuadSPI_IPCR_SEQID(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPCR_SEQID_SHIFT)) & QuadSPI_IPCR_SEQID_MASK)
/* FLSHCR Bit Fields */
#    define QuadSPI_FLSHCR_TCSS_MASK 0xFu
#    define QuadSPI_FLSHCR_TCSS_SHIFT 0u
#    define QuadSPI_FLSHCR_TCSS_WIDTH 4u
#    define QuadSPI_FLSHCR_TCSS(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSHCR_TCSS_SHIFT)) & QuadSPI_FLSHCR_TCSS_MASK)
#    define QuadSPI_FLSHCR_TCSH_MASK 0xF00u
#    define QuadSPI_FLSHCR_TCSH_SHIFT 8u
#    define QuadSPI_FLSHCR_TCSH_WIDTH 4u
#    define QuadSPI_FLSHCR_TCSH(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSHCR_TCSH_SHIFT)) & QuadSPI_FLSHCR_TCSH_MASK)
#    define QuadSPI_FLSHCR_TDH_MASK 0x30000u
#    define QuadSPI_FLSHCR_TDH_SHIFT 16u
#    define QuadSPI_FLSHCR_TDH_WIDTH 2u
#    define QuadSPI_FLSHCR_TDH(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FLSHCR_TDH_SHIFT)) & QuadSPI_FLSHCR_TDH_MASK)
/* BUF0CR Bit Fields */
#    define QuadSPI_BUF0CR_MSTRID_MASK 0xFu
#    define QuadSPI_BUF0CR_MSTRID_SHIFT 0u
#    define QuadSPI_BUF0CR_MSTRID_WIDTH 4u
#    define QuadSPI_BUF0CR_MSTRID(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF0CR_MSTRID_SHIFT)) & QuadSPI_BUF0CR_MSTRID_MASK)
#    define QuadSPI_BUF0CR_ADATSZ_MASK 0xFF00u
#    define QuadSPI_BUF0CR_ADATSZ_SHIFT 8u
#    define QuadSPI_BUF0CR_ADATSZ_WIDTH 8u
#    define QuadSPI_BUF0CR_ADATSZ(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF0CR_ADATSZ_SHIFT)) & QuadSPI_BUF0CR_ADATSZ_MASK)
#    define QuadSPI_BUF0CR_HP_EN_MASK 0x80000000u
#    define QuadSPI_BUF0CR_HP_EN_SHIFT 31u
#    define QuadSPI_BUF0CR_HP_EN_WIDTH 1u
#    define QuadSPI_BUF0CR_HP_EN(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF0CR_HP_EN_SHIFT)) & QuadSPI_BUF0CR_HP_EN_MASK)
/* BUF1CR Bit Fields */
#    define QuadSPI_BUF1CR_MSTRID_MASK 0xFu
#    define QuadSPI_BUF1CR_MSTRID_SHIFT 0u
#    define QuadSPI_BUF1CR_MSTRID_WIDTH 4u
#    define QuadSPI_BUF1CR_MSTRID(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF1CR_MSTRID_SHIFT)) & QuadSPI_BUF1CR_MSTRID_MASK)
#    define QuadSPI_BUF1CR_ADATSZ_MASK 0xFF00u
#    define QuadSPI_BUF1CR_ADATSZ_SHIFT 8u
#    define QuadSPI_BUF1CR_ADATSZ_WIDTH 8u
#    define QuadSPI_BUF1CR_ADATSZ(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF1CR_ADATSZ_SHIFT)) & QuadSPI_BUF1CR_ADATSZ_MASK)
/* BUF2CR Bit Fields */
#    define QuadSPI_BUF2CR_MSTRID_MASK 0xFu
#    define QuadSPI_BUF2CR_MSTRID_SHIFT 0u
#    define QuadSPI_BUF2CR_MSTRID_WIDTH 4u
#    define QuadSPI_BUF2CR_MSTRID(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF2CR_MSTRID_SHIFT)) & QuadSPI_BUF2CR_MSTRID_MASK)
#    define QuadSPI_BUF2CR_ADATSZ_MASK 0xFF00u
#    define QuadSPI_BUF2CR_ADATSZ_SHIFT 8u
#    define QuadSPI_BUF2CR_ADATSZ_WIDTH 8u
#    define QuadSPI_BUF2CR_ADATSZ(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF2CR_ADATSZ_SHIFT)) & QuadSPI_BUF2CR_ADATSZ_MASK)
/* BUF3CR Bit Fields */
#    define QuadSPI_BUF3CR_MSTRID_MASK 0xFu
#    define QuadSPI_BUF3CR_MSTRID_SHIFT 0u
#    define QuadSPI_BUF3CR_MSTRID_WIDTH 4u
#    define QuadSPI_BUF3CR_MSTRID(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF3CR_MSTRID_SHIFT)) & QuadSPI_BUF3CR_MSTRID_MASK)
#    define QuadSPI_BUF3CR_ADATSZ_MASK 0xFF00u
#    define QuadSPI_BUF3CR_ADATSZ_SHIFT 8u
#    define QuadSPI_BUF3CR_ADATSZ_WIDTH 8u
#    define QuadSPI_BUF3CR_ADATSZ(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF3CR_ADATSZ_SHIFT)) & QuadSPI_BUF3CR_ADATSZ_MASK)
#    define QuadSPI_BUF3CR_ALLMST_MASK 0x80000000u
#    define QuadSPI_BUF3CR_ALLMST_SHIFT 31u
#    define QuadSPI_BUF3CR_ALLMST_WIDTH 1u
#    define QuadSPI_BUF3CR_ALLMST(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF3CR_ALLMST_SHIFT)) & QuadSPI_BUF3CR_ALLMST_MASK)
/* BFGENCR Bit Fields */
#    define QuadSPI_BFGENCR_SEQID_MASK 0xF000u
#    define QuadSPI_BFGENCR_SEQID_SHIFT 12u
#    define QuadSPI_BFGENCR_SEQID_WIDTH 4u
#    define QuadSPI_BFGENCR_SEQID(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BFGENCR_SEQID_SHIFT)) & QuadSPI_BFGENCR_SEQID_MASK)
/* SOCCR Bit Fields */
#    define QuadSPI_SOCCR_SOCCFG_MASK 0xFFFFFFFFu
#    define QuadSPI_SOCCR_SOCCFG_SHIFT 0u
#    define QuadSPI_SOCCR_SOCCFG_WIDTH 32u
#    define QuadSPI_SOCCR_SOCCFG(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SOCCR_SOCCFG_SHIFT)) & QuadSPI_SOCCR_SOCCFG_MASK)
/* BUF0IND Bit Fields */
#    define QuadSPI_BUF0IND_TPINDX0_MASK 0xFFFFFFF8u
#    define QuadSPI_BUF0IND_TPINDX0_SHIFT 3u
#    define QuadSPI_BUF0IND_TPINDX0_WIDTH 29u
#    define QuadSPI_BUF0IND_TPINDX0(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF0IND_TPINDX0_SHIFT)) & QuadSPI_BUF0IND_TPINDX0_MASK)
/* BUF1IND Bit Fields */
#    define QuadSPI_BUF1IND_TPINDX1_MASK 0xFFFFFFF8u
#    define QuadSPI_BUF1IND_TPINDX1_SHIFT 3u
#    define QuadSPI_BUF1IND_TPINDX1_WIDTH 29u
#    define QuadSPI_BUF1IND_TPINDX1(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF1IND_TPINDX1_SHIFT)) & QuadSPI_BUF1IND_TPINDX1_MASK)
/* BUF2IND Bit Fields */
#    define QuadSPI_BUF2IND_TPINDX2_MASK 0xFFFFFFF8u
#    define QuadSPI_BUF2IND_TPINDX2_SHIFT 3u
#    define QuadSPI_BUF2IND_TPINDX2_WIDTH 29u
#    define QuadSPI_BUF2IND_TPINDX2(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_BUF2IND_TPINDX2_SHIFT)) & QuadSPI_BUF2IND_TPINDX2_MASK)
/* SFAR Bit Fields */
#    define QuadSPI_SFAR_SFADR_MASK 0xFFFFFFFFu
#    define QuadSPI_SFAR_SFADR_SHIFT 0u
#    define QuadSPI_SFAR_SFADR_WIDTH 32u
#    define QuadSPI_SFAR_SFADR(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFAR_SFADR_SHIFT)) & QuadSPI_SFAR_SFADR_MASK)
/* SFACR Bit Fields */
#    define QuadSPI_SFACR_CAS_MASK 0xFu
#    define QuadSPI_SFACR_CAS_SHIFT 0u
#    define QuadSPI_SFACR_CAS_WIDTH 4u
#    define QuadSPI_SFACR_CAS(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFACR_CAS_SHIFT)) & QuadSPI_SFACR_CAS_MASK)
#    define QuadSPI_SFACR_WA_MASK 0x10000u
#    define QuadSPI_SFACR_WA_SHIFT 16u
#    define QuadSPI_SFACR_WA_WIDTH 1u
#    define QuadSPI_SFACR_WA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFACR_WA_SHIFT)) & QuadSPI_SFACR_WA_MASK)
/* SMPR Bit Fields */
#    define QuadSPI_SMPR_FSPHS_MASK 0x20u
#    define QuadSPI_SMPR_FSPHS_SHIFT 5u
#    define QuadSPI_SMPR_FSPHS_WIDTH 1u
#    define QuadSPI_SMPR_FSPHS(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SMPR_FSPHS_SHIFT)) & QuadSPI_SMPR_FSPHS_MASK)
#    define QuadSPI_SMPR_FSDLY_MASK 0x40u
#    define QuadSPI_SMPR_FSDLY_SHIFT 6u
#    define QuadSPI_SMPR_FSDLY_WIDTH 1u
#    define QuadSPI_SMPR_FSDLY(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SMPR_FSDLY_SHIFT)) & QuadSPI_SMPR_FSDLY_MASK)
/* RBSR Bit Fields */
#    define QuadSPI_RBSR_RDBFL_MASK 0x3F00u
#    define QuadSPI_RBSR_RDBFL_SHIFT 8u
#    define QuadSPI_RBSR_RDBFL_WIDTH 6u
#    define QuadSPI_RBSR_RDBFL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBSR_RDBFL_SHIFT)) & QuadSPI_RBSR_RDBFL_MASK)
#    define QuadSPI_RBSR_RDCTR_MASK 0xFFFF0000u
#    define QuadSPI_RBSR_RDCTR_SHIFT 16u
#    define QuadSPI_RBSR_RDCTR_WIDTH 16u
#    define QuadSPI_RBSR_RDCTR(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBSR_RDCTR_SHIFT)) & QuadSPI_RBSR_RDCTR_MASK)
/* RBCT Bit Fields */
#    define QuadSPI_RBCT_WMRK_MASK 0x1Fu
#    define QuadSPI_RBCT_WMRK_SHIFT 0u
#    define QuadSPI_RBCT_WMRK_WIDTH 5u
#    define QuadSPI_RBCT_WMRK(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBCT_WMRK_SHIFT)) & QuadSPI_RBCT_WMRK_MASK)
#    define QuadSPI_RBCT_RXBRD_MASK 0x100u
#    define QuadSPI_RBCT_RXBRD_SHIFT 8u
#    define QuadSPI_RBCT_RXBRD_WIDTH 1u
#    define QuadSPI_RBCT_RXBRD(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBCT_RXBRD_SHIFT)) & QuadSPI_RBCT_RXBRD_MASK)
/* TBSR Bit Fields */
#    define QuadSPI_TBSR_TRBFL_MASK 0x3F00u
#    define QuadSPI_TBSR_TRBFL_SHIFT 8u
#    define QuadSPI_TBSR_TRBFL_WIDTH 6u
#    define QuadSPI_TBSR_TRBFL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_TBSR_TRBFL_SHIFT)) & QuadSPI_TBSR_TRBFL_MASK)
#    define QuadSPI_TBSR_TRCTR_MASK 0xFFFF0000u
#    define QuadSPI_TBSR_TRCTR_SHIFT 16u
#    define QuadSPI_TBSR_TRCTR_WIDTH 16u
#    define QuadSPI_TBSR_TRCTR(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_TBSR_TRCTR_SHIFT)) & QuadSPI_TBSR_TRCTR_MASK)
/* TBDR Bit Fields */
#    define QuadSPI_TBDR_TXDATA_MASK 0xFFFFFFFFu
#    define QuadSPI_TBDR_TXDATA_SHIFT 0u
#    define QuadSPI_TBDR_TXDATA_WIDTH 32u
#    define QuadSPI_TBDR_TXDATA(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_TBDR_TXDATA_SHIFT)) & QuadSPI_TBDR_TXDATA_MASK)
/* TBCT Bit Fields */
#    define QuadSPI_TBCT_WMRK_MASK 0x1Fu
#    define QuadSPI_TBCT_WMRK_SHIFT 0u
#    define QuadSPI_TBCT_WMRK_WIDTH 5u
#    define QuadSPI_TBCT_WMRK(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_TBCT_WMRK_SHIFT)) & QuadSPI_TBCT_WMRK_MASK)
/* SR Bit Fields */
#    define QuadSPI_SR_BUSY_MASK 0x1u
#    define QuadSPI_SR_BUSY_SHIFT 0u
#    define QuadSPI_SR_BUSY_WIDTH 1u
#    define QuadSPI_SR_BUSY(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_BUSY_SHIFT)) & QuadSPI_SR_BUSY_MASK)
#    define QuadSPI_SR_IP_ACC_MASK 0x2u
#    define QuadSPI_SR_IP_ACC_SHIFT 1u
#    define QuadSPI_SR_IP_ACC_WIDTH 1u
#    define QuadSPI_SR_IP_ACC(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_IP_ACC_SHIFT)) & QuadSPI_SR_IP_ACC_MASK)
#    define QuadSPI_SR_AHB_ACC_MASK 0x4u
#    define QuadSPI_SR_AHB_ACC_SHIFT 2u
#    define QuadSPI_SR_AHB_ACC_WIDTH 1u
#    define QuadSPI_SR_AHB_ACC(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB_ACC_SHIFT)) & QuadSPI_SR_AHB_ACC_MASK)
#    define QuadSPI_SR_AHBGNT_MASK 0x20u
#    define QuadSPI_SR_AHBGNT_SHIFT 5u
#    define QuadSPI_SR_AHBGNT_WIDTH 1u
#    define QuadSPI_SR_AHBGNT(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHBGNT_SHIFT)) & QuadSPI_SR_AHBGNT_MASK)
#    define QuadSPI_SR_AHBTRN_MASK 0x40u
#    define QuadSPI_SR_AHBTRN_SHIFT 6u
#    define QuadSPI_SR_AHBTRN_WIDTH 1u
#    define QuadSPI_SR_AHBTRN(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHBTRN_SHIFT)) & QuadSPI_SR_AHBTRN_MASK)
#    define QuadSPI_SR_AHB0NE_MASK 0x80u
#    define QuadSPI_SR_AHB0NE_SHIFT 7u
#    define QuadSPI_SR_AHB0NE_WIDTH 1u
#    define QuadSPI_SR_AHB0NE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB0NE_SHIFT)) & QuadSPI_SR_AHB0NE_MASK)
#    define QuadSPI_SR_AHB1NE_MASK 0x100u
#    define QuadSPI_SR_AHB1NE_SHIFT 8u
#    define QuadSPI_SR_AHB1NE_WIDTH 1u
#    define QuadSPI_SR_AHB1NE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB1NE_SHIFT)) & QuadSPI_SR_AHB1NE_MASK)
#    define QuadSPI_SR_AHB2NE_MASK 0x200u
#    define QuadSPI_SR_AHB2NE_SHIFT 9u
#    define QuadSPI_SR_AHB2NE_WIDTH 1u
#    define QuadSPI_SR_AHB2NE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB2NE_SHIFT)) & QuadSPI_SR_AHB2NE_MASK)
#    define QuadSPI_SR_AHB3NE_MASK 0x400u
#    define QuadSPI_SR_AHB3NE_SHIFT 10u
#    define QuadSPI_SR_AHB3NE_WIDTH 1u
#    define QuadSPI_SR_AHB3NE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB3NE_SHIFT)) & QuadSPI_SR_AHB3NE_MASK)
#    define QuadSPI_SR_AHB0FUL_MASK 0x800u
#    define QuadSPI_SR_AHB0FUL_SHIFT 11u
#    define QuadSPI_SR_AHB0FUL_WIDTH 1u
#    define QuadSPI_SR_AHB0FUL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB0FUL_SHIFT)) & QuadSPI_SR_AHB0FUL_MASK)
#    define QuadSPI_SR_AHB1FUL_MASK 0x1000u
#    define QuadSPI_SR_AHB1FUL_SHIFT 12u
#    define QuadSPI_SR_AHB1FUL_WIDTH 1u
#    define QuadSPI_SR_AHB1FUL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB1FUL_SHIFT)) & QuadSPI_SR_AHB1FUL_MASK)
#    define QuadSPI_SR_AHB2FUL_MASK 0x2000u
#    define QuadSPI_SR_AHB2FUL_SHIFT 13u
#    define QuadSPI_SR_AHB2FUL_WIDTH 1u
#    define QuadSPI_SR_AHB2FUL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB2FUL_SHIFT)) & QuadSPI_SR_AHB2FUL_MASK)
#    define QuadSPI_SR_AHB3FUL_MASK 0x4000u
#    define QuadSPI_SR_AHB3FUL_SHIFT 14u
#    define QuadSPI_SR_AHB3FUL_WIDTH 1u
#    define QuadSPI_SR_AHB3FUL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_AHB3FUL_SHIFT)) & QuadSPI_SR_AHB3FUL_MASK)
#    define QuadSPI_SR_RXWE_MASK 0x10000u
#    define QuadSPI_SR_RXWE_SHIFT 16u
#    define QuadSPI_SR_RXWE_WIDTH 1u
#    define QuadSPI_SR_RXWE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_RXWE_SHIFT)) & QuadSPI_SR_RXWE_MASK)
#    define QuadSPI_SR_RXFULL_MASK 0x80000u
#    define QuadSPI_SR_RXFULL_SHIFT 19u
#    define QuadSPI_SR_RXFULL_WIDTH 1u
#    define QuadSPI_SR_RXFULL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_RXFULL_SHIFT)) & QuadSPI_SR_RXFULL_MASK)
#    define QuadSPI_SR_RXDMA_MASK 0x800000u
#    define QuadSPI_SR_RXDMA_SHIFT 23u
#    define QuadSPI_SR_RXDMA_WIDTH 1u
#    define QuadSPI_SR_RXDMA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_RXDMA_SHIFT)) & QuadSPI_SR_RXDMA_MASK)
#    define QuadSPI_SR_TXEDA_MASK 0x1000000u
#    define QuadSPI_SR_TXEDA_SHIFT 24u
#    define QuadSPI_SR_TXEDA_WIDTH 1u
#    define QuadSPI_SR_TXEDA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_TXEDA_SHIFT)) & QuadSPI_SR_TXEDA_MASK)
#    define QuadSPI_SR_TXWA_MASK 0x2000000u
#    define QuadSPI_SR_TXWA_SHIFT 25u
#    define QuadSPI_SR_TXWA_WIDTH 1u
#    define QuadSPI_SR_TXWA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_TXWA_SHIFT)) & QuadSPI_SR_TXWA_MASK)
#    define QuadSPI_SR_TXDMA_MASK 0x4000000u
#    define QuadSPI_SR_TXDMA_SHIFT 26u
#    define QuadSPI_SR_TXDMA_WIDTH 1u
#    define QuadSPI_SR_TXDMA(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_TXDMA_SHIFT)) & QuadSPI_SR_TXDMA_MASK)
#    define QuadSPI_SR_TXFULL_MASK 0x8000000u
#    define QuadSPI_SR_TXFULL_SHIFT 27u
#    define QuadSPI_SR_TXFULL_WIDTH 1u
#    define QuadSPI_SR_TXFULL(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_SR_TXFULL_SHIFT)) & QuadSPI_SR_TXFULL_MASK)
/* FR Bit Fields */
#    define QuadSPI_FR_TFF_MASK 0x1u
#    define QuadSPI_FR_TFF_SHIFT 0u
#    define QuadSPI_FR_TFF_WIDTH 1u
#    define QuadSPI_FR_TFF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_TFF_SHIFT)) & QuadSPI_FR_TFF_MASK)
#    define QuadSPI_FR_IPGEF_MASK 0x10u
#    define QuadSPI_FR_IPGEF_SHIFT 4u
#    define QuadSPI_FR_IPGEF_WIDTH 1u
#    define QuadSPI_FR_IPGEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_IPGEF_SHIFT)) & QuadSPI_FR_IPGEF_MASK)
#    define QuadSPI_FR_IPIEF_MASK 0x40u
#    define QuadSPI_FR_IPIEF_SHIFT 6u
#    define QuadSPI_FR_IPIEF_WIDTH 1u
#    define QuadSPI_FR_IPIEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_IPIEF_SHIFT)) & QuadSPI_FR_IPIEF_MASK)
#    define QuadSPI_FR_IPAEF_MASK 0x80u
#    define QuadSPI_FR_IPAEF_SHIFT 7u
#    define QuadSPI_FR_IPAEF_WIDTH 1u
#    define QuadSPI_FR_IPAEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_IPAEF_SHIFT)) & QuadSPI_FR_IPAEF_MASK)
#    define QuadSPI_FR_ABOF_MASK 0x1000u
#    define QuadSPI_FR_ABOF_SHIFT 12u
#    define QuadSPI_FR_ABOF_WIDTH 1u
#    define QuadSPI_FR_ABOF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_ABOF_SHIFT)) & QuadSPI_FR_ABOF_MASK)
#    define QuadSPI_FR_AIBSEF_MASK 0x2000u
#    define QuadSPI_FR_AIBSEF_SHIFT 13u
#    define QuadSPI_FR_AIBSEF_WIDTH 1u
#    define QuadSPI_FR_AIBSEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_AIBSEF_SHIFT)) & QuadSPI_FR_AIBSEF_MASK)
#    define QuadSPI_FR_AITEF_MASK 0x4000u
#    define QuadSPI_FR_AITEF_SHIFT 14u
#    define QuadSPI_FR_AITEF_WIDTH 1u
#    define QuadSPI_FR_AITEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_AITEF_SHIFT)) & QuadSPI_FR_AITEF_MASK)
