OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define QuadSPI_FR_ABSEF_MASK 0x8000u
#    define QuadSPI_FR_ABSEF_SHIFT 15u
#    define QuadSPI_FR_ABSEF_WIDTH 1u
#    define QuadSPI_FR_ABSEF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_ABSEF_SHIFT)) & QuadSPI_FR_ABSEF_MASK)
#    define QuadSPI_FR_RBDF_MASK 0x10000u
#    define QuadSPI_FR_RBDF_SHIFT 16u
#    define QuadSPI_FR_RBDF_WIDTH 1u
#    define QuadSPI_FR_RBDF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_RBDF_SHIFT)) & QuadSPI_FR_RBDF_MASK)
#    define QuadSPI_FR_RBOF_MASK 0x20000u
#    define QuadSPI_FR_RBOF_SHIFT 17u
#    define QuadSPI_FR_RBOF_WIDTH 1u
#    define QuadSPI_FR_RBOF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_RBOF_SHIFT)) & QuadSPI_FR_RBOF_MASK)
#    define QuadSPI_FR_ILLINE_MASK 0x800000u
#    define QuadSPI_FR_ILLINE_SHIFT 23u
#    define QuadSPI_FR_ILLINE_WIDTH 1u
#    define QuadSPI_FR_ILLINE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_ILLINE_SHIFT)) & QuadSPI_FR_ILLINE_MASK)
#    define QuadSPI_FR_TBUF_MASK 0x4000000u
#    define QuadSPI_FR_TBUF_SHIFT 26u
#    define QuadSPI_FR_TBUF_WIDTH 1u
#    define QuadSPI_FR_TBUF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_TBUF_SHIFT)) & QuadSPI_FR_TBUF_MASK)
#    define QuadSPI_FR_TBFF_MASK 0x8000000u
#    define QuadSPI_FR_TBFF_SHIFT 27u
#    define QuadSPI_FR_TBFF_WIDTH 1u
#    define QuadSPI_FR_TBFF(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_FR_TBFF_SHIFT)) & QuadSPI_FR_TBFF_MASK)
/* RSER Bit Fields */
#    define QuadSPI_RSER_TFIE_MASK 0x1u
#    define QuadSPI_RSER_TFIE_SHIFT 0u
#    define QuadSPI_RSER_TFIE_WIDTH 1u
#    define QuadSPI_RSER_TFIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_TFIE_SHIFT)) & QuadSPI_RSER_TFIE_MASK)
#    define QuadSPI_RSER_IPGEIE_MASK 0x10u
#    define QuadSPI_RSER_IPGEIE_SHIFT 4u
#    define QuadSPI_RSER_IPGEIE_WIDTH 1u
#    define QuadSPI_RSER_IPGEIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_IPGEIE_SHIFT)) & QuadSPI_RSER_IPGEIE_MASK)
#    define QuadSPI_RSER_IPIEIE_MASK 0x40u
#    define QuadSPI_RSER_IPIEIE_SHIFT 6u
#    define QuadSPI_RSER_IPIEIE_WIDTH 1u
#    define QuadSPI_RSER_IPIEIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_IPIEIE_SHIFT)) & QuadSPI_RSER_IPIEIE_MASK)
#    define QuadSPI_RSER_IPAEIE_MASK 0x80u
#    define QuadSPI_RSER_IPAEIE_SHIFT 7u
#    define QuadSPI_RSER_IPAEIE_WIDTH 1u
#    define QuadSPI_RSER_IPAEIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_IPAEIE_SHIFT)) & QuadSPI_RSER_IPAEIE_MASK)
#    define QuadSPI_RSER_ABOIE_MASK 0x1000u
#    define QuadSPI_RSER_ABOIE_SHIFT 12u
#    define QuadSPI_RSER_ABOIE_WIDTH 1u
#    define QuadSPI_RSER_ABOIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_ABOIE_SHIFT)) & QuadSPI_RSER_ABOIE_MASK)
#    define QuadSPI_RSER_AIBSIE_MASK 0x2000u
#    define QuadSPI_RSER_AIBSIE_SHIFT 13u
#    define QuadSPI_RSER_AIBSIE_WIDTH 1u
#    define QuadSPI_RSER_AIBSIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_AIBSIE_SHIFT)) & QuadSPI_RSER_AIBSIE_MASK)
#    define QuadSPI_RSER_AITIE_MASK 0x4000u
#    define QuadSPI_RSER_AITIE_SHIFT 14u
#    define QuadSPI_RSER_AITIE_WIDTH 1u
#    define QuadSPI_RSER_AITIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_AITIE_SHIFT)) & QuadSPI_RSER_AITIE_MASK)
#    define QuadSPI_RSER_ABSEIE_MASK 0x8000u
#    define QuadSPI_RSER_ABSEIE_SHIFT 15u
#    define QuadSPI_RSER_ABSEIE_WIDTH 1u
#    define QuadSPI_RSER_ABSEIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_ABSEIE_SHIFT)) & QuadSPI_RSER_ABSEIE_MASK)
#    define QuadSPI_RSER_RBDIE_MASK 0x10000u
#    define QuadSPI_RSER_RBDIE_SHIFT 16u
#    define QuadSPI_RSER_RBDIE_WIDTH 1u
#    define QuadSPI_RSER_RBDIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_RBDIE_SHIFT)) & QuadSPI_RSER_RBDIE_MASK)
#    define QuadSPI_RSER_RBOIE_MASK 0x20000u
#    define QuadSPI_RSER_RBOIE_SHIFT 17u
#    define QuadSPI_RSER_RBOIE_WIDTH 1u
#    define QuadSPI_RSER_RBOIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_RBOIE_SHIFT)) & QuadSPI_RSER_RBOIE_MASK)
#    define QuadSPI_RSER_RBDDE_MASK 0x200000u
#    define QuadSPI_RSER_RBDDE_SHIFT 21u
#    define QuadSPI_RSER_RBDDE_WIDTH 1u
#    define QuadSPI_RSER_RBDDE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_RBDDE_SHIFT)) & QuadSPI_RSER_RBDDE_MASK)
#    define QuadSPI_RSER_ILLINIE_MASK 0x800000u
#    define QuadSPI_RSER_ILLINIE_SHIFT 23u
#    define QuadSPI_RSER_ILLINIE_WIDTH 1u
#    define QuadSPI_RSER_ILLINIE(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_ILLINIE_SHIFT)) & QuadSPI_RSER_ILLINIE_MASK)
#    define QuadSPI_RSER_TBFDE_MASK 0x2000000u
#    define QuadSPI_RSER_TBFDE_SHIFT 25u
#    define QuadSPI_RSER_TBFDE_WIDTH 1u
#    define QuadSPI_RSER_TBFDE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_TBFDE_SHIFT)) & QuadSPI_RSER_TBFDE_MASK)
#    define QuadSPI_RSER_TBUIE_MASK 0x4000000u
#    define QuadSPI_RSER_TBUIE_SHIFT 26u
#    define QuadSPI_RSER_TBUIE_WIDTH 1u
#    define QuadSPI_RSER_TBUIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_TBUIE_SHIFT)) & QuadSPI_RSER_TBUIE_MASK)
#    define QuadSPI_RSER_TBFIE_MASK 0x8000000u
#    define QuadSPI_RSER_TBFIE_SHIFT 27u
#    define QuadSPI_RSER_TBFIE_WIDTH 1u
#    define QuadSPI_RSER_TBFIE(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_RSER_TBFIE_SHIFT)) & QuadSPI_RSER_TBFIE_MASK)
/* SPNDST Bit Fields */
#    define QuadSPI_SPNDST_SUSPND_MASK 0x1u
#    define QuadSPI_SPNDST_SUSPND_SHIFT 0u
#    define QuadSPI_SPNDST_SUSPND_WIDTH 1u
#    define QuadSPI_SPNDST_SUSPND(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPNDST_SUSPND_SHIFT)) & QuadSPI_SPNDST_SUSPND_MASK)
#    define QuadSPI_SPNDST_SPDBUF_MASK 0xC0u
#    define QuadSPI_SPNDST_SPDBUF_SHIFT 6u
#    define QuadSPI_SPNDST_SPDBUF_WIDTH 2u
#    define QuadSPI_SPNDST_SPDBUF(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPNDST_SPDBUF_SHIFT)) & QuadSPI_SPNDST_SPDBUF_MASK)
#    define QuadSPI_SPNDST_DATLFT_MASK 0xFE00u
#    define QuadSPI_SPNDST_DATLFT_SHIFT 9u
#    define QuadSPI_SPNDST_DATLFT_WIDTH 7u
#    define QuadSPI_SPNDST_DATLFT(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPNDST_DATLFT_SHIFT)) & QuadSPI_SPNDST_DATLFT_MASK)
/* SPTRCLR Bit Fields */
#    define QuadSPI_SPTRCLR_BFPTRC_MASK 0x1u
#    define QuadSPI_SPTRCLR_BFPTRC_SHIFT 0u
#    define QuadSPI_SPTRCLR_BFPTRC_WIDTH 1u
#    define QuadSPI_SPTRCLR_BFPTRC(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPTRCLR_BFPTRC_SHIFT)) & QuadSPI_SPTRCLR_BFPTRC_MASK)
#    define QuadSPI_SPTRCLR_IPPTRC_MASK 0x100u
#    define QuadSPI_SPTRCLR_IPPTRC_SHIFT 8u
#    define QuadSPI_SPTRCLR_IPPTRC_WIDTH 1u
#    define QuadSPI_SPTRCLR_IPPTRC(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPTRCLR_IPPTRC_SHIFT)) & QuadSPI_SPTRCLR_IPPTRC_MASK)
/* SFA1AD Bit Fields */
#    define QuadSPI_SFA1AD_TPADA1_MASK 0xFFFFFC00u
#    define QuadSPI_SFA1AD_TPADA1_SHIFT 10u
#    define QuadSPI_SFA1AD_TPADA1_WIDTH 22u
#    define QuadSPI_SFA1AD_TPADA1(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA1AD_TPADA1_SHIFT)) & QuadSPI_SFA1AD_TPADA1_MASK)
/* SFA2AD Bit Fields */
#    define QuadSPI_SFA2AD_TPADA2_MASK 0xFFFFFC00u
#    define QuadSPI_SFA2AD_TPADA2_SHIFT 10u
#    define QuadSPI_SFA2AD_TPADA2_WIDTH 22u
#    define QuadSPI_SFA2AD_TPADA2(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA2AD_TPADA2_SHIFT)) & QuadSPI_SFA2AD_TPADA2_MASK)
/* SFB1AD Bit Fields */
#    define QuadSPI_SFB1AD_TPADB1_MASK 0xFFFFFC00u
#    define QuadSPI_SFB1AD_TPADB1_SHIFT 10u
#    define QuadSPI_SFB1AD_TPADB1_WIDTH 22u
#    define QuadSPI_SFB1AD_TPADB1(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFB1AD_TPADB1_SHIFT)) & QuadSPI_SFB1AD_TPADB1_MASK)
/* SFB2AD Bit Fields */
#    define QuadSPI_SFB2AD_TPADB2_MASK 0xFFFFFC00u
#    define QuadSPI_SFB2AD_TPADB2_SHIFT 10u
#    define QuadSPI_SFB2AD_TPADB2_WIDTH 22u
#    define QuadSPI_SFB2AD_TPADB2(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFB2AD_TPADB2_SHIFT)) & QuadSPI_SFB2AD_TPADB2_MASK)
/* RBDR Bit Fields */
#    define QuadSPI_RBDR_RXDATA_MASK 0xFFFFFFFFu
#    define QuadSPI_RBDR_RXDATA_SHIFT 0u
#    define QuadSPI_RBDR_RXDATA_WIDTH 32u
#    define QuadSPI_RBDR_RXDATA(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBDR_RXDATA_SHIFT)) & QuadSPI_RBDR_RXDATA_MASK)
/* LUTKEY Bit Fields */
#    define QuadSPI_LUTKEY_KEY_MASK 0xFFFFFFFFu
#    define QuadSPI_LUTKEY_KEY_SHIFT 0u
#    define QuadSPI_LUTKEY_KEY_WIDTH 32u
#    define QuadSPI_LUTKEY_KEY(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUTKEY_KEY_SHIFT)) & QuadSPI_LUTKEY_KEY_MASK)
/* LCKCR Bit Fields */
#    define QuadSPI_LCKCR_LOCK_MASK 0x1u
#    define QuadSPI_LCKCR_LOCK_SHIFT 0u
#    define QuadSPI_LCKCR_LOCK_WIDTH 1u
#    define QuadSPI_LCKCR_LOCK(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_LOCK_SHIFT)) & QuadSPI_LCKCR_LOCK_MASK)
#    define QuadSPI_LCKCR_UNLOCK_MASK 0x2u
#    define QuadSPI_LCKCR_UNLOCK_SHIFT 1u
#    define QuadSPI_LCKCR_UNLOCK_WIDTH 1u
#    define QuadSPI_LCKCR_UNLOCK(x) \
        (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_UNLOCK_SHIFT)) & QuadSPI_LCKCR_UNLOCK_MASK)
/* LUT Bit Fields */
#    define QuadSPI_LUT_OPRND0_MASK 0xFFu
#    define QuadSPI_LUT_OPRND0_SHIFT 0u
#    define QuadSPI_LUT_OPRND0_WIDTH 8u
#    define QuadSPI_LUT_OPRND0(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND0_SHIFT)) & QuadSPI_LUT_OPRND0_MASK)
#    define QuadSPI_LUT_PAD0_MASK 0x300u
#    define QuadSPI_LUT_PAD0_SHIFT 8u
#    define QuadSPI_LUT_PAD0_WIDTH 2u
#    define QuadSPI_LUT_PAD0(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD0_SHIFT)) & QuadSPI_LUT_PAD0_MASK)
#    define QuadSPI_LUT_INSTR0_MASK 0xFC00u
#    define QuadSPI_LUT_INSTR0_SHIFT 10u
#    define QuadSPI_LUT_INSTR0_WIDTH 6u
#    define QuadSPI_LUT_INSTR0(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR0_SHIFT)) & QuadSPI_LUT_INSTR0_MASK)
#    define QuadSPI_LUT_OPRND1_MASK 0xFF0000u
#    define QuadSPI_LUT_OPRND1_SHIFT 16u
#    define QuadSPI_LUT_OPRND1_WIDTH 8u
#    define QuadSPI_LUT_OPRND1(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND1_SHIFT)) & QuadSPI_LUT_OPRND1_MASK)
#    define QuadSPI_LUT_PAD1_MASK 0x3000000u
#    define QuadSPI_LUT_PAD1_SHIFT 24u
#    define QuadSPI_LUT_PAD1_WIDTH 2u
#    define QuadSPI_LUT_PAD1(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD1_SHIFT)) & QuadSPI_LUT_PAD1_MASK)
#    define QuadSPI_LUT_INSTR1_MASK 0xFC000000u
#    define QuadSPI_LUT_INSTR1_SHIFT 26u
#    define QuadSPI_LUT_INSTR1_WIDTH 6u
#    define QuadSPI_LUT_INSTR1(x) (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR1_SHIFT)) & QuadSPI_LUT_INSTR1_MASK)

/*!
 * @}
 */ /* end of group QuadSPI_Register_Masks */

/*!
 * @}
 */ /* end of group QuadSPI_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- RCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Peripheral_Access_Layer RCM Peripheral Access Layer
 * @{
 */

/** RCM - Size of Registers Arrays */

/** RCM - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    __I uint32_t SRS;   /**< System Reset Status Register, offset: 0x8 */
    __IO uint32_t RPC;  /**< Reset Pin Control register, offset: 0xC */
    uint8_t       RESERVED_0[8];
    __IO uint32_t SSRS; /**< Sticky System Reset Status Register, offset: 0x18 */
    __IO uint32_t SRIE; /**< System Reset Interrupt Enable Register, offset: 0x1C */
} RCM_Type, *RCM_MemMapPtr;

