OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** Number of instances of the RCM module. */
#    define RCM_INSTANCE_COUNT (1u)

/* RCM - Peripheral instance base addresses */
/** Peripheral RCM base address */
#    define RCM_BASE (0x4007F000u)
/** Peripheral RCM base pointer */
#    define RCM ((RCM_Type*) RCM_BASE)
/** Array initializer of RCM peripheral base addresses */
#    define RCM_BASE_ADDRS \
        {                  \
            RCM_BASE       \
        }
/** Array initializer of RCM peripheral base pointers */
#    define RCM_BASE_PTRS \
        {                 \
            RCM           \
        }
/** Number of interrupt vector arrays for the RCM module. */
#    define RCM_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the RCM module. */
#    define RCM_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the RCM peripheral type */
#    define RCM_IRQS \
        {            \
            RCM_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- RCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Masks RCM Register Masks
 * @{
 */

/* VERID Bit Fields */
#    define RCM_VERID_FEATURE_MASK 0xFFFFu
#    define RCM_VERID_FEATURE_SHIFT 0u
#    define RCM_VERID_FEATURE_WIDTH 16u
#    define RCM_VERID_FEATURE(x) (((uint32_t)(((uint32_t)(x)) << RCM_VERID_FEATURE_SHIFT)) & RCM_VERID_FEATURE_MASK)
#    define RCM_VERID_MINOR_MASK 0xFF0000u
#    define RCM_VERID_MINOR_SHIFT 16u
#    define RCM_VERID_MINOR_WIDTH 8u
#    define RCM_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << RCM_VERID_MINOR_SHIFT)) & RCM_VERID_MINOR_MASK)
#    define RCM_VERID_MAJOR_MASK 0xFF000000u
#    define RCM_VERID_MAJOR_SHIFT 24u
#    define RCM_VERID_MAJOR_WIDTH 8u
#    define RCM_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << RCM_VERID_MAJOR_SHIFT)) & RCM_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define RCM_PARAM_EWAKEUP_MASK 0x1u
#    define RCM_PARAM_EWAKEUP_SHIFT 0u
#    define RCM_PARAM_EWAKEUP_WIDTH 1u
#    define RCM_PARAM_EWAKEUP(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EWAKEUP_SHIFT)) & RCM_PARAM_EWAKEUP_MASK)
#    define RCM_PARAM_ELVD_MASK 0x2u
#    define RCM_PARAM_ELVD_SHIFT 1u
#    define RCM_PARAM_ELVD_WIDTH 1u
#    define RCM_PARAM_ELVD(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ELVD_SHIFT)) & RCM_PARAM_ELVD_MASK)
#    define RCM_PARAM_ELOC_MASK 0x4u
#    define RCM_PARAM_ELOC_SHIFT 2u
#    define RCM_PARAM_ELOC_WIDTH 1u
#    define RCM_PARAM_ELOC(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ELOC_SHIFT)) & RCM_PARAM_ELOC_MASK)
#    define RCM_PARAM_ELOL_MASK 0x8u
#    define RCM_PARAM_ELOL_SHIFT 3u
#    define RCM_PARAM_ELOL_WIDTH 1u
#    define RCM_PARAM_ELOL(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ELOL_SHIFT)) & RCM_PARAM_ELOL_MASK)
#    define RCM_PARAM_EWDOG_MASK 0x20u
#    define RCM_PARAM_EWDOG_SHIFT 5u
#    define RCM_PARAM_EWDOG_WIDTH 1u
#    define RCM_PARAM_EWDOG(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EWDOG_SHIFT)) & RCM_PARAM_EWDOG_MASK)
#    define RCM_PARAM_EPIN_MASK 0x40u
#    define RCM_PARAM_EPIN_SHIFT 6u
#    define RCM_PARAM_EPIN_WIDTH 1u
#    define RCM_PARAM_EPIN(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EPIN_SHIFT)) & RCM_PARAM_EPIN_MASK)
#    define RCM_PARAM_EPOR_MASK 0x80u
#    define RCM_PARAM_EPOR_SHIFT 7u
#    define RCM_PARAM_EPOR_WIDTH 1u
#    define RCM_PARAM_EPOR(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EPOR_SHIFT)) & RCM_PARAM_EPOR_MASK)
#    define RCM_PARAM_EJTAG_MASK 0x100u
#    define RCM_PARAM_EJTAG_SHIFT 8u
#    define RCM_PARAM_EJTAG_WIDTH 1u
#    define RCM_PARAM_EJTAG(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EJTAG_SHIFT)) & RCM_PARAM_EJTAG_MASK)
#    define RCM_PARAM_ELOCKUP_MASK 0x200u
#    define RCM_PARAM_ELOCKUP_SHIFT 9u
#    define RCM_PARAM_ELOCKUP_WIDTH 1u
#    define RCM_PARAM_ELOCKUP(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ELOCKUP_SHIFT)) & RCM_PARAM_ELOCKUP_MASK)
#    define RCM_PARAM_ESW_MASK 0x400u
#    define RCM_PARAM_ESW_SHIFT 10u
#    define RCM_PARAM_ESW_WIDTH 1u
#    define RCM_PARAM_ESW(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ESW_SHIFT)) & RCM_PARAM_ESW_MASK)
#    define RCM_PARAM_EMDM_AP_MASK 0x800u
#    define RCM_PARAM_EMDM_AP_SHIFT 11u
#    define RCM_PARAM_EMDM_AP_WIDTH 1u
#    define RCM_PARAM_EMDM_AP(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_EMDM_AP_SHIFT)) & RCM_PARAM_EMDM_AP_MASK)
#    define RCM_PARAM_ESACKERR_MASK 0x2000u
#    define RCM_PARAM_ESACKERR_SHIFT 13u
#    define RCM_PARAM_ESACKERR_WIDTH 1u
#    define RCM_PARAM_ESACKERR(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ESACKERR_SHIFT)) & RCM_PARAM_ESACKERR_MASK)
#    define RCM_PARAM_ETAMPER_MASK 0x8000u
#    define RCM_PARAM_ETAMPER_SHIFT 15u
#    define RCM_PARAM_ETAMPER_WIDTH 1u
#    define RCM_PARAM_ETAMPER(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ETAMPER_SHIFT)) & RCM_PARAM_ETAMPER_MASK)
#    define RCM_PARAM_ECORE1_MASK 0x10000u
#    define RCM_PARAM_ECORE1_SHIFT 16u
#    define RCM_PARAM_ECORE1_WIDTH 1u
#    define RCM_PARAM_ECORE1(x) (((uint32_t)(((uint32_t)(x)) << RCM_PARAM_ECORE1_SHIFT)) & RCM_PARAM_ECORE1_MASK)
/* SRS Bit Fields */
#    define RCM_SRS_LVD_MASK 0x2u
#    define RCM_SRS_LVD_SHIFT 1u
#    define RCM_SRS_LVD_WIDTH 1u
#    define RCM_SRS_LVD(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_LVD_SHIFT)) & RCM_SRS_LVD_MASK)
#    define RCM_SRS_LOC_MASK 0x4u
#    define RCM_SRS_LOC_SHIFT 2u
#    define RCM_SRS_LOC_WIDTH 1u
#    define RCM_SRS_LOC(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_LOC_SHIFT)) & RCM_SRS_LOC_MASK)
#    define RCM_SRS_LOL_MASK 0x8u
#    define RCM_SRS_LOL_SHIFT 3u
#    define RCM_SRS_LOL_WIDTH 1u
#    define RCM_SRS_LOL(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_LOL_SHIFT)) & RCM_SRS_LOL_MASK)
#    define RCM_SRS_WDOG_MASK 0x20u
#    define RCM_SRS_WDOG_SHIFT 5u
#    define RCM_SRS_WDOG_WIDTH 1u
#    define RCM_SRS_WDOG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_WDOG_SHIFT)) & RCM_SRS_WDOG_MASK)
#    define RCM_SRS_PIN_MASK 0x40u
#    define RCM_SRS_PIN_SHIFT 6u
#    define RCM_SRS_PIN_WIDTH 1u
#    define RCM_SRS_PIN(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_PIN_SHIFT)) & RCM_SRS_PIN_MASK)
#    define RCM_SRS_POR_MASK 0x80u
#    define RCM_SRS_POR_SHIFT 7u
#    define RCM_SRS_POR_WIDTH 1u
#    define RCM_SRS_POR(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_POR_SHIFT)) & RCM_SRS_POR_MASK)
#    define RCM_SRS_JTAG_MASK 0x100u
#    define RCM_SRS_JTAG_SHIFT 8u
#    define RCM_SRS_JTAG_WIDTH 1u
#    define RCM_SRS_JTAG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_JTAG_SHIFT)) & RCM_SRS_JTAG_MASK)
#    define RCM_SRS_LOCKUP_MASK 0x200u
#    define RCM_SRS_LOCKUP_SHIFT 9u
#    define RCM_SRS_LOCKUP_WIDTH 1u
#    define RCM_SRS_LOCKUP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_LOCKUP_SHIFT)) & RCM_SRS_LOCKUP_MASK)
#    define RCM_SRS_SW_MASK 0x400u
#    define RCM_SRS_SW_SHIFT 10u
#    define RCM_SRS_SW_WIDTH 1u
#    define RCM_SRS_SW(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_SW_SHIFT)) & RCM_SRS_SW_MASK)
#    define RCM_SRS_MDM_AP_MASK 0x800u
#    define RCM_SRS_MDM_AP_SHIFT 11u
#    define RCM_SRS_MDM_AP_WIDTH 1u
#    define RCM_SRS_MDM_AP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_MDM_AP_SHIFT)) & RCM_SRS_MDM_AP_MASK)
#    define RCM_SRS_SACKERR_MASK 0x2000u
#    define RCM_SRS_SACKERR_SHIFT 13u
#    define RCM_SRS_SACKERR_WIDTH 1u
#    define RCM_SRS_SACKERR(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRS_SACKERR_SHIFT)) & RCM_SRS_SACKERR_MASK)
/* RPC Bit Fields */
#    define RCM_RPC_RSTFLTSRW_MASK 0x3u
#    define RCM_RPC_RSTFLTSRW_SHIFT 0u
#    define RCM_RPC_RSTFLTSRW_WIDTH 2u
#    define RCM_RPC_RSTFLTSRW(x) (((uint32_t)(((uint32_t)(x)) << RCM_RPC_RSTFLTSRW_SHIFT)) & RCM_RPC_RSTFLTSRW_MASK)
#    define RCM_RPC_RSTFLTSS_MASK 0x4u
#    define RCM_RPC_RSTFLTSS_SHIFT 2u
#    define RCM_RPC_RSTFLTSS_WIDTH 1u
#    define RCM_RPC_RSTFLTSS(x) (((uint32_t)(((uint32_t)(x)) << RCM_RPC_RSTFLTSS_SHIFT)) & RCM_RPC_RSTFLTSS_MASK)
#    define RCM_RPC_RSTFLTSEL_MASK 0x1F00u
#    define RCM_RPC_RSTFLTSEL_SHIFT 8u
#    define RCM_RPC_RSTFLTSEL_WIDTH 5u
#    define RCM_RPC_RSTFLTSEL(x) (((uint32_t)(((uint32_t)(x)) << RCM_RPC_RSTFLTSEL_SHIFT)) & RCM_RPC_RSTFLTSEL_MASK)
/* SSRS Bit Fields */
#    define RCM_SSRS_SLVD_MASK 0x2u
#    define RCM_SSRS_SLVD_SHIFT 1u
#    define RCM_SSRS_SLVD_WIDTH 1u
#    define RCM_SSRS_SLVD(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SLVD_SHIFT)) & RCM_SSRS_SLVD_MASK)
#    define RCM_SSRS_SLOC_MASK 0x4u
#    define RCM_SSRS_SLOC_SHIFT 2u
#    define RCM_SSRS_SLOC_WIDTH 1u
#    define RCM_SSRS_SLOC(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SLOC_SHIFT)) & RCM_SSRS_SLOC_MASK)
#    define RCM_SSRS_SLOL_MASK 0x8u
#    define RCM_SSRS_SLOL_SHIFT 3u
#    define RCM_SSRS_SLOL_WIDTH 1u
#    define RCM_SSRS_SLOL(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SLOL_SHIFT)) & RCM_SSRS_SLOL_MASK)
#    define RCM_SSRS_SWDOG_MASK 0x20u
#    define RCM_SSRS_SWDOG_SHIFT 5u
#    define RCM_SSRS_SWDOG_WIDTH 1u
#    define RCM_SSRS_SWDOG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SWDOG_SHIFT)) & RCM_SSRS_SWDOG_MASK)
#    define RCM_SSRS_SPIN_MASK 0x40u
#    define RCM_SSRS_SPIN_SHIFT 6u
#    define RCM_SSRS_SPIN_WIDTH 1u
#    define RCM_SSRS_SPIN(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SPIN_SHIFT)) & RCM_SSRS_SPIN_MASK)
#    define RCM_SSRS_SPOR_MASK 0x80u
#    define RCM_SSRS_SPOR_SHIFT 7u
#    define RCM_SSRS_SPOR_WIDTH 1u
#    define RCM_SSRS_SPOR(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SPOR_SHIFT)) & RCM_SSRS_SPOR_MASK)
#    define RCM_SSRS_SJTAG_MASK 0x100u
#    define RCM_SSRS_SJTAG_SHIFT 8u
#    define RCM_SSRS_SJTAG_WIDTH 1u
#    define RCM_SSRS_SJTAG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SJTAG_SHIFT)) & RCM_SSRS_SJTAG_MASK)
#    define RCM_SSRS_SLOCKUP_MASK 0x200u
#    define RCM_SSRS_SLOCKUP_SHIFT 9u
#    define RCM_SSRS_SLOCKUP_WIDTH 1u
#    define RCM_SSRS_SLOCKUP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SLOCKUP_SHIFT)) & RCM_SSRS_SLOCKUP_MASK)
#    define RCM_SSRS_SSW_MASK 0x400u
#    define RCM_SSRS_SSW_SHIFT 10u
#    define RCM_SSRS_SSW_WIDTH 1u
#    define RCM_SSRS_SSW(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SSW_SHIFT)) & RCM_SSRS_SSW_MASK)
#    define RCM_SSRS_SMDM_AP_MASK 0x800u
#    define RCM_SSRS_SMDM_AP_SHIFT 11u
#    define RCM_SSRS_SMDM_AP_WIDTH 1u
#    define RCM_SSRS_SMDM_AP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SMDM_AP_SHIFT)) & RCM_SSRS_SMDM_AP_MASK)
#    define RCM_SSRS_SSACKERR_MASK 0x2000u
#    define RCM_SSRS_SSACKERR_SHIFT 13u
#    define RCM_SSRS_SSACKERR_WIDTH 1u
#    define RCM_SSRS_SSACKERR(x) (((uint32_t)(((uint32_t)(x)) << RCM_SSRS_SSACKERR_SHIFT)) & RCM_SSRS_SSACKERR_MASK)
/* SRIE Bit Fields */
#    define RCM_SRIE_DELAY_MASK 0x3u
#    define RCM_SRIE_DELAY_SHIFT 0u
#    define RCM_SRIE_DELAY_WIDTH 2u
#    define RCM_SRIE_DELAY(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_DELAY_SHIFT)) & RCM_SRIE_DELAY_MASK)
#    define RCM_SRIE_LOC_MASK 0x4u
#    define RCM_SRIE_LOC_SHIFT 2u
#    define RCM_SRIE_LOC_WIDTH 1u
#    define RCM_SRIE_LOC(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_LOC_SHIFT)) & RCM_SRIE_LOC_MASK)
#    define RCM_SRIE_LOL_MASK 0x8u
#    define RCM_SRIE_LOL_SHIFT 3u
#    define RCM_SRIE_LOL_WIDTH 1u
#    define RCM_SRIE_LOL(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_LOL_SHIFT)) & RCM_SRIE_LOL_MASK)
#    define RCM_SRIE_WDOG_MASK 0x20u
#    define RCM_SRIE_WDOG_SHIFT 5u
#    define RCM_SRIE_WDOG_WIDTH 1u
#    define RCM_SRIE_WDOG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_WDOG_SHIFT)) & RCM_SRIE_WDOG_MASK)
#    define RCM_SRIE_PIN_MASK 0x40u
#    define RCM_SRIE_PIN_SHIFT 6u
#    define RCM_SRIE_PIN_WIDTH 1u
#    define RCM_SRIE_PIN(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_PIN_SHIFT)) & RCM_SRIE_PIN_MASK)
#    define RCM_SRIE_GIE_MASK 0x80u
#    define RCM_SRIE_GIE_SHIFT 7u
#    define RCM_SRIE_GIE_WIDTH 1u
#    define RCM_SRIE_GIE(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_GIE_SHIFT)) & RCM_SRIE_GIE_MASK)
#    define RCM_SRIE_JTAG_MASK 0x100u
#    define RCM_SRIE_JTAG_SHIFT 8u
#    define RCM_SRIE_JTAG_WIDTH 1u
#    define RCM_SRIE_JTAG(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_JTAG_SHIFT)) & RCM_SRIE_JTAG_MASK)
#    define RCM_SRIE_LOCKUP_MASK 0x200u
#    define RCM_SRIE_LOCKUP_SHIFT 9u
#    define RCM_SRIE_LOCKUP_WIDTH 1u
#    define RCM_SRIE_LOCKUP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_LOCKUP_SHIFT)) & RCM_SRIE_LOCKUP_MASK)
#    define RCM_SRIE_SW_MASK 0x400u
#    define RCM_SRIE_SW_SHIFT 10u
#    define RCM_SRIE_SW_WIDTH 1u
#    define RCM_SRIE_SW(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_SW_SHIFT)) & RCM_SRIE_SW_MASK)
#    define RCM_SRIE_MDM_AP_MASK 0x800u
#    define RCM_SRIE_MDM_AP_SHIFT 11u
#    define RCM_SRIE_MDM_AP_WIDTH 1u
#    define RCM_SRIE_MDM_AP(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_MDM_AP_SHIFT)) & RCM_SRIE_MDM_AP_MASK)
#    define RCM_SRIE_SACKERR_MASK 0x2000u
#    define RCM_SRIE_SACKERR_SHIFT 13u
#    define RCM_SRIE_SACKERR_WIDTH 1u
#    define RCM_SRIE_SACKERR(x) (((uint32_t)(((uint32_t)(x)) << RCM_SRIE_SACKERR_SHIFT)) & RCM_SRIE_SACKERR_MASK)

/*!
 * @}
 */ /* end of group RCM_Register_Masks */

/*!
 * @}
 */ /* end of group RCM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- RTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTC_Peripheral_Access_Layer RTC Peripheral Access Layer
 * @{
 */

/** RTC - Size of Registers Arrays */

/** RTC - Register Layout Typedef */
typedef struct
{
    __IO uint32_t TSR; /**< RTC Time Seconds Register, offset: 0x0 */
    __IO uint32_t TPR; /**< RTC Time Prescaler Register, offset: 0x4 */
    __IO uint32_t TAR; /**< RTC Time Alarm Register, offset: 0x8 */
    __IO uint32_t TCR; /**< RTC Time Compensation Register, offset: 0xC */
    __IO uint32_t CR;  /**< RTC Control Register, offset: 0x10 */
    __IO uint32_t SR;  /**< RTC Status Register, offset: 0x14 */
    __IO uint32_t LR;  /**< RTC Lock Register, offset: 0x18 */
    __IO uint32_t IER; /**< RTC Interrupt Enable Register, offset: 0x1C */
} RTC_Type, *RTC_MemMapPtr;

