OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** Number of instances of the RTC module. */
#    define RTC_INSTANCE_COUNT (1u)

/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#    define RTC_BASE (0x4003D000u)
/** Peripheral RTC base pointer */
#    define RTC ((RTC_Type*) RTC_BASE)
/** Array initializer of RTC peripheral base addresses */
#    define RTC_BASE_ADDRS \
        {                  \
            RTC_BASE       \
        }
/** Array initializer of RTC peripheral base pointers */
#    define RTC_BASE_PTRS \
        {                 \
            RTC           \
        }
/** Number of interrupt vector arrays for the RTC module. */
#    define RTC_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the RTC module. */
#    define RTC_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the SECONDS type of RTC module. */
#    define RTC_SECONDS_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the RTC peripheral type */
#    define RTC_IRQS \
        {            \
            RTC_IRQn \
        }
#    define RTC_SECONDS_IRQS \
        {                    \
            RTC_Seconds_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- RTC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTC_Register_Masks RTC Register Masks
 * @{
 */

/* TSR Bit Fields */
#    define RTC_TSR_TSR_MASK 0xFFFFFFFFu
#    define RTC_TSR_TSR_SHIFT 0u
#    define RTC_TSR_TSR_WIDTH 32u
#    define RTC_TSR_TSR(x) (((uint32_t)(((uint32_t)(x)) << RTC_TSR_TSR_SHIFT)) & RTC_TSR_TSR_MASK)
/* TPR Bit Fields */
#    define RTC_TPR_TPR_MASK 0xFFFFu
#    define RTC_TPR_TPR_SHIFT 0u
#    define RTC_TPR_TPR_WIDTH 16u
#    define RTC_TPR_TPR(x) (((uint32_t)(((uint32_t)(x)) << RTC_TPR_TPR_SHIFT)) & RTC_TPR_TPR_MASK)
/* TAR Bit Fields */
#    define RTC_TAR_TAR_MASK 0xFFFFFFFFu
#    define RTC_TAR_TAR_SHIFT 0u
#    define RTC_TAR_TAR_WIDTH 32u
#    define RTC_TAR_TAR(x) (((uint32_t)(((uint32_t)(x)) << RTC_TAR_TAR_SHIFT)) & RTC_TAR_TAR_MASK)
/* TCR Bit Fields */
#    define RTC_TCR_TCR_MASK 0xFFu
#    define RTC_TCR_TCR_SHIFT 0u
#    define RTC_TCR_TCR_WIDTH 8u
#    define RTC_TCR_TCR(x) (((uint32_t)(((uint32_t)(x)) << RTC_TCR_TCR_SHIFT)) & RTC_TCR_TCR_MASK)
#    define RTC_TCR_CIR_MASK 0xFF00u
#    define RTC_TCR_CIR_SHIFT 8u
#    define RTC_TCR_CIR_WIDTH 8u
#    define RTC_TCR_CIR(x) (((uint32_t)(((uint32_t)(x)) << RTC_TCR_CIR_SHIFT)) & RTC_TCR_CIR_MASK)
#    define RTC_TCR_TCV_MASK 0xFF0000u
#    define RTC_TCR_TCV_SHIFT 16u
#    define RTC_TCR_TCV_WIDTH 8u
#    define RTC_TCR_TCV(x) (((uint32_t)(((uint32_t)(x)) << RTC_TCR_TCV_SHIFT)) & RTC_TCR_TCV_MASK)
#    define RTC_TCR_CIC_MASK 0xFF000000u
#    define RTC_TCR_CIC_SHIFT 24u
#    define RTC_TCR_CIC_WIDTH 8u
#    define RTC_TCR_CIC(x) (((uint32_t)(((uint32_t)(x)) << RTC_TCR_CIC_SHIFT)) & RTC_TCR_CIC_MASK)
/* CR Bit Fields */
#    define RTC_CR_SWR_MASK 0x1u
#    define RTC_CR_SWR_SHIFT 0u
#    define RTC_CR_SWR_WIDTH 1u
#    define RTC_CR_SWR(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_SWR_SHIFT)) & RTC_CR_SWR_MASK)
#    define RTC_CR_SUP_MASK 0x4u
#    define RTC_CR_SUP_SHIFT 2u
#    define RTC_CR_SUP_WIDTH 1u
#    define RTC_CR_SUP(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_SUP_SHIFT)) & RTC_CR_SUP_MASK)
#    define RTC_CR_UM_MASK 0x8u
#    define RTC_CR_UM_SHIFT 3u
#    define RTC_CR_UM_WIDTH 1u
#    define RTC_CR_UM(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_UM_SHIFT)) & RTC_CR_UM_MASK)
#    define RTC_CR_CPS_MASK 0x20u
#    define RTC_CR_CPS_SHIFT 5u
#    define RTC_CR_CPS_WIDTH 1u
#    define RTC_CR_CPS(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_CPS_SHIFT)) & RTC_CR_CPS_MASK)
#    define RTC_CR_LPOS_MASK 0x80u
#    define RTC_CR_LPOS_SHIFT 7u
#    define RTC_CR_LPOS_WIDTH 1u
#    define RTC_CR_LPOS(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_LPOS_SHIFT)) & RTC_CR_LPOS_MASK)
#    define RTC_CR_CPE_MASK 0x1000000u
#    define RTC_CR_CPE_SHIFT 24u
#    define RTC_CR_CPE_WIDTH 1u
#    define RTC_CR_CPE(x) (((uint32_t)(((uint32_t)(x)) << RTC_CR_CPE_SHIFT)) & RTC_CR_CPE_MASK)
/* SR Bit Fields */
#    define RTC_SR_TIF_MASK 0x1u
#    define RTC_SR_TIF_SHIFT 0u
#    define RTC_SR_TIF_WIDTH 1u
#    define RTC_SR_TIF(x) (((uint32_t)(((uint32_t)(x)) << RTC_SR_TIF_SHIFT)) & RTC_SR_TIF_MASK)
#    define RTC_SR_TOF_MASK 0x2u
#    define RTC_SR_TOF_SHIFT 1u
#    define RTC_SR_TOF_WIDTH 1u
#    define RTC_SR_TOF(x) (((uint32_t)(((uint32_t)(x)) << RTC_SR_TOF_SHIFT)) & RTC_SR_TOF_MASK)
#    define RTC_SR_TAF_MASK 0x4u
#    define RTC_SR_TAF_SHIFT 2u
#    define RTC_SR_TAF_WIDTH 1u
#    define RTC_SR_TAF(x) (((uint32_t)(((uint32_t)(x)) << RTC_SR_TAF_SHIFT)) & RTC_SR_TAF_MASK)
#    define RTC_SR_TCE_MASK 0x10u
#    define RTC_SR_TCE_SHIFT 4u
#    define RTC_SR_TCE_WIDTH 1u
#    define RTC_SR_TCE(x) (((uint32_t)(((uint32_t)(x)) << RTC_SR_TCE_SHIFT)) & RTC_SR_TCE_MASK)
/* LR Bit Fields */
#    define RTC_LR_TCL_MASK 0x8u
#    define RTC_LR_TCL_SHIFT 3u
#    define RTC_LR_TCL_WIDTH 1u
#    define RTC_LR_TCL(x) (((uint32_t)(((uint32_t)(x)) << RTC_LR_TCL_SHIFT)) & RTC_LR_TCL_MASK)
#    define RTC_LR_CRL_MASK 0x10u
#    define RTC_LR_CRL_SHIFT 4u
#    define RTC_LR_CRL_WIDTH 1u
#    define RTC_LR_CRL(x) (((uint32_t)(((uint32_t)(x)) << RTC_LR_CRL_SHIFT)) & RTC_LR_CRL_MASK)
#    define RTC_LR_SRL_MASK 0x20u
#    define RTC_LR_SRL_SHIFT 5u
#    define RTC_LR_SRL_WIDTH 1u
#    define RTC_LR_SRL(x) (((uint32_t)(((uint32_t)(x)) << RTC_LR_SRL_SHIFT)) & RTC_LR_SRL_MASK)
#    define RTC_LR_LRL_MASK 0x40u
#    define RTC_LR_LRL_SHIFT 6u
#    define RTC_LR_LRL_WIDTH 1u
#    define RTC_LR_LRL(x) (((uint32_t)(((uint32_t)(x)) << RTC_LR_LRL_SHIFT)) & RTC_LR_LRL_MASK)
/* IER Bit Fields */
#    define RTC_IER_TIIE_MASK 0x1u
#    define RTC_IER_TIIE_SHIFT 0u
#    define RTC_IER_TIIE_WIDTH 1u
#    define RTC_IER_TIIE(x) (((uint32_t)(((uint32_t)(x)) << RTC_IER_TIIE_SHIFT)) & RTC_IER_TIIE_MASK)
#    define RTC_IER_TOIE_MASK 0x2u
#    define RTC_IER_TOIE_SHIFT 1u
#    define RTC_IER_TOIE_WIDTH 1u
#    define RTC_IER_TOIE(x) (((uint32_t)(((uint32_t)(x)) << RTC_IER_TOIE_SHIFT)) & RTC_IER_TOIE_MASK)
#    define RTC_IER_TAIE_MASK 0x4u
#    define RTC_IER_TAIE_SHIFT 2u
#    define RTC_IER_TAIE_WIDTH 1u
#    define RTC_IER_TAIE(x) (((uint32_t)(((uint32_t)(x)) << RTC_IER_TAIE_SHIFT)) & RTC_IER_TAIE_MASK)
#    define RTC_IER_TSIE_MASK 0x10u
#    define RTC_IER_TSIE_SHIFT 4u
#    define RTC_IER_TSIE_WIDTH 1u
#    define RTC_IER_TSIE(x) (((uint32_t)(((uint32_t)(x)) << RTC_IER_TSIE_SHIFT)) & RTC_IER_TSIE_MASK)
#    define RTC_IER_TSIC_MASK 0x70000u
#    define RTC_IER_TSIC_SHIFT 16u
#    define RTC_IER_TSIC_WIDTH 3u
#    define RTC_IER_TSIC(x) (((uint32_t)(((uint32_t)(x)) << RTC_IER_TSIC_SHIFT)) & RTC_IER_TSIC_MASK)

/*!
 * @}
 */ /* end of group RTC_Register_Masks */

/*!
 * @}
 */ /* end of group RTC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- S32_NVIC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_NVIC_Peripheral_Access_Layer S32_NVIC Peripheral Access Layer
 * @{
 */

