OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define S32_NVIC_IP_PRI84(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI84_SHIFT)) & S32_NVIC_IP_PRI84_MASK)
#    define S32_NVIC_IP_PRI85_MASK 0xFFu
#    define S32_NVIC_IP_PRI85_SHIFT 0u
#    define S32_NVIC_IP_PRI85_WIDTH 8u
#    define S32_NVIC_IP_PRI85(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI85_SHIFT)) & S32_NVIC_IP_PRI85_MASK)
#    define S32_NVIC_IP_PRI86_MASK 0xFFu
#    define S32_NVIC_IP_PRI86_SHIFT 0u
#    define S32_NVIC_IP_PRI86_WIDTH 8u
#    define S32_NVIC_IP_PRI86(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI86_SHIFT)) & S32_NVIC_IP_PRI86_MASK)
#    define S32_NVIC_IP_PRI87_MASK 0xFFu
#    define S32_NVIC_IP_PRI87_SHIFT 0u
#    define S32_NVIC_IP_PRI87_WIDTH 8u
#    define S32_NVIC_IP_PRI87(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI87_SHIFT)) & S32_NVIC_IP_PRI87_MASK)
#    define S32_NVIC_IP_PRI88_MASK 0xFFu
#    define S32_NVIC_IP_PRI88_SHIFT 0u
#    define S32_NVIC_IP_PRI88_WIDTH 8u
#    define S32_NVIC_IP_PRI88(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI88_SHIFT)) & S32_NVIC_IP_PRI88_MASK)
#    define S32_NVIC_IP_PRI89_MASK 0xFFu
#    define S32_NVIC_IP_PRI89_SHIFT 0u
#    define S32_NVIC_IP_PRI89_WIDTH 8u
#    define S32_NVIC_IP_PRI89(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI89_SHIFT)) & S32_NVIC_IP_PRI89_MASK)
#    define S32_NVIC_IP_PRI90_MASK 0xFFu
#    define S32_NVIC_IP_PRI90_SHIFT 0u
#    define S32_NVIC_IP_PRI90_WIDTH 8u
#    define S32_NVIC_IP_PRI90(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI90_SHIFT)) & S32_NVIC_IP_PRI90_MASK)
#    define S32_NVIC_IP_PRI91_MASK 0xFFu
#    define S32_NVIC_IP_PRI91_SHIFT 0u
#    define S32_NVIC_IP_PRI91_WIDTH 8u
#    define S32_NVIC_IP_PRI91(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI91_SHIFT)) & S32_NVIC_IP_PRI91_MASK)
#    define S32_NVIC_IP_PRI92_MASK 0xFFu
#    define S32_NVIC_IP_PRI92_SHIFT 0u
#    define S32_NVIC_IP_PRI92_WIDTH 8u
#    define S32_NVIC_IP_PRI92(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI92_SHIFT)) & S32_NVIC_IP_PRI92_MASK)
#    define S32_NVIC_IP_PRI93_MASK 0xFFu
#    define S32_NVIC_IP_PRI93_SHIFT 0u
#    define S32_NVIC_IP_PRI93_WIDTH 8u
#    define S32_NVIC_IP_PRI93(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI93_SHIFT)) & S32_NVIC_IP_PRI93_MASK)
#    define S32_NVIC_IP_PRI94_MASK 0xFFu
#    define S32_NVIC_IP_PRI94_SHIFT 0u
#    define S32_NVIC_IP_PRI94_WIDTH 8u
#    define S32_NVIC_IP_PRI94(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI94_SHIFT)) & S32_NVIC_IP_PRI94_MASK)
#    define S32_NVIC_IP_PRI95_MASK 0xFFu
#    define S32_NVIC_IP_PRI95_SHIFT 0u
#    define S32_NVIC_IP_PRI95_WIDTH 8u
#    define S32_NVIC_IP_PRI95(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI95_SHIFT)) & S32_NVIC_IP_PRI95_MASK)
#    define S32_NVIC_IP_PRI96_MASK 0xFFu
#    define S32_NVIC_IP_PRI96_SHIFT 0u
#    define S32_NVIC_IP_PRI96_WIDTH 8u
#    define S32_NVIC_IP_PRI96(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI96_SHIFT)) & S32_NVIC_IP_PRI96_MASK)
#    define S32_NVIC_IP_PRI97_MASK 0xFFu
#    define S32_NVIC_IP_PRI97_SHIFT 0u
#    define S32_NVIC_IP_PRI97_WIDTH 8u
#    define S32_NVIC_IP_PRI97(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI97_SHIFT)) & S32_NVIC_IP_PRI97_MASK)
#    define S32_NVIC_IP_PRI98_MASK 0xFFu
#    define S32_NVIC_IP_PRI98_SHIFT 0u
#    define S32_NVIC_IP_PRI98_WIDTH 8u
#    define S32_NVIC_IP_PRI98(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI98_SHIFT)) & S32_NVIC_IP_PRI98_MASK)
#    define S32_NVIC_IP_PRI99_MASK 0xFFu
#    define S32_NVIC_IP_PRI99_SHIFT 0u
#    define S32_NVIC_IP_PRI99_WIDTH 8u
#    define S32_NVIC_IP_PRI99(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI99_SHIFT)) & S32_NVIC_IP_PRI99_MASK)
#    define S32_NVIC_IP_PRI100_MASK 0xFFu
#    define S32_NVIC_IP_PRI100_SHIFT 0u
#    define S32_NVIC_IP_PRI100_WIDTH 8u
#    define S32_NVIC_IP_PRI100(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI100_SHIFT)) & S32_NVIC_IP_PRI100_MASK)
#    define S32_NVIC_IP_PRI101_MASK 0xFFu
#    define S32_NVIC_IP_PRI101_SHIFT 0u
#    define S32_NVIC_IP_PRI101_WIDTH 8u
#    define S32_NVIC_IP_PRI101(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI101_SHIFT)) & S32_NVIC_IP_PRI101_MASK)
#    define S32_NVIC_IP_PRI102_MASK 0xFFu
#    define S32_NVIC_IP_PRI102_SHIFT 0u
#    define S32_NVIC_IP_PRI102_WIDTH 8u
#    define S32_NVIC_IP_PRI102(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI102_SHIFT)) & S32_NVIC_IP_PRI102_MASK)
#    define S32_NVIC_IP_PRI103_MASK 0xFFu
#    define S32_NVIC_IP_PRI103_SHIFT 0u
#    define S32_NVIC_IP_PRI103_WIDTH 8u
#    define S32_NVIC_IP_PRI103(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI103_SHIFT)) & S32_NVIC_IP_PRI103_MASK)
#    define S32_NVIC_IP_PRI104_MASK 0xFFu
#    define S32_NVIC_IP_PRI104_SHIFT 0u
#    define S32_NVIC_IP_PRI104_WIDTH 8u
#    define S32_NVIC_IP_PRI104(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI104_SHIFT)) & S32_NVIC_IP_PRI104_MASK)
#    define S32_NVIC_IP_PRI105_MASK 0xFFu
#    define S32_NVIC_IP_PRI105_SHIFT 0u
#    define S32_NVIC_IP_PRI105_WIDTH 8u
#    define S32_NVIC_IP_PRI105(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI105_SHIFT)) & S32_NVIC_IP_PRI105_MASK)
#    define S32_NVIC_IP_PRI106_MASK 0xFFu
#    define S32_NVIC_IP_PRI106_SHIFT 0u
#    define S32_NVIC_IP_PRI106_WIDTH 8u
#    define S32_NVIC_IP_PRI106(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI106_SHIFT)) & S32_NVIC_IP_PRI106_MASK)
#    define S32_NVIC_IP_PRI107_MASK 0xFFu
#    define S32_NVIC_IP_PRI107_SHIFT 0u
#    define S32_NVIC_IP_PRI107_WIDTH 8u
#    define S32_NVIC_IP_PRI107(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI107_SHIFT)) & S32_NVIC_IP_PRI107_MASK)
#    define S32_NVIC_IP_PRI108_MASK 0xFFu
#    define S32_NVIC_IP_PRI108_SHIFT 0u
#    define S32_NVIC_IP_PRI108_WIDTH 8u
#    define S32_NVIC_IP_PRI108(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI108_SHIFT)) & S32_NVIC_IP_PRI108_MASK)
#    define S32_NVIC_IP_PRI109_MASK 0xFFu
#    define S32_NVIC_IP_PRI109_SHIFT 0u
#    define S32_NVIC_IP_PRI109_WIDTH 8u
#    define S32_NVIC_IP_PRI109(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI109_SHIFT)) & S32_NVIC_IP_PRI109_MASK)
#    define S32_NVIC_IP_PRI110_MASK 0xFFu
#    define S32_NVIC_IP_PRI110_SHIFT 0u
#    define S32_NVIC_IP_PRI110_WIDTH 8u
#    define S32_NVIC_IP_PRI110(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI110_SHIFT)) & S32_NVIC_IP_PRI110_MASK)
#    define S32_NVIC_IP_PRI111_MASK 0xFFu
#    define S32_NVIC_IP_PRI111_SHIFT 0u
#    define S32_NVIC_IP_PRI111_WIDTH 8u
#    define S32_NVIC_IP_PRI111(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI111_SHIFT)) & S32_NVIC_IP_PRI111_MASK)
#    define S32_NVIC_IP_PRI112_MASK 0xFFu
#    define S32_NVIC_IP_PRI112_SHIFT 0u
#    define S32_NVIC_IP_PRI112_WIDTH 8u
#    define S32_NVIC_IP_PRI112(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI112_SHIFT)) & S32_NVIC_IP_PRI112_MASK)
#    define S32_NVIC_IP_PRI113_MASK 0xFFu
#    define S32_NVIC_IP_PRI113_SHIFT 0u
#    define S32_NVIC_IP_PRI113_WIDTH 8u
#    define S32_NVIC_IP_PRI113(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI113_SHIFT)) & S32_NVIC_IP_PRI113_MASK)
#    define S32_NVIC_IP_PRI114_MASK 0xFFu
#    define S32_NVIC_IP_PRI114_SHIFT 0u
#    define S32_NVIC_IP_PRI114_WIDTH 8u
#    define S32_NVIC_IP_PRI114(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI114_SHIFT)) & S32_NVIC_IP_PRI114_MASK)
#    define S32_NVIC_IP_PRI115_MASK 0xFFu
#    define S32_NVIC_IP_PRI115_SHIFT 0u
#    define S32_NVIC_IP_PRI115_WIDTH 8u
#    define S32_NVIC_IP_PRI115(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI115_SHIFT)) & S32_NVIC_IP_PRI115_MASK)
#    define S32_NVIC_IP_PRI116_MASK 0xFFu
#    define S32_NVIC_IP_PRI116_SHIFT 0u
#    define S32_NVIC_IP_PRI116_WIDTH 8u
#    define S32_NVIC_IP_PRI116(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI116_SHIFT)) & S32_NVIC_IP_PRI116_MASK)
#    define S32_NVIC_IP_PRI117_MASK 0xFFu
#    define S32_NVIC_IP_PRI117_SHIFT 0u
#    define S32_NVIC_IP_PRI117_WIDTH 8u
#    define S32_NVIC_IP_PRI117(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI117_SHIFT)) & S32_NVIC_IP_PRI117_MASK)
#    define S32_NVIC_IP_PRI118_MASK 0xFFu
#    define S32_NVIC_IP_PRI118_SHIFT 0u
#    define S32_NVIC_IP_PRI118_WIDTH 8u
#    define S32_NVIC_IP_PRI118(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI118_SHIFT)) & S32_NVIC_IP_PRI118_MASK)
#    define S32_NVIC_IP_PRI119_MASK 0xFFu
#    define S32_NVIC_IP_PRI119_SHIFT 0u
#    define S32_NVIC_IP_PRI119_WIDTH 8u
#    define S32_NVIC_IP_PRI119(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI119_SHIFT)) & S32_NVIC_IP_PRI119_MASK)
#    define S32_NVIC_IP_PRI120_MASK 0xFFu
#    define S32_NVIC_IP_PRI120_SHIFT 0u
#    define S32_NVIC_IP_PRI120_WIDTH 8u
#    define S32_NVIC_IP_PRI120(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI120_SHIFT)) & S32_NVIC_IP_PRI120_MASK)
#    define S32_NVIC_IP_PRI121_MASK 0xFFu
#    define S32_NVIC_IP_PRI121_SHIFT 0u
#    define S32_NVIC_IP_PRI121_WIDTH 8u
#    define S32_NVIC_IP_PRI121(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI121_SHIFT)) & S32_NVIC_IP_PRI121_MASK)
#    define S32_NVIC_IP_PRI122_MASK 0xFFu
#    define S32_NVIC_IP_PRI122_SHIFT 0u
#    define S32_NVIC_IP_PRI122_WIDTH 8u
#    define S32_NVIC_IP_PRI122(x) (((uint8_t)(((uint8_t)(x)) << S32_NVIC_IP_PRI122_SHIFT)) & S32_NVIC_IP_PRI122_MASK)
/* STIR Bit Fields */
#    define S32_NVIC_STIR_INTID_MASK 0x1FFu
#    define S32_NVIC_STIR_INTID_SHIFT 0u
#    define S32_NVIC_STIR_INTID_WIDTH 9u
#    define S32_NVIC_STIR_INTID(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_NVIC_STIR_INTID_SHIFT)) & S32_NVIC_STIR_INTID_MASK)

/*!
 * @}
 */ /* end of group S32_NVIC_Register_Masks */

/*!
 * @}
 */ /* end of group S32_NVIC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- S32_SCB Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SCB_Peripheral_Access_Layer S32_SCB Peripheral Access Layer
 * @{
 */

/** S32_SCB - Size of Registers Arrays */

/** S32_SCB - Register Layout Typedef */
typedef struct
{
    uint8_t RESERVED_0[8];
    __IO uint32_t ACTLR; /**< Auxiliary Control Register,, offset: 0x8 */
    uint8_t       RESERVED_1[3316];
    __I uint32_t CPUID;  /**< CPUID Base Register, offset: 0xD00 */
    __IO uint32_t ICSR;  /**< Interrupt Control and State Register, offset: 0xD04 */
    __IO uint32_t VTOR;  /**< Vector Table Offset Register, offset: 0xD08 */
    __IO uint32_t AIRCR; /**< Application Interrupt and Reset Control Register, offset: 0xD0C */
    __IO uint32_t SCR;   /**< System Control Register, offset: 0xD10 */
    __IO uint32_t CCR;   /**< Configuration and Control Register, offset: 0xD14 */
    __IO uint32_t SHPR1; /**< System Handler Priority Register 1, offset: 0xD18 */
    __IO uint32_t SHPR2; /**< System Handler Priority Register 2, offset: 0xD1C */
    __IO uint32_t SHPR3; /**< System Handler Priority Register 3, offset: 0xD20 */
    __IO uint32_t SHCSR; /**< System Handler Control and State Register, offset: 0xD24 */
    __IO uint32_t CFSR;  /**< Configurable Fault Status Registers, offset: 0xD28 */
    __IO uint32_t HFSR;  /**< HardFault Status register, offset: 0xD2C */
    __IO uint32_t DFSR;  /**< Debug Fault Status Register, offset: 0xD30 */
    __IO uint32_t MMFAR; /**< MemManage Address Register, offset: 0xD34 */
    __IO uint32_t BFAR;  /**< BusFault Address Register, offset: 0xD38 */
    __IO uint32_t AFSR;  /**< Auxiliary Fault Status Register, offset: 0xD3C */
    uint8_t       RESERVED_2[72];
    __IO uint32_t CPACR; /**< Coprocessor Access Control Register, offset: 0xD88 */
    uint8_t       RESERVED_3[424];
    __IO uint32_t FPCCR;  /**< Floating-point Context Control Register, offset: 0xF34 */
    __IO uint32_t FPCAR;  /**< Floating-point Context Address Register, offset: 0xF38 */
    __IO uint32_t FPDSCR; /**< Floating-point Default Status Control Register, offset: 0xF3C */
} S32_SCB_Type, *S32_SCB_MemMapPtr;

/** Number of instances of the S32_SCB module. */
#    define S32_SCB_INSTANCE_COUNT (1u)

