OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
#    define S32_SCB_DFSR_EXTERNAL_SHIFT 4u
#    define S32_SCB_DFSR_EXTERNAL_WIDTH 1u
#    define S32_SCB_DFSR_EXTERNAL(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_DFSR_EXTERNAL_SHIFT)) & S32_SCB_DFSR_EXTERNAL_MASK)
/* MMFAR Bit Fields */
#    define S32_SCB_MMFAR_ADDRESS_MASK 0xFFFFFFFFu
#    define S32_SCB_MMFAR_ADDRESS_SHIFT 0u
#    define S32_SCB_MMFAR_ADDRESS_WIDTH 32u
#    define S32_SCB_MMFAR_ADDRESS(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_MMFAR_ADDRESS_SHIFT)) & S32_SCB_MMFAR_ADDRESS_MASK)
/* BFAR Bit Fields */
#    define S32_SCB_BFAR_ADDRESS_MASK 0xFFFFFFFFu
#    define S32_SCB_BFAR_ADDRESS_SHIFT 0u
#    define S32_SCB_BFAR_ADDRESS_WIDTH 32u
#    define S32_SCB_BFAR_ADDRESS(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_BFAR_ADDRESS_SHIFT)) & S32_SCB_BFAR_ADDRESS_MASK)
/* AFSR Bit Fields */
#    define S32_SCB_AFSR_AUXFAULT_MASK 0xFFFFFFFFu
#    define S32_SCB_AFSR_AUXFAULT_SHIFT 0u
#    define S32_SCB_AFSR_AUXFAULT_WIDTH 32u
#    define S32_SCB_AFSR_AUXFAULT(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_AFSR_AUXFAULT_SHIFT)) & S32_SCB_AFSR_AUXFAULT_MASK)
/* CPACR Bit Fields */
#    define S32_SCB_CPACR_CP10_MASK 0x300000u
#    define S32_SCB_CPACR_CP10_SHIFT 20u
#    define S32_SCB_CPACR_CP10_WIDTH 2u
#    define S32_SCB_CPACR_CP10(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_CPACR_CP10_SHIFT)) & S32_SCB_CPACR_CP10_MASK)
#    define S32_SCB_CPACR_CP11_MASK 0xC00000u
#    define S32_SCB_CPACR_CP11_SHIFT 22u
#    define S32_SCB_CPACR_CP11_WIDTH 2u
#    define S32_SCB_CPACR_CP11(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_CPACR_CP11_SHIFT)) & S32_SCB_CPACR_CP11_MASK)
/* FPCCR Bit Fields */
#    define S32_SCB_FPCCR_LSPACT_MASK 0x1u
#    define S32_SCB_FPCCR_LSPACT_SHIFT 0u
#    define S32_SCB_FPCCR_LSPACT_WIDTH 1u
#    define S32_SCB_FPCCR_LSPACT(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_LSPACT_SHIFT)) & S32_SCB_FPCCR_LSPACT_MASK)
#    define S32_SCB_FPCCR_USER_MASK 0x2u
#    define S32_SCB_FPCCR_USER_SHIFT 1u
#    define S32_SCB_FPCCR_USER_WIDTH 1u
#    define S32_SCB_FPCCR_USER(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_USER_SHIFT)) & S32_SCB_FPCCR_USER_MASK)
#    define S32_SCB_FPCCR_THREAD_MASK 0x8u
#    define S32_SCB_FPCCR_THREAD_SHIFT 3u
#    define S32_SCB_FPCCR_THREAD_WIDTH 1u
#    define S32_SCB_FPCCR_THREAD(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_THREAD_SHIFT)) & S32_SCB_FPCCR_THREAD_MASK)
#    define S32_SCB_FPCCR_HFRDY_MASK 0x10u
#    define S32_SCB_FPCCR_HFRDY_SHIFT 4u
#    define S32_SCB_FPCCR_HFRDY_WIDTH 1u
#    define S32_SCB_FPCCR_HFRDY(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_HFRDY_SHIFT)) & S32_SCB_FPCCR_HFRDY_MASK)
#    define S32_SCB_FPCCR_MMRDY_MASK 0x20u
#    define S32_SCB_FPCCR_MMRDY_SHIFT 5u
#    define S32_SCB_FPCCR_MMRDY_WIDTH 1u
#    define S32_SCB_FPCCR_MMRDY(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_MMRDY_SHIFT)) & S32_SCB_FPCCR_MMRDY_MASK)
#    define S32_SCB_FPCCR_BFRDY_MASK 0x40u
#    define S32_SCB_FPCCR_BFRDY_SHIFT 6u
#    define S32_SCB_FPCCR_BFRDY_WIDTH 1u
#    define S32_SCB_FPCCR_BFRDY(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_BFRDY_SHIFT)) & S32_SCB_FPCCR_BFRDY_MASK)
#    define S32_SCB_FPCCR_MONRDY_MASK 0x100u
#    define S32_SCB_FPCCR_MONRDY_SHIFT 8u
#    define S32_SCB_FPCCR_MONRDY_WIDTH 1u
#    define S32_SCB_FPCCR_MONRDY(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_MONRDY_SHIFT)) & S32_SCB_FPCCR_MONRDY_MASK)
#    define S32_SCB_FPCCR_LSPEN_MASK 0x40000000u
#    define S32_SCB_FPCCR_LSPEN_SHIFT 30u
#    define S32_SCB_FPCCR_LSPEN_WIDTH 1u
#    define S32_SCB_FPCCR_LSPEN(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_LSPEN_SHIFT)) & S32_SCB_FPCCR_LSPEN_MASK)
#    define S32_SCB_FPCCR_ASPEN_MASK 0x80000000u
#    define S32_SCB_FPCCR_ASPEN_SHIFT 31u
#    define S32_SCB_FPCCR_ASPEN_WIDTH 1u
#    define S32_SCB_FPCCR_ASPEN(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCCR_ASPEN_SHIFT)) & S32_SCB_FPCCR_ASPEN_MASK)
/* FPCAR Bit Fields */
#    define S32_SCB_FPCAR_ADDRESS_MASK 0xFFFFFFF8u
#    define S32_SCB_FPCAR_ADDRESS_SHIFT 3u
#    define S32_SCB_FPCAR_ADDRESS_WIDTH 29u
#    define S32_SCB_FPCAR_ADDRESS(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPCAR_ADDRESS_SHIFT)) & S32_SCB_FPCAR_ADDRESS_MASK)
/* FPDSCR Bit Fields */
#    define S32_SCB_FPDSCR_RMode_MASK 0xC00000u
#    define S32_SCB_FPDSCR_RMode_SHIFT 22u
#    define S32_SCB_FPDSCR_RMode_WIDTH 2u
#    define S32_SCB_FPDSCR_RMode(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPDSCR_RMode_SHIFT)) & S32_SCB_FPDSCR_RMode_MASK)
#    define S32_SCB_FPDSCR_FZ_MASK 0x1000000u
#    define S32_SCB_FPDSCR_FZ_SHIFT 24u
#    define S32_SCB_FPDSCR_FZ_WIDTH 1u
#    define S32_SCB_FPDSCR_FZ(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPDSCR_FZ_SHIFT)) & S32_SCB_FPDSCR_FZ_MASK)
#    define S32_SCB_FPDSCR_DN_MASK 0x2000000u
#    define S32_SCB_FPDSCR_DN_SHIFT 25u
#    define S32_SCB_FPDSCR_DN_WIDTH 1u
#    define S32_SCB_FPDSCR_DN(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPDSCR_DN_SHIFT)) & S32_SCB_FPDSCR_DN_MASK)
#    define S32_SCB_FPDSCR_AHP_MASK 0x4000000u
#    define S32_SCB_FPDSCR_AHP_SHIFT 26u
#    define S32_SCB_FPDSCR_AHP_WIDTH 1u
#    define S32_SCB_FPDSCR_AHP(x) (((uint32_t)(((uint32_t)(x)) << S32_SCB_FPDSCR_AHP_SHIFT)) & S32_SCB_FPDSCR_AHP_MASK)

/*!
 * @}
 */ /* end of group S32_SCB_Register_Masks */

/*!
 * @}
 */ /* end of group S32_SCB_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- S32_SysTick Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SysTick_Peripheral_Access_Layer S32_SysTick Peripheral Access Layer
 * @{
 */

/** S32_SysTick - Size of Registers Arrays */

/** S32_SysTick - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CSR;  /**< SysTick Control and Status Register, offset: 0x0 */
    __IO uint32_t RVR;  /**< SysTick Reload Value Register, offset: 0x4 */
    __IO uint32_t CVR;  /**< SysTick Current Value Register, offset: 0x8 */
    __I uint32_t CALIB; /**< SysTick Calibration Value Register, offset: 0xC */
} S32_SysTick_Type, *S32_SysTick_MemMapPtr;

