OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** Number of instances of the S32_SysTick module. */
#    define S32_SysTick_INSTANCE_COUNT (1u)

/* S32_SysTick - Peripheral instance base addresses */
/** Peripheral S32_SysTick base address */
#    define S32_SysTick_BASE (0xE000E010u)
/** Peripheral S32_SysTick base pointer */
#    define S32_SysTick ((S32_SysTick_Type*) S32_SysTick_BASE)
/** Array initializer of S32_SysTick peripheral base addresses */
#    define S32_SysTick_BASE_ADDRS \
        {                          \
            S32_SysTick_BASE       \
        }
/** Array initializer of S32_SysTick peripheral base pointers */
#    define S32_SysTick_BASE_PTRS \
        {                         \
            S32_SysTick           \
        }
/** Number of interrupt vector arrays for the S32_SysTick module. */
#    define S32_SysTick_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the S32_SysTick module. */
#    define S32_SysTick_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the S32_SysTick peripheral type */
#    define S32_SysTick_IRQS \
        {                    \
            SysTick_IRQn     \
        }

/* ----------------------------------------------------------------------------
   -- S32_SysTick Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup S32_SysTick_Register_Masks S32_SysTick Register Masks
 * @{
 */

/* CSR Bit Fields */
#    define S32_SysTick_CSR_ENABLE_MASK 0x1u
#    define S32_SysTick_CSR_ENABLE_SHIFT 0u
#    define S32_SysTick_CSR_ENABLE_WIDTH 1u
#    define S32_SysTick_CSR_ENABLE(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CSR_ENABLE_SHIFT)) & S32_SysTick_CSR_ENABLE_MASK)
#    define S32_SysTick_CSR_TICKINT_MASK 0x2u
#    define S32_SysTick_CSR_TICKINT_SHIFT 1u
#    define S32_SysTick_CSR_TICKINT_WIDTH 1u
#    define S32_SysTick_CSR_TICKINT(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CSR_TICKINT_SHIFT)) & S32_SysTick_CSR_TICKINT_MASK)
#    define S32_SysTick_CSR_CLKSOURCE_MASK 0x4u
#    define S32_SysTick_CSR_CLKSOURCE_SHIFT 2u
#    define S32_SysTick_CSR_CLKSOURCE_WIDTH 1u
#    define S32_SysTick_CSR_CLKSOURCE(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CSR_CLKSOURCE_SHIFT)) & S32_SysTick_CSR_CLKSOURCE_MASK)
#    define S32_SysTick_CSR_COUNTFLAG_MASK 0x10000u
#    define S32_SysTick_CSR_COUNTFLAG_SHIFT 16u
#    define S32_SysTick_CSR_COUNTFLAG_WIDTH 1u
#    define S32_SysTick_CSR_COUNTFLAG(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CSR_COUNTFLAG_SHIFT)) & S32_SysTick_CSR_COUNTFLAG_MASK)
/* RVR Bit Fields */
#    define S32_SysTick_RVR_RELOAD_MASK 0xFFFFFFu
#    define S32_SysTick_RVR_RELOAD_SHIFT 0u
#    define S32_SysTick_RVR_RELOAD_WIDTH 24u
#    define S32_SysTick_RVR_RELOAD(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_RVR_RELOAD_SHIFT)) & S32_SysTick_RVR_RELOAD_MASK)
/* CVR Bit Fields */
#    define S32_SysTick_CVR_CURRENT_MASK 0xFFFFFFu
#    define S32_SysTick_CVR_CURRENT_SHIFT 0u
#    define S32_SysTick_CVR_CURRENT_WIDTH 24u
#    define S32_SysTick_CVR_CURRENT(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CVR_CURRENT_SHIFT)) & S32_SysTick_CVR_CURRENT_MASK)
/* CALIB Bit Fields */
#    define S32_SysTick_CALIB_TENMS_MASK 0xFFFFFFu
#    define S32_SysTick_CALIB_TENMS_SHIFT 0u
#    define S32_SysTick_CALIB_TENMS_WIDTH 24u
#    define S32_SysTick_CALIB_TENMS(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CALIB_TENMS_SHIFT)) & S32_SysTick_CALIB_TENMS_MASK)
#    define S32_SysTick_CALIB_SKEW_MASK 0x40000000u
#    define S32_SysTick_CALIB_SKEW_SHIFT 30u
#    define S32_SysTick_CALIB_SKEW_WIDTH 1u
#    define S32_SysTick_CALIB_SKEW(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CALIB_SKEW_SHIFT)) & S32_SysTick_CALIB_SKEW_MASK)
#    define S32_SysTick_CALIB_NOREF_MASK 0x80000000u
#    define S32_SysTick_CALIB_NOREF_SHIFT 31u
#    define S32_SysTick_CALIB_NOREF_WIDTH 1u
#    define S32_SysTick_CALIB_NOREF(x) \
        (((uint32_t)(((uint32_t)(x)) << S32_SysTick_CALIB_NOREF_SHIFT)) & S32_SysTick_CALIB_NOREF_MASK)

/*!
 * @}
 */ /* end of group S32_SysTick_Register_Masks */

/*!
 * @}
 */ /* end of group S32_SysTick_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- SAI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Peripheral_Access_Layer SAI Peripheral Access Layer
 * @{
 */

/** SAI - Size of Registers Arrays */
#    define SAI_TDR_COUNT 4u
#    define SAI_TFR_COUNT 4u
#    define SAI_RDR_COUNT 4u
#    define SAI_RFR_COUNT 4u

/** SAI - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID;              /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM;              /**< Parameter Register, offset: 0x4 */
    __IO uint32_t TCSR;              /**< SAI Transmit Control Register, offset: 0x8 */
    __IO uint32_t TCR1;              /**< SAI Transmit Configuration 1 Register, offset: 0xC */
    __IO uint32_t TCR2;              /**< SAI Transmit Configuration 2 Register, offset: 0x10 */
    __IO uint32_t TCR3;              /**< SAI Transmit Configuration 3 Register, offset: 0x14 */
    __IO uint32_t TCR4;              /**< SAI Transmit Configuration 4 Register, offset: 0x18 */
    __IO uint32_t TCR5;              /**< SAI Transmit Configuration 5 Register, offset: 0x1C */
    __O uint32_t TDR[SAI_TDR_COUNT]; /**< SAI Transmit Data Register, array offset: 0x20, array step: 0x4 */
    uint8_t      RESERVED_0[16];
    __I uint32_t TFR[SAI_TFR_COUNT]; /**< SAI Transmit FIFO Register, array offset: 0x40, array step: 0x4 */
    uint8_t      RESERVED_1[16];
    __IO uint32_t TMR; /**< SAI Transmit Mask Register, offset: 0x60 */
    uint8_t       RESERVED_2[36];
    __IO uint32_t RCSR;              /**< SAI Receive Control Register, offset: 0x88 */
    __IO uint32_t RCR1;              /**< SAI Receive Configuration 1 Register, offset: 0x8C */
    __IO uint32_t RCR2;              /**< SAI Receive Configuration 2 Register, offset: 0x90 */
    __IO uint32_t RCR3;              /**< SAI Receive Configuration 3 Register, offset: 0x94 */
    __IO uint32_t RCR4;              /**< SAI Receive Configuration 4 Register, offset: 0x98 */
    __IO uint32_t RCR5;              /**< SAI Receive Configuration 5 Register, offset: 0x9C */
    __I uint32_t RDR[SAI_RDR_COUNT]; /**< SAI Receive Data Register, array offset: 0xA0, array step: 0x4 */
    uint8_t      RESERVED_3[16];
    __I uint32_t RFR[SAI_RFR_COUNT]; /**< SAI Receive FIFO Register, array offset: 0xC0, array step: 0x4 */
    uint8_t      RESERVED_4[16];
    __IO uint32_t RMR; /**< SAI Receive Mask Register, offset: 0xE0 */
} SAI_Type, *SAI_MemMapPtr;

/** Number of instances of the SAI module. */
#    define SAI_INSTANCE_COUNT (2u)

