OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/* SAI - Peripheral instance base addresses */
/** Peripheral SAI0 base address */
#    define SAI0_BASE (0x40054000u)
/** Peripheral SAI0 base pointer */
#    define SAI0 ((SAI_Type*) SAI0_BASE)
/** Peripheral SAI1 base address */
#    define SAI1_BASE (0x40055000u)
/** Peripheral SAI1 base pointer */
#    define SAI1 ((SAI_Type*) SAI1_BASE)
/** Array initializer of SAI peripheral base addresses */
#    define SAI_BASE_ADDRS       \
        {                        \
            SAI0_BASE, SAI1_BASE \
        }
/** Array initializer of SAI peripheral base pointers */
#    define SAI_BASE_PTRS \
        {                 \
            SAI0, SAI1    \
        }
/** Number of interrupt vector arrays for the SAI module. */
#    define SAI_IRQS_ARR_COUNT (2u)
/** Number of interrupt channels for the RX type of SAI module. */
#    define SAI_RX_IRQS_CH_COUNT (1u)
/** Number of interrupt channels for the TX type of SAI module. */
#    define SAI_TX_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the SAI peripheral type */
#    define SAI_RX_IRQS                \
        {                              \
            SAI0_Rx_IRQn, SAI1_Rx_IRQn \
        }
#    define SAI_TX_IRQS                \
        {                              \
            SAI0_Tx_IRQn, SAI1_Tx_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- SAI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SAI_Register_Masks SAI Register Masks
 * @{
 */

/* VERID Bit Fields */
#    define SAI_VERID_FEATURE_MASK 0xFFFFu
#    define SAI_VERID_FEATURE_SHIFT 0u
#    define SAI_VERID_FEATURE_WIDTH 16u
#    define SAI_VERID_FEATURE(x) (((uint32_t)(((uint32_t)(x)) << SAI_VERID_FEATURE_SHIFT)) & SAI_VERID_FEATURE_MASK)
#    define SAI_VERID_MINOR_MASK 0xFF0000u
#    define SAI_VERID_MINOR_SHIFT 16u
#    define SAI_VERID_MINOR_WIDTH 8u
#    define SAI_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << SAI_VERID_MINOR_SHIFT)) & SAI_VERID_MINOR_MASK)
#    define SAI_VERID_MAJOR_MASK 0xFF000000u
#    define SAI_VERID_MAJOR_SHIFT 24u
#    define SAI_VERID_MAJOR_WIDTH 8u
#    define SAI_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << SAI_VERID_MAJOR_SHIFT)) & SAI_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define SAI_PARAM_DATALINE_MASK 0xFu
#    define SAI_PARAM_DATALINE_SHIFT 0u
#    define SAI_PARAM_DATALINE_WIDTH 4u
#    define SAI_PARAM_DATALINE(x) (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_DATALINE_SHIFT)) & SAI_PARAM_DATALINE_MASK)
#    define SAI_PARAM_FIFO_MASK 0xF00u
#    define SAI_PARAM_FIFO_SHIFT 8u
#    define SAI_PARAM_FIFO_WIDTH 4u
#    define SAI_PARAM_FIFO(x) (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_FIFO_SHIFT)) & SAI_PARAM_FIFO_MASK)
#    define SAI_PARAM_FRAME_MASK 0xF0000u
#    define SAI_PARAM_FRAME_SHIFT 16u
#    define SAI_PARAM_FRAME_WIDTH 4u
#    define SAI_PARAM_FRAME(x) (((uint32_t)(((uint32_t)(x)) << SAI_PARAM_FRAME_SHIFT)) & SAI_PARAM_FRAME_MASK)
/* TCSR Bit Fields */
#    define SAI_TCSR_FRDE_MASK 0x1u
#    define SAI_TCSR_FRDE_SHIFT 0u
#    define SAI_TCSR_FRDE_WIDTH 1u
#    define SAI_TCSR_FRDE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRDE_SHIFT)) & SAI_TCSR_FRDE_MASK)
#    define SAI_TCSR_FWDE_MASK 0x2u
#    define SAI_TCSR_FWDE_SHIFT 1u
#    define SAI_TCSR_FWDE_WIDTH 1u
#    define SAI_TCSR_FWDE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWDE_SHIFT)) & SAI_TCSR_FWDE_MASK)
#    define SAI_TCSR_FRIE_MASK 0x100u
#    define SAI_TCSR_FRIE_SHIFT 8u
#    define SAI_TCSR_FRIE_WIDTH 1u
#    define SAI_TCSR_FRIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRIE_SHIFT)) & SAI_TCSR_FRIE_MASK)
#    define SAI_TCSR_FWIE_MASK 0x200u
#    define SAI_TCSR_FWIE_SHIFT 9u
#    define SAI_TCSR_FWIE_WIDTH 1u
#    define SAI_TCSR_FWIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWIE_SHIFT)) & SAI_TCSR_FWIE_MASK)
#    define SAI_TCSR_FEIE_MASK 0x400u
#    define SAI_TCSR_FEIE_SHIFT 10u
#    define SAI_TCSR_FEIE_WIDTH 1u
#    define SAI_TCSR_FEIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FEIE_SHIFT)) & SAI_TCSR_FEIE_MASK)
#    define SAI_TCSR_SEIE_MASK 0x800u
#    define SAI_TCSR_SEIE_SHIFT 11u
#    define SAI_TCSR_SEIE_WIDTH 1u
#    define SAI_TCSR_SEIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SEIE_SHIFT)) & SAI_TCSR_SEIE_MASK)
#    define SAI_TCSR_WSIE_MASK 0x1000u
#    define SAI_TCSR_WSIE_SHIFT 12u
#    define SAI_TCSR_WSIE_WIDTH 1u
#    define SAI_TCSR_WSIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_WSIE_SHIFT)) & SAI_TCSR_WSIE_MASK)
#    define SAI_TCSR_FRF_MASK 0x10000u
#    define SAI_TCSR_FRF_SHIFT 16u
#    define SAI_TCSR_FRF_WIDTH 1u
#    define SAI_TCSR_FRF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FRF_SHIFT)) & SAI_TCSR_FRF_MASK)
#    define SAI_TCSR_FWF_MASK 0x20000u
#    define SAI_TCSR_FWF_SHIFT 17u
#    define SAI_TCSR_FWF_WIDTH 1u
#    define SAI_TCSR_FWF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FWF_SHIFT)) & SAI_TCSR_FWF_MASK)
#    define SAI_TCSR_FEF_MASK 0x40000u
#    define SAI_TCSR_FEF_SHIFT 18u
#    define SAI_TCSR_FEF_WIDTH 1u
#    define SAI_TCSR_FEF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FEF_SHIFT)) & SAI_TCSR_FEF_MASK)
#    define SAI_TCSR_SEF_MASK 0x80000u
#    define SAI_TCSR_SEF_SHIFT 19u
#    define SAI_TCSR_SEF_WIDTH 1u
#    define SAI_TCSR_SEF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SEF_SHIFT)) & SAI_TCSR_SEF_MASK)
#    define SAI_TCSR_WSF_MASK 0x100000u
#    define SAI_TCSR_WSF_SHIFT 20u
#    define SAI_TCSR_WSF_WIDTH 1u
#    define SAI_TCSR_WSF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_WSF_SHIFT)) & SAI_TCSR_WSF_MASK)
#    define SAI_TCSR_SR_MASK 0x1000000u
#    define SAI_TCSR_SR_SHIFT 24u
#    define SAI_TCSR_SR_WIDTH 1u
#    define SAI_TCSR_SR(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_SR_SHIFT)) & SAI_TCSR_SR_MASK)
#    define SAI_TCSR_FR_MASK 0x2000000u
#    define SAI_TCSR_FR_SHIFT 25u
#    define SAI_TCSR_FR_WIDTH 1u
#    define SAI_TCSR_FR(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_FR_SHIFT)) & SAI_TCSR_FR_MASK)
#    define SAI_TCSR_BCE_MASK 0x10000000u
#    define SAI_TCSR_BCE_SHIFT 28u
#    define SAI_TCSR_BCE_WIDTH 1u
#    define SAI_TCSR_BCE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_BCE_SHIFT)) & SAI_TCSR_BCE_MASK)
#    define SAI_TCSR_DBGE_MASK 0x20000000u
#    define SAI_TCSR_DBGE_SHIFT 29u
#    define SAI_TCSR_DBGE_WIDTH 1u
#    define SAI_TCSR_DBGE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_DBGE_SHIFT)) & SAI_TCSR_DBGE_MASK)
#    define SAI_TCSR_TE_MASK 0x80000000u
#    define SAI_TCSR_TE_SHIFT 31u
#    define SAI_TCSR_TE_WIDTH 1u
#    define SAI_TCSR_TE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCSR_TE_SHIFT)) & SAI_TCSR_TE_MASK)
/* TCR1 Bit Fields */
#    define SAI_TCR1_TFW_MASK 0x7u
#    define SAI_TCR1_TFW_SHIFT 0u
#    define SAI_TCR1_TFW_WIDTH 3u
#    define SAI_TCR1_TFW(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR1_TFW_SHIFT)) & SAI_TCR1_TFW_MASK)
/* TCR2 Bit Fields */
#    define SAI_TCR2_DIV_MASK 0xFFu
#    define SAI_TCR2_DIV_SHIFT 0u
#    define SAI_TCR2_DIV_WIDTH 8u
#    define SAI_TCR2_DIV(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_DIV_SHIFT)) & SAI_TCR2_DIV_MASK)
#    define SAI_TCR2_BCD_MASK 0x1000000u
#    define SAI_TCR2_BCD_SHIFT 24u
#    define SAI_TCR2_BCD_WIDTH 1u
#    define SAI_TCR2_BCD(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCD_SHIFT)) & SAI_TCR2_BCD_MASK)
#    define SAI_TCR2_BCP_MASK 0x2000000u
#    define SAI_TCR2_BCP_SHIFT 25u
#    define SAI_TCR2_BCP_WIDTH 1u
#    define SAI_TCR2_BCP(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCP_SHIFT)) & SAI_TCR2_BCP_MASK)
#    define SAI_TCR2_MSEL_MASK 0xC000000u
#    define SAI_TCR2_MSEL_SHIFT 26u
#    define SAI_TCR2_MSEL_WIDTH 2u
#    define SAI_TCR2_MSEL(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_MSEL_SHIFT)) & SAI_TCR2_MSEL_MASK)
#    define SAI_TCR2_BCI_MASK 0x10000000u
#    define SAI_TCR2_BCI_SHIFT 28u
#    define SAI_TCR2_BCI_WIDTH 1u
#    define SAI_TCR2_BCI(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCI_SHIFT)) & SAI_TCR2_BCI_MASK)
#    define SAI_TCR2_BCS_MASK 0x20000000u
#    define SAI_TCR2_BCS_SHIFT 29u
#    define SAI_TCR2_BCS_WIDTH 1u
#    define SAI_TCR2_BCS(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_BCS_SHIFT)) & SAI_TCR2_BCS_MASK)
#    define SAI_TCR2_SYNC_MASK 0xC0000000u
#    define SAI_TCR2_SYNC_SHIFT 30u
#    define SAI_TCR2_SYNC_WIDTH 2u
#    define SAI_TCR2_SYNC(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR2_SYNC_SHIFT)) & SAI_TCR2_SYNC_MASK)
/* TCR3 Bit Fields */
#    define SAI_TCR3_WDFL_MASK 0xFu
#    define SAI_TCR3_WDFL_SHIFT 0u
#    define SAI_TCR3_WDFL_WIDTH 4u
#    define SAI_TCR3_WDFL(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_WDFL_SHIFT)) & SAI_TCR3_WDFL_MASK)
#    define SAI_TCR3_TCE_MASK 0xF0000u
#    define SAI_TCR3_TCE_SHIFT 16u
#    define SAI_TCR3_TCE_WIDTH 4u
#    define SAI_TCR3_TCE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_TCE_SHIFT)) & SAI_TCR3_TCE_MASK)
#    define SAI_TCR3_CFR_MASK 0xF000000u
#    define SAI_TCR3_CFR_SHIFT 24u
#    define SAI_TCR3_CFR_WIDTH 4u
#    define SAI_TCR3_CFR(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR3_CFR_SHIFT)) & SAI_TCR3_CFR_MASK)
/* TCR4 Bit Fields */
#    define SAI_TCR4_FSD_MASK 0x1u
#    define SAI_TCR4_FSD_SHIFT 0u
#    define SAI_TCR4_FSD_WIDTH 1u
#    define SAI_TCR4_FSD(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSD_SHIFT)) & SAI_TCR4_FSD_MASK)
#    define SAI_TCR4_FSP_MASK 0x2u
#    define SAI_TCR4_FSP_SHIFT 1u
#    define SAI_TCR4_FSP_WIDTH 1u
#    define SAI_TCR4_FSP(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSP_SHIFT)) & SAI_TCR4_FSP_MASK)
#    define SAI_TCR4_ONDEM_MASK 0x4u
#    define SAI_TCR4_ONDEM_SHIFT 2u
#    define SAI_TCR4_ONDEM_WIDTH 1u
#    define SAI_TCR4_ONDEM(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_ONDEM_SHIFT)) & SAI_TCR4_ONDEM_MASK)
#    define SAI_TCR4_FSE_MASK 0x8u
#    define SAI_TCR4_FSE_SHIFT 3u
#    define SAI_TCR4_FSE_WIDTH 1u
#    define SAI_TCR4_FSE(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FSE_SHIFT)) & SAI_TCR4_FSE_MASK)
#    define SAI_TCR4_MF_MASK 0x10u
#    define SAI_TCR4_MF_SHIFT 4u
#    define SAI_TCR4_MF_WIDTH 1u
#    define SAI_TCR4_MF(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_MF_SHIFT)) & SAI_TCR4_MF_MASK)
#    define SAI_TCR4_CHMOD_MASK 0x20u
#    define SAI_TCR4_CHMOD_SHIFT 5u
#    define SAI_TCR4_CHMOD_WIDTH 1u
#    define SAI_TCR4_CHMOD(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_CHMOD_SHIFT)) & SAI_TCR4_CHMOD_MASK)
#    define SAI_TCR4_SYWD_MASK 0x1F00u
#    define SAI_TCR4_SYWD_SHIFT 8u
#    define SAI_TCR4_SYWD_WIDTH 5u
#    define SAI_TCR4_SYWD(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_SYWD_SHIFT)) & SAI_TCR4_SYWD_MASK)
#    define SAI_TCR4_FRSZ_MASK 0xF0000u
#    define SAI_TCR4_FRSZ_SHIFT 16u
#    define SAI_TCR4_FRSZ_WIDTH 4u
#    define SAI_TCR4_FRSZ(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FRSZ_SHIFT)) & SAI_TCR4_FRSZ_MASK)
#    define SAI_TCR4_FPACK_MASK 0x3000000u
#    define SAI_TCR4_FPACK_SHIFT 24u
#    define SAI_TCR4_FPACK_WIDTH 2u
#    define SAI_TCR4_FPACK(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FPACK_SHIFT)) & SAI_TCR4_FPACK_MASK)
#    define SAI_TCR4_FCOMB_MASK 0xC000000u
#    define SAI_TCR4_FCOMB_SHIFT 26u
#    define SAI_TCR4_FCOMB_WIDTH 2u
#    define SAI_TCR4_FCOMB(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FCOMB_SHIFT)) & SAI_TCR4_FCOMB_MASK)
#    define SAI_TCR4_FCONT_MASK 0x10000000u
#    define SAI_TCR4_FCONT_SHIFT 28u
#    define SAI_TCR4_FCONT_WIDTH 1u
#    define SAI_TCR4_FCONT(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR4_FCONT_SHIFT)) & SAI_TCR4_FCONT_MASK)
/* TCR5 Bit Fields */
#    define SAI_TCR5_FBT_MASK 0x1F00u
#    define SAI_TCR5_FBT_SHIFT 8u
#    define SAI_TCR5_FBT_WIDTH 5u
#    define SAI_TCR5_FBT(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_FBT_SHIFT)) & SAI_TCR5_FBT_MASK)
#    define SAI_TCR5_W0W_MASK 0x1F0000u
#    define SAI_TCR5_W0W_SHIFT 16u
#    define SAI_TCR5_W0W_WIDTH 5u
#    define SAI_TCR5_W0W(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_W0W_SHIFT)) & SAI_TCR5_W0W_MASK)
#    define SAI_TCR5_WNW_MASK 0x1F000000u
#    define SAI_TCR5_WNW_SHIFT 24u
#    define SAI_TCR5_WNW_WIDTH 5u
#    define SAI_TCR5_WNW(x) (((uint32_t)(((uint32_t)(x)) << SAI_TCR5_WNW_SHIFT)) & SAI_TCR5_WNW_MASK)
/* TDR Bit Fields */
#    define SAI_TDR_TDR_MASK 0xFFFFFFFFu
#    define SAI_TDR_TDR_SHIFT 0u
#    define SAI_TDR_TDR_WIDTH 32u
#    define SAI_TDR_TDR(x) (((uint32_t)(((uint32_t)(x)) << SAI_TDR_TDR_SHIFT)) & SAI_TDR_TDR_MASK)
/* TFR Bit Fields */
#    define SAI_TFR_RFP_MASK 0xFu
#    define SAI_TFR_RFP_SHIFT 0u
#    define SAI_TFR_RFP_WIDTH 4u
#    define SAI_TFR_RFP(x) (((uint32_t)(((uint32_t)(x)) << SAI_TFR_RFP_SHIFT)) & SAI_TFR_RFP_MASK)
#    define SAI_TFR_WFP_MASK 0xF0000u
#    define SAI_TFR_WFP_SHIFT 16u
#    define SAI_TFR_WFP_WIDTH 4u
#    define SAI_TFR_WFP(x) (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WFP_SHIFT)) & SAI_TFR_WFP_MASK)
#    define SAI_TFR_WCP_MASK 0x80000000u
#    define SAI_TFR_WCP_SHIFT 31u
#    define SAI_TFR_WCP_WIDTH 1u
#    define SAI_TFR_WCP(x) (((uint32_t)(((uint32_t)(x)) << SAI_TFR_WCP_SHIFT)) & SAI_TFR_WCP_MASK)
/* TMR Bit Fields */
#    define SAI_TMR_TWM_MASK 0xFFFFu
#    define SAI_TMR_TWM_SHIFT 0u
#    define SAI_TMR_TWM_WIDTH 16u
#    define SAI_TMR_TWM(x) (((uint32_t)(((uint32_t)(x)) << SAI_TMR_TWM_SHIFT)) & SAI_TMR_TWM_MASK)
/* RCSR Bit Fields */
#    define SAI_RCSR_FRDE_MASK 0x1u
#    define SAI_RCSR_FRDE_SHIFT 0u
#    define SAI_RCSR_FRDE_WIDTH 1u
#    define SAI_RCSR_FRDE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRDE_SHIFT)) & SAI_RCSR_FRDE_MASK)
#    define SAI_RCSR_FWDE_MASK 0x2u
#    define SAI_RCSR_FWDE_SHIFT 1u
#    define SAI_RCSR_FWDE_WIDTH 1u
#    define SAI_RCSR_FWDE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWDE_SHIFT)) & SAI_RCSR_FWDE_MASK)
#    define SAI_RCSR_FRIE_MASK 0x100u
#    define SAI_RCSR_FRIE_SHIFT 8u
#    define SAI_RCSR_FRIE_WIDTH 1u
#    define SAI_RCSR_FRIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRIE_SHIFT)) & SAI_RCSR_FRIE_MASK)
#    define SAI_RCSR_FWIE_MASK 0x200u
#    define SAI_RCSR_FWIE_SHIFT 9u
#    define SAI_RCSR_FWIE_WIDTH 1u
#    define SAI_RCSR_FWIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWIE_SHIFT)) & SAI_RCSR_FWIE_MASK)
#    define SAI_RCSR_FEIE_MASK 0x400u
#    define SAI_RCSR_FEIE_SHIFT 10u
#    define SAI_RCSR_FEIE_WIDTH 1u
#    define SAI_RCSR_FEIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEIE_SHIFT)) & SAI_RCSR_FEIE_MASK)
#    define SAI_RCSR_SEIE_MASK 0x800u
#    define SAI_RCSR_SEIE_SHIFT 11u
#    define SAI_RCSR_SEIE_WIDTH 1u
#    define SAI_RCSR_SEIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEIE_SHIFT)) & SAI_RCSR_SEIE_MASK)
#    define SAI_RCSR_WSIE_MASK 0x1000u
#    define SAI_RCSR_WSIE_SHIFT 12u
#    define SAI_RCSR_WSIE_WIDTH 1u
#    define SAI_RCSR_WSIE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSIE_SHIFT)) & SAI_RCSR_WSIE_MASK)
#    define SAI_RCSR_FRF_MASK 0x10000u
#    define SAI_RCSR_FRF_SHIFT 16u
#    define SAI_RCSR_FRF_WIDTH 1u
#    define SAI_RCSR_FRF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FRF_SHIFT)) & SAI_RCSR_FRF_MASK)
#    define SAI_RCSR_FWF_MASK 0x20000u
#    define SAI_RCSR_FWF_SHIFT 17u
#    define SAI_RCSR_FWF_WIDTH 1u
#    define SAI_RCSR_FWF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FWF_SHIFT)) & SAI_RCSR_FWF_MASK)
#    define SAI_RCSR_FEF_MASK 0x40000u
#    define SAI_RCSR_FEF_SHIFT 18u
#    define SAI_RCSR_FEF_WIDTH 1u
#    define SAI_RCSR_FEF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FEF_SHIFT)) & SAI_RCSR_FEF_MASK)
#    define SAI_RCSR_SEF_MASK 0x80000u
#    define SAI_RCSR_SEF_SHIFT 19u
#    define SAI_RCSR_SEF_WIDTH 1u
#    define SAI_RCSR_SEF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SEF_SHIFT)) & SAI_RCSR_SEF_MASK)
#    define SAI_RCSR_WSF_MASK 0x100000u
#    define SAI_RCSR_WSF_SHIFT 20u
#    define SAI_RCSR_WSF_WIDTH 1u
#    define SAI_RCSR_WSF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_WSF_SHIFT)) & SAI_RCSR_WSF_MASK)
#    define SAI_RCSR_SR_MASK 0x1000000u
#    define SAI_RCSR_SR_SHIFT 24u
#    define SAI_RCSR_SR_WIDTH 1u
#    define SAI_RCSR_SR(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_SR_SHIFT)) & SAI_RCSR_SR_MASK)
#    define SAI_RCSR_FR_MASK 0x2000000u
#    define SAI_RCSR_FR_SHIFT 25u
#    define SAI_RCSR_FR_WIDTH 1u
#    define SAI_RCSR_FR(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_FR_SHIFT)) & SAI_RCSR_FR_MASK)
#    define SAI_RCSR_BCE_MASK 0x10000000u
#    define SAI_RCSR_BCE_SHIFT 28u
#    define SAI_RCSR_BCE_WIDTH 1u
#    define SAI_RCSR_BCE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_BCE_SHIFT)) & SAI_RCSR_BCE_MASK)
#    define SAI_RCSR_DBGE_MASK 0x20000000u
#    define SAI_RCSR_DBGE_SHIFT 29u
#    define SAI_RCSR_DBGE_WIDTH 1u
#    define SAI_RCSR_DBGE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_DBGE_SHIFT)) & SAI_RCSR_DBGE_MASK)
#    define SAI_RCSR_RE_MASK 0x80000000u
#    define SAI_RCSR_RE_SHIFT 31u
#    define SAI_RCSR_RE_WIDTH 1u
#    define SAI_RCSR_RE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCSR_RE_SHIFT)) & SAI_RCSR_RE_MASK)
/* RCR1 Bit Fields */
#    define SAI_RCR1_RFW_MASK 0x7u
#    define SAI_RCR1_RFW_SHIFT 0u
#    define SAI_RCR1_RFW_WIDTH 3u
#    define SAI_RCR1_RFW(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR1_RFW_SHIFT)) & SAI_RCR1_RFW_MASK)
/* RCR2 Bit Fields */
#    define SAI_RCR2_DIV_MASK 0xFFu
#    define SAI_RCR2_DIV_SHIFT 0u
#    define SAI_RCR2_DIV_WIDTH 8u
#    define SAI_RCR2_DIV(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_DIV_SHIFT)) & SAI_RCR2_DIV_MASK)
#    define SAI_RCR2_BCD_MASK 0x1000000u
#    define SAI_RCR2_BCD_SHIFT 24u
#    define SAI_RCR2_BCD_WIDTH 1u
#    define SAI_RCR2_BCD(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCD_SHIFT)) & SAI_RCR2_BCD_MASK)
#    define SAI_RCR2_BCP_MASK 0x2000000u
#    define SAI_RCR2_BCP_SHIFT 25u
#    define SAI_RCR2_BCP_WIDTH 1u
#    define SAI_RCR2_BCP(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCP_SHIFT)) & SAI_RCR2_BCP_MASK)
#    define SAI_RCR2_MSEL_MASK 0xC000000u
#    define SAI_RCR2_MSEL_SHIFT 26u
#    define SAI_RCR2_MSEL_WIDTH 2u
#    define SAI_RCR2_MSEL(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_MSEL_SHIFT)) & SAI_RCR2_MSEL_MASK)
#    define SAI_RCR2_BCI_MASK 0x10000000u
#    define SAI_RCR2_BCI_SHIFT 28u
#    define SAI_RCR2_BCI_WIDTH 1u
#    define SAI_RCR2_BCI(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCI_SHIFT)) & SAI_RCR2_BCI_MASK)
#    define SAI_RCR2_BCS_MASK 0x20000000u
#    define SAI_RCR2_BCS_SHIFT 29u
#    define SAI_RCR2_BCS_WIDTH 1u
#    define SAI_RCR2_BCS(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCS_SHIFT)) & SAI_RCR2_BCS_MASK)
#    define SAI_RCR2_SYNC_MASK 0xC0000000u
#    define SAI_RCR2_SYNC_SHIFT 30u
#    define SAI_RCR2_SYNC_WIDTH 2u
#    define SAI_RCR2_SYNC(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_SYNC_SHIFT)) & SAI_RCR2_SYNC_MASK)
/* RCR3 Bit Fields */
#    define SAI_RCR3_WDFL_MASK 0xFu
#    define SAI_RCR3_WDFL_SHIFT 0u
#    define SAI_RCR3_WDFL_WIDTH 4u
#    define SAI_RCR3_WDFL(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_WDFL_SHIFT)) & SAI_RCR3_WDFL_MASK)
#    define SAI_RCR3_RCE_MASK 0xF0000u
#    define SAI_RCR3_RCE_SHIFT 16u
#    define SAI_RCR3_RCE_WIDTH 4u
#    define SAI_RCR3_RCE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_RCE_SHIFT)) & SAI_RCR3_RCE_MASK)
#    define SAI_RCR3_CFR_MASK 0xF000000u
#    define SAI_RCR3_CFR_SHIFT 24u
#    define SAI_RCR3_CFR_WIDTH 4u
#    define SAI_RCR3_CFR(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_CFR_SHIFT)) & SAI_RCR3_CFR_MASK)
/* RCR4 Bit Fields */
#    define SAI_RCR4_FSD_MASK 0x1u
#    define SAI_RCR4_FSD_SHIFT 0u
#    define SAI_RCR4_FSD_WIDTH 1u
#    define SAI_RCR4_FSD(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSD_SHIFT)) & SAI_RCR4_FSD_MASK)
#    define SAI_RCR4_FSP_MASK 0x2u
#    define SAI_RCR4_FSP_SHIFT 1u
#    define SAI_RCR4_FSP_WIDTH 1u
#    define SAI_RCR4_FSP(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSP_SHIFT)) & SAI_RCR4_FSP_MASK)
#    define SAI_RCR4_ONDEM_MASK 0x4u
#    define SAI_RCR4_ONDEM_SHIFT 2u
#    define SAI_RCR4_ONDEM_WIDTH 1u
#    define SAI_RCR4_ONDEM(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_ONDEM_SHIFT)) & SAI_RCR4_ONDEM_MASK)
#    define SAI_RCR4_FSE_MASK 0x8u
#    define SAI_RCR4_FSE_SHIFT 3u
#    define SAI_RCR4_FSE_WIDTH 1u
#    define SAI_RCR4_FSE(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSE_SHIFT)) & SAI_RCR4_FSE_MASK)
#    define SAI_RCR4_MF_MASK 0x10u
#    define SAI_RCR4_MF_SHIFT 4u
#    define SAI_RCR4_MF_WIDTH 1u
#    define SAI_RCR4_MF(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_MF_SHIFT)) & SAI_RCR4_MF_MASK)
#    define SAI_RCR4_SYWD_MASK 0x1F00u
#    define SAI_RCR4_SYWD_SHIFT 8u
#    define SAI_RCR4_SYWD_WIDTH 5u
#    define SAI_RCR4_SYWD(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_SYWD_SHIFT)) & SAI_RCR4_SYWD_MASK)
#    define SAI_RCR4_FRSZ_MASK 0xF0000u
#    define SAI_RCR4_FRSZ_SHIFT 16u
#    define SAI_RCR4_FRSZ_WIDTH 4u
#    define SAI_RCR4_FRSZ(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FRSZ_SHIFT)) & SAI_RCR4_FRSZ_MASK)
#    define SAI_RCR4_FPACK_MASK 0x3000000u
#    define SAI_RCR4_FPACK_SHIFT 24u
#    define SAI_RCR4_FPACK_WIDTH 2u
#    define SAI_RCR4_FPACK(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FPACK_SHIFT)) & SAI_RCR4_FPACK_MASK)
#    define SAI_RCR4_FCOMB_MASK 0xC000000u
#    define SAI_RCR4_FCOMB_SHIFT 26u
#    define SAI_RCR4_FCOMB_WIDTH 2u
#    define SAI_RCR4_FCOMB(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCOMB_SHIFT)) & SAI_RCR4_FCOMB_MASK)
#    define SAI_RCR4_FCONT_MASK 0x10000000u
#    define SAI_RCR4_FCONT_SHIFT 28u
#    define SAI_RCR4_FCONT_WIDTH 1u
#    define SAI_RCR4_FCONT(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCONT_SHIFT)) & SAI_RCR4_FCONT_MASK)
/* RCR5 Bit Fields */
#    define SAI_RCR5_FBT_MASK 0x1F00u
#    define SAI_RCR5_FBT_SHIFT 8u
#    define SAI_RCR5_FBT_WIDTH 5u
#    define SAI_RCR5_FBT(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_FBT_SHIFT)) & SAI_RCR5_FBT_MASK)
#    define SAI_RCR5_W0W_MASK 0x1F0000u
#    define SAI_RCR5_W0W_SHIFT 16u
#    define SAI_RCR5_W0W_WIDTH 5u
#    define SAI_RCR5_W0W(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_W0W_SHIFT)) & SAI_RCR5_W0W_MASK)
#    define SAI_RCR5_WNW_MASK 0x1F000000u
#    define SAI_RCR5_WNW_SHIFT 24u
#    define SAI_RCR5_WNW_WIDTH 5u
#    define SAI_RCR5_WNW(x) (((uint32_t)(((uint32_t)(x)) << SAI_RCR5_WNW_SHIFT)) & SAI_RCR5_WNW_MASK)
/* RDR Bit Fields */
#    define SAI_RDR_RDR_MASK 0xFFFFFFFFu
#    define SAI_RDR_RDR_SHIFT 0u
#    define SAI_RDR_RDR_WIDTH 32u
#    define SAI_RDR_RDR(x) (((uint32_t)(((uint32_t)(x)) << SAI_RDR_RDR_SHIFT)) & SAI_RDR_RDR_MASK)
/* RFR Bit Fields */
#    define SAI_RFR_RFP_MASK 0xFu
#    define SAI_RFR_RFP_SHIFT 0u
#    define SAI_RFR_RFP_WIDTH 4u
#    define SAI_RFR_RFP(x) (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RFP_SHIFT)) & SAI_RFR_RFP_MASK)
#    define SAI_RFR_RCP_MASK 0x8000u
#    define SAI_RFR_RCP_SHIFT 15u
#    define SAI_RFR_RCP_WIDTH 1u
#    define SAI_RFR_RCP(x) (((uint32_t)(((uint32_t)(x)) << SAI_RFR_RCP_SHIFT)) & SAI_RFR_RCP_MASK)
#    define SAI_RFR_WFP_MASK 0xF0000u
#    define SAI_RFR_WFP_SHIFT 16u
#    define SAI_RFR_WFP_WIDTH 4u
#    define SAI_RFR_WFP(x) (((uint32_t)(((uint32_t)(x)) << SAI_RFR_WFP_SHIFT)) & SAI_RFR_WFP_MASK)
/* RMR Bit Fields */
#    define SAI_RMR_RWM_MASK 0xFFFFu
#    define SAI_RMR_RWM_SHIFT 0u
#    define SAI_RMR_RWM_WIDTH 16u
#    define SAI_RMR_RWM(x) (((uint32_t)(((uint32_t)(x)) << SAI_RMR_RWM_SHIFT)) & SAI_RMR_RWM_MASK)

/*!
 * @}
 */ /* end of group SAI_Register_Masks */

/*!
 * @}
 */ /* end of group SAI_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- SCG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCG_Peripheral_Access_Layer SCG Peripheral Access Layer
 * @{
 */

/** SCG - Size of Registers Arrays */

