OpenCyphal-Garage/libcyphal/test/ontarget/S32K148EVB/include/S32K148.h
/** SMC - Register Layout Typedef */
typedef struct
{
    __I uint32_t VERID;     /**< SMC Version ID Register, offset: 0x0 */
    __I uint32_t PARAM;     /**< SMC Parameter Register, offset: 0x4 */
    __IO uint32_t PMPROT;   /**< Power Mode Protection register, offset: 0x8 */
    __IO uint32_t PMCTRL;   /**< Power Mode Control register, offset: 0xC */
    __IO uint32_t STOPCTRL; /**< Stop Control Register, offset: 0x10 */
    __I uint32_t PMSTAT;    /**< Power Mode Status register, offset: 0x14 */
} SMC_Type, *SMC_MemMapPtr;

/** Number of instances of the SMC module. */
#    define SMC_INSTANCE_COUNT (1u)

/* SMC - Peripheral instance base addresses */
/** Peripheral SMC base address */
#    define SMC_BASE (0x4007E000u)
/** Peripheral SMC base pointer */
#    define SMC ((SMC_Type*) SMC_BASE)
/** Array initializer of SMC peripheral base addresses */
#    define SMC_BASE_ADDRS \
        {                  \
            SMC_BASE       \
        }
/** Array initializer of SMC peripheral base pointers */
#    define SMC_BASE_PTRS \
        {                 \
            SMC           \
        }

/* ----------------------------------------------------------------------------
   -- SMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMC_Register_Masks SMC Register Masks
 * @{
 */

/* VERID Bit Fields */
#    define SMC_VERID_FEATURE_MASK 0xFFFFu
#    define SMC_VERID_FEATURE_SHIFT 0u
#    define SMC_VERID_FEATURE_WIDTH 16u
#    define SMC_VERID_FEATURE(x) (((uint32_t)(((uint32_t)(x)) << SMC_VERID_FEATURE_SHIFT)) & SMC_VERID_FEATURE_MASK)
#    define SMC_VERID_MINOR_MASK 0xFF0000u
#    define SMC_VERID_MINOR_SHIFT 16u
#    define SMC_VERID_MINOR_WIDTH 8u
#    define SMC_VERID_MINOR(x) (((uint32_t)(((uint32_t)(x)) << SMC_VERID_MINOR_SHIFT)) & SMC_VERID_MINOR_MASK)
#    define SMC_VERID_MAJOR_MASK 0xFF000000u
#    define SMC_VERID_MAJOR_SHIFT 24u
#    define SMC_VERID_MAJOR_WIDTH 8u
#    define SMC_VERID_MAJOR(x) (((uint32_t)(((uint32_t)(x)) << SMC_VERID_MAJOR_SHIFT)) & SMC_VERID_MAJOR_MASK)
/* PARAM Bit Fields */
#    define SMC_PARAM_EHSRUN_MASK 0x1u
#    define SMC_PARAM_EHSRUN_SHIFT 0u
#    define SMC_PARAM_EHSRUN_WIDTH 1u
#    define SMC_PARAM_EHSRUN(x) (((uint32_t)(((uint32_t)(x)) << SMC_PARAM_EHSRUN_SHIFT)) & SMC_PARAM_EHSRUN_MASK)
#    define SMC_PARAM_ELLS_MASK 0x8u
#    define SMC_PARAM_ELLS_SHIFT 3u
#    define SMC_PARAM_ELLS_WIDTH 1u
#    define SMC_PARAM_ELLS(x) (((uint32_t)(((uint32_t)(x)) << SMC_PARAM_ELLS_SHIFT)) & SMC_PARAM_ELLS_MASK)
#    define SMC_PARAM_ELLS2_MASK 0x20u
#    define SMC_PARAM_ELLS2_SHIFT 5u
#    define SMC_PARAM_ELLS2_WIDTH 1u
#    define SMC_PARAM_ELLS2(x) (((uint32_t)(((uint32_t)(x)) << SMC_PARAM_ELLS2_SHIFT)) & SMC_PARAM_ELLS2_MASK)
#    define SMC_PARAM_EVLLS0_MASK 0x40u
#    define SMC_PARAM_EVLLS0_SHIFT 6u
#    define SMC_PARAM_EVLLS0_WIDTH 1u
#    define SMC_PARAM_EVLLS0(x) (((uint32_t)(((uint32_t)(x)) << SMC_PARAM_EVLLS0_SHIFT)) & SMC_PARAM_EVLLS0_MASK)
/* PMPROT Bit Fields */
#    define SMC_PMPROT_AVLP_MASK 0x20u
#    define SMC_PMPROT_AVLP_SHIFT 5u
#    define SMC_PMPROT_AVLP_WIDTH 1u
#    define SMC_PMPROT_AVLP(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMPROT_AVLP_SHIFT)) & SMC_PMPROT_AVLP_MASK)
#    define SMC_PMPROT_AHSRUN_MASK 0x80u
#    define SMC_PMPROT_AHSRUN_SHIFT 7u
#    define SMC_PMPROT_AHSRUN_WIDTH 1u
#    define SMC_PMPROT_AHSRUN(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMPROT_AHSRUN_SHIFT)) & SMC_PMPROT_AHSRUN_MASK)
/* PMCTRL Bit Fields */
#    define SMC_PMCTRL_STOPM_MASK 0x7u
#    define SMC_PMCTRL_STOPM_SHIFT 0u
#    define SMC_PMCTRL_STOPM_WIDTH 3u
#    define SMC_PMCTRL_STOPM(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMCTRL_STOPM_SHIFT)) & SMC_PMCTRL_STOPM_MASK)
#    define SMC_PMCTRL_VLPSA_MASK 0x8u
#    define SMC_PMCTRL_VLPSA_SHIFT 3u
#    define SMC_PMCTRL_VLPSA_WIDTH 1u
#    define SMC_PMCTRL_VLPSA(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMCTRL_VLPSA_SHIFT)) & SMC_PMCTRL_VLPSA_MASK)
#    define SMC_PMCTRL_RUNM_MASK 0x60u
#    define SMC_PMCTRL_RUNM_SHIFT 5u
#    define SMC_PMCTRL_RUNM_WIDTH 2u
#    define SMC_PMCTRL_RUNM(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMCTRL_RUNM_SHIFT)) & SMC_PMCTRL_RUNM_MASK)
/* STOPCTRL Bit Fields */
#    define SMC_STOPCTRL_STOPO_MASK 0xC0u
#    define SMC_STOPCTRL_STOPO_SHIFT 6u
#    define SMC_STOPCTRL_STOPO_WIDTH 2u
#    define SMC_STOPCTRL_STOPO(x) (((uint32_t)(((uint32_t)(x)) << SMC_STOPCTRL_STOPO_SHIFT)) & SMC_STOPCTRL_STOPO_MASK)
/* PMSTAT Bit Fields */
#    define SMC_PMSTAT_PMSTAT_MASK 0xFFu
#    define SMC_PMSTAT_PMSTAT_SHIFT 0u
#    define SMC_PMSTAT_PMSTAT_WIDTH 8u
#    define SMC_PMSTAT_PMSTAT(x) (((uint32_t)(((uint32_t)(x)) << SMC_PMSTAT_PMSTAT_SHIFT)) & SMC_PMSTAT_PMSTAT_MASK)

/*!
 * @}
 */ /* end of group SMC_Register_Masks */

/*!
 * @}
 */ /* end of group SMC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- TRGMUX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRGMUX_Peripheral_Access_Layer TRGMUX Peripheral Access Layer
 * @{
 */

/** TRGMUX - Size of Registers Arrays */
#    define TRGMUX_TRGMUXn_COUNT 32u

/** TRGMUX - Register Layout Typedef */
typedef struct
{
    __IO uint32_t TRGMUXn[TRGMUX_TRGMUXn_COUNT]; /**< TRGMUX DMAMUX0 Register..TRGMUX FTM7 Register, array offset: 0x0,
                                                    array step: 0x4 */
} TRGMUX_Type, *TRGMUX_MemMapPtr;

/** Number of instances of the TRGMUX module. */
#    define TRGMUX_INSTANCE_COUNT (1u)

/* TRGMUX - Peripheral instance base addresses */
/** Peripheral TRGMUX base address */
#    define TRGMUX_BASE (0x40063000u)
/** Peripheral TRGMUX base pointer */
#    define TRGMUX ((TRGMUX_Type*) TRGMUX_BASE)
/** Array initializer of TRGMUX peripheral base addresses */
#    define TRGMUX_BASE_ADDRS \
        {                     \
            TRGMUX_BASE       \
        }
/** Array initializer of TRGMUX peripheral base pointers */
#    define TRGMUX_BASE_PTRS \
        {                    \
            TRGMUX           \
        }

/* TRGMUX index offsets */
#    define TRGMUX_DMAMUX0_INDEX 0
#    define TRGMUX_EXTOUT0_INDEX 1
#    define TRGMUX_EXTOUT1_INDEX 2
#    define TRGMUX_ADC0_INDEX 3
#    define TRGMUX_ADC1_INDEX 4
#    define TRGMUX_CMP0_INDEX 7
#    define TRGMUX_FTM0_INDEX 10
#    define TRGMUX_FTM1_INDEX 11
#    define TRGMUX_FTM2_INDEX 12
#    define TRGMUX_FTM3_INDEX 13
#    define TRGMUX_PDB0_INDEX 14
#    define TRGMUX_PDB1_INDEX 15
#    define TRGMUX_FLEXIO_INDEX 17
#    define TRGMUX_LPIT0_INDEX 18
#    define TRGMUX_LPUART0_INDEX 19
#    define TRGMUX_LPUART1_INDEX 20
#    define TRGMUX_LPI2C0_INDEX 21
#    define TRGMUX_LPSPI0_INDEX 23
#    define TRGMUX_LPSPI1_INDEX 24
#    define TRGMUX_LPTMR0_INDEX 25
#    define TRGMUX_LPI2C1_INDEX 27
#    define TRGMUX_FTM4_INDEX 28
#    define TRGMUX_FTM5_INDEX 29
#    define TRGMUX_FTM6_INDEX 30
#    define TRGMUX_FTM7_INDEX 31

/* ----------------------------------------------------------------------------
   -- TRGMUX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TRGMUX_Register_Masks TRGMUX Register Masks
 * @{
 */

/* TRGMUXn Bit Fields */
#    define TRGMUX_TRGMUXn_SEL0_MASK 0x7Fu
#    define TRGMUX_TRGMUXn_SEL0_SHIFT 0u
#    define TRGMUX_TRGMUXn_SEL0_WIDTH 7u
#    define TRGMUX_TRGMUXn_SEL0(x) \
        (((uint32_t)(((uint32_t)(x)) << TRGMUX_TRGMUXn_SEL0_SHIFT)) & TRGMUX_TRGMUXn_SEL0_MASK)
#    define TRGMUX_TRGMUXn_SEL1_MASK 0x7F00u
#    define TRGMUX_TRGMUXn_SEL1_SHIFT 8u
#    define TRGMUX_TRGMUXn_SEL1_WIDTH 7u
#    define TRGMUX_TRGMUXn_SEL1(x) \
        (((uint32_t)(((uint32_t)(x)) << TRGMUX_TRGMUXn_SEL1_SHIFT)) & TRGMUX_TRGMUXn_SEL1_MASK)
#    define TRGMUX_TRGMUXn_SEL2_MASK 0x7F0000u
#    define TRGMUX_TRGMUXn_SEL2_SHIFT 16u
#    define TRGMUX_TRGMUXn_SEL2_WIDTH 7u
#    define TRGMUX_TRGMUXn_SEL2(x) \
        (((uint32_t)(((uint32_t)(x)) << TRGMUX_TRGMUXn_SEL2_SHIFT)) & TRGMUX_TRGMUXn_SEL2_MASK)
#    define TRGMUX_TRGMUXn_SEL3_MASK 0x7F000000u
#    define TRGMUX_TRGMUXn_SEL3_SHIFT 24u
#    define TRGMUX_TRGMUXn_SEL3_WIDTH 7u
#    define TRGMUX_TRGMUXn_SEL3(x) \
        (((uint32_t)(((uint32_t)(x)) << TRGMUX_TRGMUXn_SEL3_SHIFT)) & TRGMUX_TRGMUXn_SEL3_MASK)
#    define TRGMUX_TRGMUXn_LK_MASK 0x80000000u
#    define TRGMUX_TRGMUXn_LK_SHIFT 31u
#    define TRGMUX_TRGMUXn_LK_WIDTH 1u
#    define TRGMUX_TRGMUXn_LK(x) (((uint32_t)(((uint32_t)(x)) << TRGMUX_TRGMUXn_LK_SHIFT)) & TRGMUX_TRGMUXn_LK_MASK)

/*!
 * @}
 */ /* end of group TRGMUX_Register_Masks */

/*!
 * @}
 */ /* end of group TRGMUX_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- WDOG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Peripheral_Access_Layer WDOG Peripheral Access Layer
 * @{
 */

/** WDOG - Size of Registers Arrays */

/** WDOG - Register Layout Typedef */
typedef struct
{
    __IO uint32_t CS;    /**< Watchdog Control and Status Register, offset: 0x0 */
    __IO uint32_t CNT;   /**< Watchdog Counter Register, offset: 0x4 */
    __IO uint32_t TOVAL; /**< Watchdog Timeout Value Register, offset: 0x8 */
    __IO uint32_t WIN;   /**< Watchdog Window Register, offset: 0xC */
} WDOG_Type, *WDOG_MemMapPtr;

/** Number of instances of the WDOG module. */
#    define WDOG_INSTANCE_COUNT (1u)

/* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG base address */
#    define WDOG_BASE (0x40052000u)
/** Peripheral WDOG base pointer */
#    define WDOG ((WDOG_Type*) WDOG_BASE)
/** Array initializer of WDOG peripheral base addresses */
#    define WDOG_BASE_ADDRS \
        {                   \
            WDOG_BASE       \
        }
/** Array initializer of WDOG peripheral base pointers */
#    define WDOG_BASE_PTRS \
        {                  \
            WDOG           \
        }
/** Number of interrupt vector arrays for the WDOG module. */
#    define WDOG_IRQS_ARR_COUNT (1u)
/** Number of interrupt channels for the WDOG module. */
#    define WDOG_IRQS_CH_COUNT (1u)
/** Interrupt vectors for the WDOG peripheral type */
#    define WDOG_IRQS     \
        {                 \
            WDOG_EWM_IRQn \
        }

/* ----------------------------------------------------------------------------
   -- WDOG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Register_Masks WDOG Register Masks
 * @{
 */

/* CS Bit Fields */
#    define WDOG_CS_STOP_MASK 0x1u
#    define WDOG_CS_STOP_SHIFT 0u
#    define WDOG_CS_STOP_WIDTH 1u
#    define WDOG_CS_STOP(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_STOP_SHIFT)) & WDOG_CS_STOP_MASK)
#    define WDOG_CS_WAIT_MASK 0x2u
#    define WDOG_CS_WAIT_SHIFT 1u
#    define WDOG_CS_WAIT_WIDTH 1u
#    define WDOG_CS_WAIT(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_WAIT_SHIFT)) & WDOG_CS_WAIT_MASK)
#    define WDOG_CS_DBG_MASK 0x4u
#    define WDOG_CS_DBG_SHIFT 2u
#    define WDOG_CS_DBG_WIDTH 1u
#    define WDOG_CS_DBG(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_DBG_SHIFT)) & WDOG_CS_DBG_MASK)
#    define WDOG_CS_TST_MASK 0x18u
#    define WDOG_CS_TST_SHIFT 3u
#    define WDOG_CS_TST_WIDTH 2u
#    define WDOG_CS_TST(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_TST_SHIFT)) & WDOG_CS_TST_MASK)
#    define WDOG_CS_UPDATE_MASK 0x20u
#    define WDOG_CS_UPDATE_SHIFT 5u
#    define WDOG_CS_UPDATE_WIDTH 1u
#    define WDOG_CS_UPDATE(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_UPDATE_SHIFT)) & WDOG_CS_UPDATE_MASK)
#    define WDOG_CS_INT_MASK 0x40u
#    define WDOG_CS_INT_SHIFT 6u
#    define WDOG_CS_INT_WIDTH 1u
#    define WDOG_CS_INT(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_INT_SHIFT)) & WDOG_CS_INT_MASK)
#    define WDOG_CS_EN_MASK 0x80u
#    define WDOG_CS_EN_SHIFT 7u
#    define WDOG_CS_EN_WIDTH 1u
#    define WDOG_CS_EN(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_EN_SHIFT)) & WDOG_CS_EN_MASK)
#    define WDOG_CS_CLK_MASK 0x300u
#    define WDOG_CS_CLK_SHIFT 8u
#    define WDOG_CS_CLK_WIDTH 2u
#    define WDOG_CS_CLK(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_CLK_SHIFT)) & WDOG_CS_CLK_MASK)
#    define WDOG_CS_RCS_MASK 0x400u
#    define WDOG_CS_RCS_SHIFT 10u
#    define WDOG_CS_RCS_WIDTH 1u
#    define WDOG_CS_RCS(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_RCS_SHIFT)) & WDOG_CS_RCS_MASK)
#    define WDOG_CS_ULK_MASK 0x800u
#    define WDOG_CS_ULK_SHIFT 11u
#    define WDOG_CS_ULK_WIDTH 1u
#    define WDOG_CS_ULK(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_ULK_SHIFT)) & WDOG_CS_ULK_MASK)
#    define WDOG_CS_PRES_MASK 0x1000u
#    define WDOG_CS_PRES_SHIFT 12u
#    define WDOG_CS_PRES_WIDTH 1u
#    define WDOG_CS_PRES(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_PRES_SHIFT)) & WDOG_CS_PRES_MASK)
#    define WDOG_CS_CMD32EN_MASK 0x2000u
#    define WDOG_CS_CMD32EN_SHIFT 13u
#    define WDOG_CS_CMD32EN_WIDTH 1u
#    define WDOG_CS_CMD32EN(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_CMD32EN_SHIFT)) & WDOG_CS_CMD32EN_MASK)
#    define WDOG_CS_FLG_MASK 0x4000u
#    define WDOG_CS_FLG_SHIFT 14u
#    define WDOG_CS_FLG_WIDTH 1u
#    define WDOG_CS_FLG(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_FLG_SHIFT)) & WDOG_CS_FLG_MASK)
#    define WDOG_CS_WIN_MASK 0x8000u
#    define WDOG_CS_WIN_SHIFT 15u
#    define WDOG_CS_WIN_WIDTH 1u
#    define WDOG_CS_WIN(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CS_WIN_SHIFT)) & WDOG_CS_WIN_MASK)
/* CNT Bit Fields */
#    define WDOG_CNT_CNTLOW_MASK 0xFFu
#    define WDOG_CNT_CNTLOW_SHIFT 0u
#    define WDOG_CNT_CNTLOW_WIDTH 8u
#    define WDOG_CNT_CNTLOW(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CNT_CNTLOW_SHIFT)) & WDOG_CNT_CNTLOW_MASK)
#    define WDOG_CNT_CNTHIGH_MASK 0xFF00u
#    define WDOG_CNT_CNTHIGH_SHIFT 8u
#    define WDOG_CNT_CNTHIGH_WIDTH 8u
#    define WDOG_CNT_CNTHIGH(x) (((uint32_t)(((uint32_t)(x)) << WDOG_CNT_CNTHIGH_SHIFT)) & WDOG_CNT_CNTHIGH_MASK)
/* TOVAL Bit Fields */
#    define WDOG_TOVAL_TOVALLOW_MASK 0xFFu
#    define WDOG_TOVAL_TOVALLOW_SHIFT 0u
#    define WDOG_TOVAL_TOVALLOW_WIDTH 8u
#    define WDOG_TOVAL_TOVALLOW(x) \
        (((uint32_t)(((uint32_t)(x)) << WDOG_TOVAL_TOVALLOW_SHIFT)) & WDOG_TOVAL_TOVALLOW_MASK)
#    define WDOG_TOVAL_TOVALHIGH_MASK 0xFF00u
#    define WDOG_TOVAL_TOVALHIGH_SHIFT 8u
#    define WDOG_TOVAL_TOVALHIGH_WIDTH 8u
#    define WDOG_TOVAL_TOVALHIGH(x) \
        (((uint32_t)(((uint32_t)(x)) << WDOG_TOVAL_TOVALHIGH_SHIFT)) & WDOG_TOVAL_TOVALHIGH_MASK)
/* WIN Bit Fields */
#    define WDOG_WIN_WINLOW_MASK 0xFFu
#    define WDOG_WIN_WINLOW_SHIFT 0u
#    define WDOG_WIN_WINLOW_WIDTH 8u
#    define WDOG_WIN_WINLOW(x) (((uint32_t)(((uint32_t)(x)) << WDOG_WIN_WINLOW_SHIFT)) & WDOG_WIN_WINLOW_MASK)
#    define WDOG_WIN_WINHIGH_MASK 0xFF00u
#    define WDOG_WIN_WINHIGH_SHIFT 8u
#    define WDOG_WIN_WINHIGH_WIDTH 8u
#    define WDOG_WIN_WINHIGH(x) (((uint32_t)(((uint32_t)(x)) << WDOG_WIN_WINHIGH_SHIFT)) & WDOG_WIN_WINHIGH_MASK)

/*!
 * @}
 */ /* end of group WDOG_Register_Masks */

/*!
 * @}
 */ /* end of group WDOG_Peripheral_Access_Layer */

/*!
 * @}
 */ /* end of group Peripheral_access_layer_S32K148 */

/* ----------------------------------------------------------------------------
   -- Backward Compatibility for S32K148
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols_S32K148 Backward Compatibility for S32K148
 * @{
 */

/* No backward compatibility issues. */

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols_S32K148 */

#else /* #if !defined(S32K148_H_) */
/* There is already included the same memory map. Check if it is compatible (has the same major version) */
#    if (MCU_MEM_MAP_VERSION != 0x0200u)
#        if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
#            warning There are included two not compatible versions of memory maps. Please check possible differences.
#        endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
#    endif     /* (MCU_MEM_MAP_VERSION != 0x0200u) */
#endif         /* #if !defined(S32K148_H_) */

/* S32K148.h, eof. */
